programming/c/code/c-lang.org
#+Title: The C Programming Language
#+OPTIONS: ^:nil num:nil author:nil email:nil creator:nil timestamp:nil

* Chapter 1 - A Tutorial Introduction

** hello.c

- =$ gcc hello.c=
- =./a.out=

#+BEGIN_SRC c :tangle hello.c
  #include <stdio.h>

  main()
  {
      printf("hello, world\n");
  }
#+END_SRC

** The first C program hello world

- =$ gcc hello2.c=
- =./a.out=

#+BEGIN_SRC c :tangle hello2.c
  #include <stdio.h>

  main()
  {
      printf("hello, world\n");
  }
#+END_SRC

- include information about standard library
- define a function called =main= that received no argument values
- statements of =main= are enclosed in braces
- main calls library function =printf= to print this sequence of
  characters =\n= represents the newline character

** hello world

- =$ gcc hello3.c=
- =./a.out=

#+BEGIN_SRC c :tangle hello3.c
  #include <stdio.h>

  main()
  {
      printf("hello, ");
      printf("world");
      printf("\n");
  }
#+END_SRC

** fahrenheit-celsius

- =$ gcc fc1.c=
- =./a.out=

#+BEGIN_SRC c :tangle fc1.c
  #include <stdio.h>

  /* print Fahrenheit-Celsius table for fahr = 0, 20, ..., 300 */

  main()
  {
      int fahr, celsius;
      int lower, upper, step;

      lower = 0;                  /* lower limit of temperature scale */
      upper = 300;                /* upper limit */
      step = 20;                  /* step size */

      fahr = lower;
      while (fahr <= upper) {
          celsius = 5 * (fahr - 32) / 9;
          printf("%d\t%d\n", fahr, celsius);
          fahr = fahr + step;
      }
  }
#+END_SRC

** fahrenheit-celsius floating point

- =$ gcc fc2.c=
- =./a.out=

#+BEGIN_SRC c :tangle fc2.c
  #include <stdio.h>

  /* print Fahrenheit-Celsius table for fahr = 0, 20, ..., 300;
     floating-point version */

  main()
  {
      float fahr, celsius;
      float lower, upper, step;

      lower = 0;                  /* lower limit of temperature scale */
      upper = 300;                /* upper limit */
      step = 20;                  /* step size */

      fahr = lower;
      while (fahr <= upper) {
          celsius = (5.0 / 9.0) * (fahr - 32.0);
          printf("%3.0f %6.1f\n", fahr, celsius);
          fahr = fahr + step;
      }
  }
#+END_SRC

