programming/c/code/c-lang.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>The C Programming Language</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<h1 class="title">The C Programming Language</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org361db18">Chapter 1 - A Tutorial Introduction</a>
<ul>
<li><a href="#org02af604">hello.c</a></li>
<li><a href="#orgba08383">The first C program hello world</a></li>
<li><a href="#org089a222">hello world</a></li>
<li><a href="#org3963879">fahrenheit-celsius</a></li>
<li><a href="#org82cec71">fahrenheit-celsius floating point</a></li>
<li><a href="#org02b6531">fahrenheit-celsius table (in one go?)</a></li>
<li><a href="#orge2be71b">fahrenheit-celsius constants</a></li>
<li><a href="#org6516e5e">file copy</a></li>
<li><a href="#orgda4f157">file copy 2</a></li>
<li><a href="#org04ae726">count chars 1</a></li>
<li><a href="#orgd53b011">count chars 2</a></li>
<li><a href="#org7b0b69c">count lines</a></li>
<li><a href="#org97e06d4">word counting</a></li>
<li><a href="#orgef4974c">arrays</a></li>
<li><a href="#org0ea7d01">functions</a></li>
<li><a href="#orgb7e5d16">character arrays</a></li>
<li><a href="#org5ccdadb">external variables and scope</a></li>
</ul>
</li>
<li><a href="#org16332b1">Chapter 2 - Types, Operators and Expressions</a>
<ul>
<li><a href="#org51e4964">function: strlen</a></li>
<li><a href="#orgc3646c5">function: atoi</a></li>
<li><a href="#org9da433e">function: lower</a></li>
<li><a href="#org6efbe47">function: rand</a></li>
<li><a href="#org0bf3c74">function: squeeze</a></li>
<li><a href="#org621dfd5">function: strcat</a></li>
<li><a href="#org6c0a960">function: getbits</a></li>
<li><a href="#org86ce606">function: bitcount</a></li>
</ul>
</li>
<li><a href="#org08c225a">Chapter 3 - Control Flow</a>
<ul>
<li><a href="#orgc4de3bd">function: binsearch</a></li>
<li><a href="#org088a1fa">program: count digits, white space, others (switch)</a></li>
<li><a href="#org01ec0fa">function: atoi</a></li>
<li><a href="#org9b5d66c">function: shellsort</a></li>
<li><a href="#org1c6a491">function: reverse</a></li>
<li><a href="#orgffef630">function: itoa</a></li>
<li><a href="#org2f59d66">function: trim</a></li>
</ul>
</li>
<li><a href="#org736b273">Chapter 4 - Functions and Program Structure</a>
<ul>
<li><a href="#orgd0ae48a">program: find all lines matching pattern</a></li>
<li><a href="#orgfb929ad">function: atof</a></li>
<li><a href="#org22d09f9">program: calculator</a></li>
<li><a href="#org4910d5a">function: atoi (rewrite)</a></li>
<li><a href="#org31931f8">program: reverse polish calculator</a></li>
<li><a href="#org6308984">functions: push &amp; pop</a></li>
<li><a href="#org6c3ef88">program: complete cal</a></li>
<li><a href="#org027bed8">function: getop</a></li>
<li><a href="#org8642f5c">funcions: getch &amp; ungetch</a></li>
<li><a href="#org9261f8e">function: printd (recursion example)</a></li>
<li><a href="#org3bb0785">functions: qsort &amp; swap</a></li>
</ul>
</li>
<li><a href="#org825c7b5">Chapter 5 - Pointers and Arrays</a>
<ul>
<li><a href="#org73d2d80">function: swap (with pointers)</a></li>
<li><a href="#org02c93cb">function: getint</a></li>
<li><a href="#org258bf5c">function: strlen</a></li>
<li><a href="#orgce0a000">functions: alloc &amp; afree</a></li>
<li><a href="#org9791fbb">function: strlen</a></li>
<li><a href="#orgf42f5eb">function: strcpy (using arrays)</a></li>
<li><a href="#org940831a">function: strcpy (using pointers)</a></li>
<li><a href="#orgeb4ebdc">function: strcpy (experienced programmers)</a></li>
<li><a href="#org6607a52">function: strcpy (v3)</a></li>
<li><a href="#org317c680">function: strcmp (no pointers)</a></li>
<li><a href="#org310aaa1">function: strcmp (with pointers)</a></li>
<li><a href="#org2be6ee4">program: sort input lines</a></li>
<li><a href="#orgfebfd5c">function: writelines</a></li>
<li><a href="#org1252086">function: qsort</a></li>
<li><a href="#orgdf38a0e">function: swap (using char*)</a></li>
<li><a href="#orgcc1f4e9">multi-dimensional array: daytab, functions: day_of_year &amp; month_day</a></li>
<li><a href="#org7c7521e">function: month_name</a></li>
<li><a href="#orge6bc22c">program: krecho v1</a></li>
<li><a href="#orgba43fa0">program: krecho v2</a></li>
<li><a href="#orgd1d2724">program: main</a></li>
<li><a href="#org9642ada">program: find: print lines that match pattern from 1st arg</a></li>
<li><a href="#orgbc53534">program: sort input lines</a></li>
<li><a href="#org5154945">function: qsort</a></li>
<li><a href="#org7eed212">function: numcmp</a></li>
<li><a href="#org48b5a4b">function: swap (using void*)</a></li>
<li><a href="#org2bc463a">functions: dcl &amp; dirdcl</a></li>
<li><a href="#org175d0d8">program: convert declaration to words</a></li>
<li><a href="#org28cc1cc">function: gettoken</a></li>
<li><a href="#org6e78a7d">program: undcl</a></li>
</ul>
</li>
<li><a href="#org05fa51f">Chapter 6 - Structures</a>
<ul>
<li><a href="#org1141698">function: makepoint</a></li>
<li><a href="#orgb53e277">program: using makepoint</a></li>
<li><a href="#org18e31c3">function: addpoint</a></li>
<li><a href="#orgcda6dcb">function: ptinrect</a></li>
<li><a href="#orgb638b9d">function: canonrect</a></li>
<li><a href="#org73b1198">program: keyword-counting (using array indices)</a></li>
<li><a href="#org195366d">function: getword</a></li>
<li><a href="#org7b65d7d">program: keyword-counting (using pointers)</a></li>
<li><a href="#org93c3d14">struct: tnode</a></li>
<li><a href="#orgf4a9332">program: word frequency count</a></li>
<li><a href="#org210f182">function: addtree</a></li>
<li><a href="#org36a351e">function: treeprint</a></li>
<li><a href="#org4f80e42">functions: talloc &amp; strdup</a></li>
<li><a href="#orgf10ab5f">struct: nlist</a></li>
<li><a href="#org704d52c">function: hash</a></li>
<li><a href="#org4ec908e">function: lookup</a></li>
<li><a href="#org89ad133">function: install</a></li>
<li><a href="#org357605e">struct: tnode / Treenode</a></li>
<li><a href="#orgca10ecb">function: talloc</a></li>
</ul>
</li>
<li><a href="#org124149e">Chapter 7 - Input and Output</a>
<ul>
<li><a href="#orgfe8042c">program: convert input to lower case</a></li>
<li><a href="#org7962a6d">program: ex printf myprint.c</a></li>
<li><a href="#org3f25718">program: minimal printf with variable argument list</a></li>
<li><a href="#orgf037b9b">program: calculator</a></li>
<li><a href="#orge1be2d5">program: krcatv1</a></li>
<li><a href="#org1dcbdca">program: cat revised (error handling)</a></li>
<li><a href="#orgc185bc8">functions: fputs &amp; fgets</a></li>
<li><a href="#org5efd2b1">function: getline (using fgets)</a></li>
</ul>
</li>
<li><a href="#org22f30e2">Chapter 8 - The UNIX System Interface</a></li>
</ul>
</div>
</div>

<div id="outline-container-org361db18" class="outline-2">
<h2 id="org361db18">Chapter 1 - A Tutorial Introduction</h2>
<div class="outline-text-2" id="text-org361db18">
</div>
<div id="outline-container-org02af604" class="outline-3">
<h3 id="org02af604">hello.c</h3>
<div class="outline-text-3" id="text-org02af604">
<ul class="org-ul">
<li><code>$ gcc hello.c</code></li>
<li><code>./a.out</code></li>
</ul>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;stdio.h&gt;</span>

<span style="color: #d55e00;">main</span>()
{
    printf(<span style="color: #848ea9;">"hello, world\n"</span>);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgba08383" class="outline-3">
<h3 id="orgba08383">The first C program hello world</h3>
<div class="outline-text-3" id="text-orgba08383">
<ul class="org-ul">
<li><code>$ gcc hello2.c</code></li>
<li><code>./a.out</code></li>
</ul>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;stdio.h&gt;</span>

<span style="color: #d55e00;">main</span>()
{
    printf(<span style="color: #848ea9;">"hello, world\n"</span>);
}
</pre>
</div>

<ul class="org-ul">
<li>include information about standard library</li>
<li>define a function called <code>main</code> that received no argument values</li>
<li>statements of <code>main</code> are enclosed in braces</li>
<li>main calls library function <code>printf</code> to print this sequence of
characters <code>\n</code> represents the newline character</li>
</ul>
</div>
</div>

<div id="outline-container-org089a222" class="outline-3">
<h3 id="org089a222">hello world</h3>
<div class="outline-text-3" id="text-org089a222">
<ul class="org-ul">
<li><code>$ gcc hello3.c</code></li>
<li><code>./a.out</code></li>
</ul>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;stdio.h&gt;</span>

<span style="color: #d55e00;">main</span>()
{
    printf(<span style="color: #848ea9;">"hello, "</span>);
    printf(<span style="color: #848ea9;">"world"</span>);
    printf(<span style="color: #848ea9;">"\n"</span>);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org3963879" class="outline-3">
<h3 id="org3963879">fahrenheit-celsius</h3>
<div class="outline-text-3" id="text-org3963879">
<ul class="org-ul">
<li><code>$ gcc fc1.c</code></li>
<li><code>./a.out</code></li>
</ul>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;stdio.h&gt;</span>

<span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">print Fahrenheit-Celsius table for fahr = 0, 20, ..., 300 </span><span style="color: #009e73; font-style: italic;">*/</span>

<span style="color: #d55e00;">main</span>()
{
    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">fahr</span>, <span style="color: #e69f00; font-weight: bold;">celsius</span>;
    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">lower</span>, <span style="color: #e69f00; font-weight: bold;">upper</span>, <span style="color: #e69f00; font-weight: bold;">step</span>;

    lower = 0;                  <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">lower limit of temperature scale </span><span style="color: #009e73; font-style: italic;">*/</span>
    upper = 300;                <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">upper limit </span><span style="color: #009e73; font-style: italic;">*/</span>
    step = 20;                  <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">step size </span><span style="color: #009e73; font-style: italic;">*/</span>

    fahr = lower;
    <span style="color: #56b4e9; font-weight: bold;">while</span> (fahr &lt;= upper) {
        celsius = 5 * (fahr - 32) / 9;
        printf(<span style="color: #848ea9;">"%d\t%d\n"</span>, fahr, celsius);
        fahr = fahr + step;
    }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org82cec71" class="outline-3">
<h3 id="org82cec71">fahrenheit-celsius floating point</h3>
<div class="outline-text-3" id="text-org82cec71">
<ul class="org-ul">
<li><code>$ gcc fc2.c</code></li>
<li><code>./a.out</code></li>
</ul>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;stdio.h&gt;</span>

<span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">print Fahrenheit-Celsius table for fahr = 0, 20, ..., 300;</span>
<span style="color: #009e73; font-style: italic;">   floating-point version </span><span style="color: #009e73; font-style: italic;">*/</span>

<span style="color: #d55e00;">main</span>()
{
    <span style="color: #0072b2; font-weight: bold;">float</span> <span style="color: #e69f00; font-weight: bold;">fahr</span>, <span style="color: #e69f00; font-weight: bold;">celsius</span>;
    <span style="color: #0072b2; font-weight: bold;">float</span> <span style="color: #e69f00; font-weight: bold;">lower</span>, <span style="color: #e69f00; font-weight: bold;">upper</span>, <span style="color: #e69f00; font-weight: bold;">step</span>;

    lower = 0;                  <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">lower limit of temperature scale </span><span style="color: #009e73; font-style: italic;">*/</span>
    upper = 300;                <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">upper limit </span><span style="color: #009e73; font-style: italic;">*/</span>
    step = 20;                  <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">step size </span><span style="color: #009e73; font-style: italic;">*/</span>

    fahr = lower;
    <span style="color: #56b4e9; font-weight: bold;">while</span> (fahr &lt;= upper) {
        celsius = (5.0 / 9.0) * (fahr - 32.0);
        printf(<span style="color: #848ea9;">"%3.0f %6.1f\n"</span>, fahr, celsius);
        fahr = fahr + step;
    }
}
</pre>
</div>
</div>
</div>
