programming/c/code/c-lang.org
** fahrenheit-celsius table (in one go?)

#+BEGIN_SRC c :tangle fc3.c
  #include <stdio.h>

  /* print Fahrenheit-Celsius table */
  main()
  {
      int fahr;

      for (fahr = 0; fahr <= 300; fahr = fahr + 20)
          printf("%3d %6.1f\n", fahr, (5.0 / 9.0) * (fahr - 32));
  }

#+END_SRC

** fahrenheit-celsius constants

- =$ gcc fc4.c=
- =./a.out=

#+BEGIN_SRC c :tangle fc4.c
  #include <stdio.h>

  #define LOWER  0                /* lower limit of table */
  #define UPPER  300              /* upper limit */
  #define STEP   20               /* step size */

  /* print Fahrenheit-Celsius table */
  main()
  {
      int fahr;

      for (fahr = LOWER; fahr <= UPPER; fahr = fahr + STEP)
          printf("%3d %6.1f\n", fahr, (5.0 / 9.0) * (fahr - 32));
  }
#+END_SRC

** file copy

- =$ gcc filecopy1.c=
- =./a.out=
- enter characters
- C-d to terminate

#+BEGIN_SRC c :tangle filecopy1.c
  #include <stdio.h>

  /* copy input to output; 1st version */
  main()
  {
      int c;

      c = getchar();
      while (c != EOF) {
          putchar(c);
          c = getchar();
      }
  }
#+END_SRC

** file copy 2

- =$ gcc filecopy2.c=
- =./a.out=

#+BEGIN_SRC c :tangle filecopy2.c
  #include <stdio.h>

  /* copy input to output; 2nd version */
  main()
  {
      int c;

      while ((c = getchar()) != EOF)
          putchar(c);
  }
#+END_SRC

** count chars 1

- =$ gcc countchars1.c=
- =./a.out=
- RET C-d to get number of characters. but get extra
- includes newlines in count?

#+BEGIN_SRC c :tangle countchars1.c
  #include <stdio.h>

  /* count characters in input; 1st version */
  main()
  {
      long nc;

      nc = 0;
      while (getchar() != EOF)
          ++nc;
      printf("%ld\n", nc);
  }
#+END_SRC

** count chars 2

- =$ gcc countchars2.c=
- =./a.out=

#+BEGIN_SRC c :tangle countchars2.c
  #include <stdio.h>

  /* count characters in input; 2nd version */
  main()
  {
      double nc;

      for (nc = 0; getchar() != EOF; ++nc);
      printf("%.0f\n", nc);
  }
#+END_SRC

** count lines

- =$ gcc countlines.c=
- =./a.out=
- C-d to get result

#+BEGIN_SRC c :tangle countlines.c
  #include <stdio.h>

  /* count lines in input */
  main()
  {
      int c, nl;

      nl = 0;
      while ((c = getchar()) != EOF)
          if (c == '\n')
              ++nl;
      printf("%d\n", nl);
  }
#+END_SRC

** word counting

- =$ gcc wordcount.c=
- =./a.out=

#+BEGIN_SRC c :tangle wordcount.c
  #include <stdio.h>

  #define IN   1                  /* inside a word */
  #define OUT  0                  /* outside a word */

  /* count lines, words, and characters in input */

  main()
  {
      int c, nl, nw, nc, state;

      state = OUT;
      nl = nw = nc = 0;
      while ((c = getchar()) != EOF) {
          ++nc;
          if (c == '\n')
              ++nl;
          if (c == ' ' || c == '\n' || c == '\t')
              state = OUT;
          else if (state == OUT) {
              state = IN;
              ++nw;
          }
      }
      printf("%d %d %d\n", nl, nw, nc);
  }
#+END_SRC

