programming/c/code/c-lang.html

<div id="outline-container-org02b6531" class="outline-3">
<h3 id="org02b6531">fahrenheit-celsius table (in one go?)</h3>
<div class="outline-text-3" id="text-org02b6531">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;stdio.h&gt;</span>

<span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">print Fahrenheit-Celsius table </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #d55e00;">main</span>()
{
    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">fahr</span>;

    <span style="color: #56b4e9; font-weight: bold;">for</span> (fahr = 0; fahr &lt;= 300; fahr = fahr + 20)
        printf(<span style="color: #848ea9;">"%3d %6.1f\n"</span>, fahr, (5.0 / 9.0) * (fahr - 32));
}

</pre>
</div>
</div>
</div>

<div id="outline-container-orge2be71b" class="outline-3">
<h3 id="orge2be71b">fahrenheit-celsius constants</h3>
<div class="outline-text-3" id="text-orge2be71b">
<ul class="org-ul">
<li><code>$ gcc fc4.c</code></li>
<li><code>./a.out</code></li>
</ul>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;stdio.h&gt;</span>

<span style="color: #0072b2;">#define</span> <span style="color: #e69f00; font-weight: bold;">LOWER</span>  0                <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">lower limit of table </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #0072b2;">#define</span> <span style="color: #e69f00; font-weight: bold;">UPPER</span>  300              <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">upper limit </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #0072b2;">#define</span> <span style="color: #e69f00; font-weight: bold;">STEP</span>   20               <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">step size </span><span style="color: #009e73; font-style: italic;">*/</span>

<span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">print Fahrenheit-Celsius table </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #d55e00;">main</span>()
{
    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">fahr</span>;

    <span style="color: #56b4e9; font-weight: bold;">for</span> (fahr = LOWER; fahr &lt;= UPPER; fahr = fahr + STEP)
        printf(<span style="color: #848ea9;">"%3d %6.1f\n"</span>, fahr, (5.0 / 9.0) * (fahr - 32));
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org6516e5e" class="outline-3">
<h3 id="org6516e5e">file copy</h3>
<div class="outline-text-3" id="text-org6516e5e">
<ul class="org-ul">
<li><code>$ gcc filecopy1.c</code></li>
<li><code>./a.out</code></li>
<li>enter characters</li>
<li>C-d to terminate</li>
</ul>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;stdio.h&gt;</span>

<span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">copy input to output; 1st version </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #d55e00;">main</span>()
{
    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">c</span>;

    c = getchar();
    <span style="color: #56b4e9; font-weight: bold;">while</span> (c != EOF) {
        putchar(c);
        c = getchar();
    }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgda4f157" class="outline-3">
<h3 id="orgda4f157">file copy 2</h3>
<div class="outline-text-3" id="text-orgda4f157">
<ul class="org-ul">
<li><code>$ gcc filecopy2.c</code></li>
<li><code>./a.out</code></li>
</ul>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;stdio.h&gt;</span>

<span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">copy input to output; 2nd version </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #d55e00;">main</span>()
{
    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">c</span>;

    <span style="color: #56b4e9; font-weight: bold;">while</span> ((c = getchar()) != EOF)
        putchar(c);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org04ae726" class="outline-3">
<h3 id="org04ae726">count chars 1</h3>
<div class="outline-text-3" id="text-org04ae726">
<ul class="org-ul">
<li><code>$ gcc countchars1.c</code></li>
<li><code>./a.out</code></li>
<li>RET C-d to get number of characters. but get extra</li>
<li>includes newlines in count?</li>
</ul>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;stdio.h&gt;</span>

<span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">count characters in input; 1st version </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #d55e00;">main</span>()
{
    <span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #e69f00; font-weight: bold;">nc</span>;

    nc = 0;
    <span style="color: #56b4e9; font-weight: bold;">while</span> (getchar() != EOF)
        ++nc;
    printf(<span style="color: #848ea9;">"%ld\n"</span>, nc);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd53b011" class="outline-3">
<h3 id="orgd53b011">count chars 2</h3>
<div class="outline-text-3" id="text-orgd53b011">
<ul class="org-ul">
<li><code>$ gcc countchars2.c</code></li>
<li><code>./a.out</code></li>
</ul>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;stdio.h&gt;</span>

<span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">count characters in input; 2nd version </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #d55e00;">main</span>()
{
    <span style="color: #0072b2; font-weight: bold;">double</span> <span style="color: #e69f00; font-weight: bold;">nc</span>;

    <span style="color: #56b4e9; font-weight: bold;">for</span> (nc = 0; getchar() != EOF; ++nc);
    printf(<span style="color: #848ea9;">"%.0f\n"</span>, nc);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org7b0b69c" class="outline-3">
<h3 id="org7b0b69c">count lines</h3>
<div class="outline-text-3" id="text-org7b0b69c">
<ul class="org-ul">
<li><code>$ gcc countlines.c</code></li>
<li><code>./a.out</code></li>
<li>C-d to get result</li>
</ul>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;stdio.h&gt;</span>

<span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">count lines in input </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #d55e00;">main</span>()
{
    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">c</span>, <span style="color: #e69f00; font-weight: bold;">nl</span>;

    nl = 0;
    <span style="color: #56b4e9; font-weight: bold;">while</span> ((c = getchar()) != EOF)
        <span style="color: #56b4e9; font-weight: bold;">if</span> (c == <span style="color: #848ea9;">'\n'</span>)
            ++nl;
    printf(<span style="color: #848ea9;">"%d\n"</span>, nl);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org97e06d4" class="outline-3">
<h3 id="org97e06d4">word counting</h3>
<div class="outline-text-3" id="text-org97e06d4">
<ul class="org-ul">
<li><code>$ gcc wordcount.c</code></li>
<li><code>./a.out</code></li>
</ul>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;stdio.h&gt;</span>

<span style="color: #0072b2;">#define</span> <span style="color: #e69f00; font-weight: bold;">IN</span>   1                  <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">inside a word </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #0072b2;">#define</span> <span style="color: #e69f00; font-weight: bold;">OUT</span>  0                  <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">outside a word </span><span style="color: #009e73; font-style: italic;">*/</span>

<span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">count lines, words, and characters in input </span><span style="color: #009e73; font-style: italic;">*/</span>

<span style="color: #d55e00;">main</span>()
{
    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">c</span>, <span style="color: #e69f00; font-weight: bold;">nl</span>, <span style="color: #e69f00; font-weight: bold;">nw</span>, <span style="color: #e69f00; font-weight: bold;">nc</span>, <span style="color: #e69f00; font-weight: bold;">state</span>;

    state = OUT;
    nl = nw = nc = 0;
    <span style="color: #56b4e9; font-weight: bold;">while</span> ((c = getchar()) != EOF) {
        ++nc;
        <span style="color: #56b4e9; font-weight: bold;">if</span> (c == <span style="color: #848ea9;">'\n'</span>)
            ++nl;
        <span style="color: #56b4e9; font-weight: bold;">if</span> (c == <span style="color: #848ea9;">' '</span> || c == <span style="color: #848ea9;">'\n'</span> || c == <span style="color: #848ea9;">'\t'</span>)
            state = OUT;
        <span style="color: #56b4e9; font-weight: bold;">else</span> <span style="color: #56b4e9; font-weight: bold;">if</span> (state == OUT) {
            state = IN;
            ++nw;
        }
    }
    printf(<span style="color: #848ea9;">"%d %d %d\n"</span>, nl, nw, nc);
}
</pre>
</div>
</div>
</div>
