programming/c/code/c-lang.org
** arrays

- =$ gcc arrays.c=
- =./a.out=

#+BEGIN_SRC c :tangle arrays.c
  #include <stdio.h>

  /* count digits, white space, others */
  main()
  {
      int c, i, nwhite, nother;
      int ndigit[10];

      nwhite = nother = 0;
      for (i = 0; i < 10; ++i)
          ndigit[i] = 0;

      while ((c = getchar()) != EOF)
          if (c >= '0' && c <= '9')
              ++ndigit[c - '0'];
          else if (c == ' ' || c == '\n' || c == '\t')
              ++nwhite;
          else
              ++nother;

      printf("digits =");
      for (i = 0; i < 10; ++i)
          printf(" %d", ndigit[i]);
      printf(", white space = %d, other = %d\n", nwhite, nother);
  }
#+END_SRC

#+BEGIN_EXAMPLE
  $ ./a.out
  1       2       12 3
  digits = 0 2 2 1 0 0 0 0 0 0, white space = 4, other = 0
#+END_EXAMPLE

** functions

- =$ gcc functions.c=
- =./a.out=

#+BEGIN_SRC c :tangle functions.c
  #include <stdio.h>

  int power(int m, int n);

  /* test power function */
  main()
  {
      int i;

      for (i = 0; i < 10; ++i)
          printf("%d %d %d\n", i, power(2, i), power(-3, i));
      return 0;
  }

  /* power: raise base to n-th power; n >= 0 */
  int power(int base, int n)
  {
      int i, p;

      p = 1;
      for (i = 1; i <= n; ++i)
          p = p * base;
      return p;
  }
#+END_SRC

#+BEGIN_EXAMPLE
  $ ./a.out
  0 1 1
  1 2 -3
  2 4 9
  3 8 -27
  4 16 81
  5 32 -243
  6 64 729
  7 128 -2187
  8 256 6561
  9 512 -19683
#+END_EXAMPLE

** character arrays

- =$ gcc characterarrays.c=
- =./a.out=
- ; need to change the name of the getline function. conflict
- this just prints the longest line entered
- changed the variables in the function prototype but this wasn't necessary

#+BEGIN_SRC c :tangle characterarrays.c

  #include <stdio.h>
  #define MAXLINE 1000            /* maximum input line length */

  int xgetline(char s1[], int lim1);
  void copy(char to[], char from[]);

  /* print the longest input line */
  main()
  {
      int len;                    /* current line length */
      int max;                    /* maximum length seen so far */
      char line[MAXLINE];         /* current input line */
      char longest[MAXLINE];      /* longest line saved here */

      max = 0;
      while ((len = xgetline(line, MAXLINE)) > 0)
          if (len > max) {
              max = len;
              copy(longest, line);
          }
      if (max > 0)                /* there was a line */
          printf("%s", longest);
      return 0;
  }

  /* getline: read a line into s, return length */
  int xgetline(char s[], int lim)
  {
      int c, i;

      for (i = 0; i < lim - 1 && (c = getchar()) != EOF && c != '\n'; ++i)
          s[i] = c;
      if (c == '\n') {
          s[i] = c;
          ++i;
      }
      s[i] = '\0';
      return i;
  }

  /* copy: copy 'from' into 'to'; assume to is big enough */
  void copy(char to[], char from[])
  {
      int i;

      i = 0;
      while ((to[i] = from[i]) != '\0')
          ++i;
  }
#+END_SRC

