programming/c/code/c-lang.html

<div id="outline-container-orgef4974c" class="outline-3">
<h3 id="orgef4974c">arrays</h3>
<div class="outline-text-3" id="text-orgef4974c">
<ul class="org-ul">
<li><code>$ gcc arrays.c</code></li>
<li><code>./a.out</code></li>
</ul>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;stdio.h&gt;</span>

<span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">count digits, white space, others </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #d55e00;">main</span>()
{
    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">c</span>, <span style="color: #e69f00; font-weight: bold;">i</span>, <span style="color: #e69f00; font-weight: bold;">nwhite</span>, <span style="color: #e69f00; font-weight: bold;">nother</span>;
    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">ndigit</span>[10];

    nwhite = nother = 0;
    <span style="color: #56b4e9; font-weight: bold;">for</span> (i = 0; i &lt; 10; ++i)
        ndigit[i] = 0;

    <span style="color: #56b4e9; font-weight: bold;">while</span> ((c = getchar()) != EOF)
        <span style="color: #56b4e9; font-weight: bold;">if</span> (c &gt;= <span style="color: #848ea9;">'0'</span> &amp;&amp; c &lt;= <span style="color: #848ea9;">'9'</span>)
            ++ndigit[c - <span style="color: #848ea9;">'0'</span>];
        <span style="color: #56b4e9; font-weight: bold;">else</span> <span style="color: #56b4e9; font-weight: bold;">if</span> (c == <span style="color: #848ea9;">' '</span> || c == <span style="color: #848ea9;">'\n'</span> || c == <span style="color: #848ea9;">'\t'</span>)
            ++nwhite;
        <span style="color: #56b4e9; font-weight: bold;">else</span>
            ++nother;

    printf(<span style="color: #848ea9;">"digits ="</span>);
    <span style="color: #56b4e9; font-weight: bold;">for</span> (i = 0; i &lt; 10; ++i)
        printf(<span style="color: #848ea9;">" %d"</span>, ndigit[i]);
    printf(<span style="color: #848ea9;">", white space = %d, other = %d\n"</span>, nwhite, nother);
}
</pre>
</div>

<pre class="example">
$ ./a.out
1       2       12 3
digits = 0 2 2 1 0 0 0 0 0 0, white space = 4, other = 0
</pre>
</div>
</div>

<div id="outline-container-org0ea7d01" class="outline-3">
<h3 id="org0ea7d01">functions</h3>
<div class="outline-text-3" id="text-org0ea7d01">
<ul class="org-ul">
<li><code>$ gcc functions.c</code></li>
<li><code>./a.out</code></li>
</ul>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;stdio.h&gt;</span>

<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #d55e00;">power</span>(<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">m</span>, <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">n</span>);

<span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">test power function </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #d55e00;">main</span>()
{
    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">i</span>;

    <span style="color: #56b4e9; font-weight: bold;">for</span> (i = 0; i &lt; 10; ++i)
        printf(<span style="color: #848ea9;">"%d %d %d\n"</span>, i, power(2, i), power(-3, i));
    <span style="color: #56b4e9; font-weight: bold;">return</span> 0;
}

<span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">power: raise base to n-th power; n &gt;= 0 </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #d55e00;">power</span>(<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">base</span>, <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">n</span>)
{
    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">i</span>, <span style="color: #e69f00; font-weight: bold;">p</span>;

    p = 1;
    <span style="color: #56b4e9; font-weight: bold;">for</span> (i = 1; i &lt;= n; ++i)
        p = p * base;
    <span style="color: #56b4e9; font-weight: bold;">return</span> p;
}
</pre>
</div>

<pre class="example">
$ ./a.out
0 1 1
1 2 -3
2 4 9
3 8 -27
4 16 81
5 32 -243
6 64 729
7 128 -2187
8 256 6561
9 512 -19683
</pre>
</div>
</div>

<div id="outline-container-orgb7e5d16" class="outline-3">
<h3 id="orgb7e5d16">character arrays</h3>
<div class="outline-text-3" id="text-orgb7e5d16">
<ul class="org-ul">
<li><code>$ gcc characterarrays.c</code></li>
<li><code>./a.out</code></li>
<li>; need to change the name of the getline function. conflict</li>
<li>this just prints the longest line entered</li>
<li>changed the variables in the function prototype but this wasn't necessary</li>
</ul>

<div class="org-src-container">
<pre class="src src-c">
<span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;stdio.h&gt;</span>
<span style="color: #0072b2;">#define</span> <span style="color: #e69f00; font-weight: bold;">MAXLINE</span> 1000            <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">maximum input line length </span><span style="color: #009e73; font-style: italic;">*/</span>

<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #d55e00;">xgetline</span>(<span style="color: #0072b2; font-weight: bold;">char</span> <span style="color: #e69f00; font-weight: bold;">s1</span>[], <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">lim1</span>);
<span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">copy</span>(<span style="color: #0072b2; font-weight: bold;">char</span> <span style="color: #e69f00; font-weight: bold;">to</span>[], <span style="color: #0072b2; font-weight: bold;">char</span> <span style="color: #e69f00; font-weight: bold;">from</span>[]);

<span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">print the longest input line </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #d55e00;">main</span>()
{
    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">len</span>;                    <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">current line length </span><span style="color: #009e73; font-style: italic;">*/</span>
    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">max</span>;                    <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">maximum length seen so far </span><span style="color: #009e73; font-style: italic;">*/</span>
    <span style="color: #0072b2; font-weight: bold;">char</span> <span style="color: #e69f00; font-weight: bold;">line</span>[MAXLINE];         <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">current input line </span><span style="color: #009e73; font-style: italic;">*/</span>
    <span style="color: #0072b2; font-weight: bold;">char</span> <span style="color: #e69f00; font-weight: bold;">longest</span>[MAXLINE];      <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">longest line saved here </span><span style="color: #009e73; font-style: italic;">*/</span>

    max = 0;
    <span style="color: #56b4e9; font-weight: bold;">while</span> ((len = xgetline(line, MAXLINE)) &gt; 0)
        <span style="color: #56b4e9; font-weight: bold;">if</span> (len &gt; max) {
            max = len;
            copy(longest, line);
        }
    <span style="color: #56b4e9; font-weight: bold;">if</span> (max &gt; 0)                <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">there was a line </span><span style="color: #009e73; font-style: italic;">*/</span>
        printf(<span style="color: #848ea9;">"%s"</span>, longest);
    <span style="color: #56b4e9; font-weight: bold;">return</span> 0;
}

<span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">getline: read a line into s, return length </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #d55e00;">xgetline</span>(<span style="color: #0072b2; font-weight: bold;">char</span> <span style="color: #e69f00; font-weight: bold;">s</span>[], <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">lim</span>)
{
    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">c</span>, <span style="color: #e69f00; font-weight: bold;">i</span>;

    <span style="color: #56b4e9; font-weight: bold;">for</span> (i = 0; i &lt; lim - 1 &amp;&amp; (c = getchar()) != EOF &amp;&amp; c != <span style="color: #848ea9;">'\n'</span>; ++i)
        s[i] = c;
    <span style="color: #56b4e9; font-weight: bold;">if</span> (c == <span style="color: #848ea9;">'\n'</span>) {
        s[i] = c;
        ++i;
    }
    s[i] = <span style="color: #848ea9;">'\0'</span>;
    <span style="color: #56b4e9; font-weight: bold;">return</span> i;
}

<span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">copy: copy 'from' into 'to'; assume to is big enough </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">copy</span>(<span style="color: #0072b2; font-weight: bold;">char</span> <span style="color: #e69f00; font-weight: bold;">to</span>[], <span style="color: #0072b2; font-weight: bold;">char</span> <span style="color: #e69f00; font-weight: bold;">from</span>[])
{
    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">i</span>;

    i = 0;
    <span style="color: #56b4e9; font-weight: bold;">while</span> ((to[i] = from[i]) != <span style="color: #848ea9;">'\0'</span>)
        ++i;
}
</pre>
</div>
</div>
</div>
