programming/c/code/c-lang.org
** external variables and scope

- $ gcc scope.c
- ./a.out
- had to rename the getline() function
- change getchar to getchar()

#+BEGIN_SRC c :tangle scope.c
  #include <stdio.h>

  #define MAXLINE 1000            /* maximum input line size */

  int max;                        /* maximum length seen so far */
  char line[MAXLINE];             /* current input line */
  char longest[MAXLINE];          /* longest line saved here */

  int xgetline(void);
  void copy(void);

  /* print longest input line; specialized version */
  main()
  {
      int len;
      extern int max;
      extern char longest[];

      max = 0;
      while ((len = xgetline()) > 0)
          if (len > max) {
              max = len;
              copy();
          }
      if (max > 0)                /* there was a line */
          printf("%s", longest);
      return 0;
  }

  /* getline: specialized version */
  int xgetline(void)
  {
      int c, i;
      extern char line[];

      for (i = 0; i < MAXLINE - 1 && (c = getchar()) != EOF && c != '\n'; ++i)
          line[i] = c;
      if (c == '\n') {
          line[i] = c;
          ++i;
      }
      line[i] = '\0';
      return i;
  }

  /* copy: specialized version */
  void copy(void)
  {
      int i;
      extern char line[], longest[];

      i = 0;
      while ((longest[i] = line[i]) != '\0')
          ++i;
  }
#+END_SRC

* Chapter 2 - Types, Operators and Expressions

** function: strlen

- change strlen to xstrlen. conflict
- gcc strlen.c
- custom main

#+BEGIN_SRC c :tangle strlen.c
  #include <stdio.h>

  /* strlen: return length of s */
  int xstrlen(char s[])
  {
      int i;
      while (s[i] != '\0')
          ++i;
      return i;
  }

  main()
  {
      int xx = xstrlen("house");

      printf("%d\n", xx);

  }
#+END_SRC

** function: atoi

- ascii to integer
- not sure what is happening

#+BEGIN_SRC c :tangle atoi.c
  #include <stdio.h>

  /* atoi: convert s to integer */
  int atoi(char s[])
  {
      int i, n;

      n = 0;
      for (i = 0; s[i] >= '0' && s[i] <= '9'; ++i)
          n = 10 * n + (s[i] - '0');
      return n;
  }

  int main()
  {
      int xx;

      xx = atoi("88");
      printf("%d\n", xx);

  }
#+END_SRC

** function: lower

#+BEGIN_SRC c :tangle lower.c
  #include <stdio.h>

  /* lower: convert c to lower case; ASCII only */
  int lower(int c)
  {
      if (c >= 'A' && c <= 'Z')
          return c + 'a' - 'A';
      else
          return c;
  }

  int main()
  {
      char yy = 'Z';
      int xx;

      xx = lower(yy);
      printf("%d", xx);
  }
#+END_SRC

