programming/c/code/c-lang.html

<div id="outline-container-org5ccdadb" class="outline-3">
<h3 id="org5ccdadb">external variables and scope</h3>
<div class="outline-text-3" id="text-org5ccdadb">
<ul class="org-ul">
<li>$ gcc scope.c</li>
<li>./a.out</li>
<li>had to rename the getline() function</li>
<li>change getchar to getchar()</li>
</ul>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;stdio.h&gt;</span>

<span style="color: #0072b2;">#define</span> <span style="color: #e69f00; font-weight: bold;">MAXLINE</span> 1000            <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">maximum input line size </span><span style="color: #009e73; font-style: italic;">*/</span>

<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">max</span>;                        <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">maximum length seen so far </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #0072b2; font-weight: bold;">char</span> <span style="color: #e69f00; font-weight: bold;">line</span>[MAXLINE];             <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">current input line </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #0072b2; font-weight: bold;">char</span> <span style="color: #e69f00; font-weight: bold;">longest</span>[MAXLINE];          <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">longest line saved here </span><span style="color: #009e73; font-style: italic;">*/</span>

<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #d55e00;">xgetline</span>(<span style="color: #0072b2; font-weight: bold;">void</span>);
<span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">copy</span>(<span style="color: #0072b2; font-weight: bold;">void</span>);

<span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">print longest input line; specialized version </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #d55e00;">main</span>()
{
    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">len</span>;
    <span style="color: #56b4e9; font-weight: bold;">extern</span> <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">max</span>;
    <span style="color: #56b4e9; font-weight: bold;">extern</span> <span style="color: #0072b2; font-weight: bold;">char</span> <span style="color: #e69f00; font-weight: bold;">longest</span>[];

    max = 0;
    <span style="color: #56b4e9; font-weight: bold;">while</span> ((len = xgetline()) &gt; 0)
        <span style="color: #56b4e9; font-weight: bold;">if</span> (len &gt; max) {
            max = len;
            copy();
        }
    <span style="color: #56b4e9; font-weight: bold;">if</span> (max &gt; 0)                <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">there was a line </span><span style="color: #009e73; font-style: italic;">*/</span>
        printf(<span style="color: #848ea9;">"%s"</span>, longest);
    <span style="color: #56b4e9; font-weight: bold;">return</span> 0;
}

<span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">getline: specialized version </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #d55e00;">xgetline</span>(<span style="color: #0072b2; font-weight: bold;">void</span>)
{
    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">c</span>, <span style="color: #e69f00; font-weight: bold;">i</span>;
    <span style="color: #56b4e9; font-weight: bold;">extern</span> <span style="color: #0072b2; font-weight: bold;">char</span> <span style="color: #e69f00; font-weight: bold;">line</span>[];

    <span style="color: #56b4e9; font-weight: bold;">for</span> (i = 0; i &lt; MAXLINE - 1 &amp;&amp; (c = getchar()) != EOF &amp;&amp; c != <span style="color: #848ea9;">'\n'</span>; ++i)
        line[i] = c;
    <span style="color: #56b4e9; font-weight: bold;">if</span> (c == <span style="color: #848ea9;">'\n'</span>) {
        line[i] = c;
        ++i;
    }
    line[i] = <span style="color: #848ea9;">'\0'</span>;
    <span style="color: #56b4e9; font-weight: bold;">return</span> i;
}

<span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">copy: specialized version </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">copy</span>(<span style="color: #0072b2; font-weight: bold;">void</span>)
{
    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">i</span>;
    <span style="color: #56b4e9; font-weight: bold;">extern</span> <span style="color: #0072b2; font-weight: bold;">char</span> <span style="color: #e69f00; font-weight: bold;">line</span>[], <span style="color: #e69f00; font-weight: bold;">longest</span>[];

    i = 0;
    <span style="color: #56b4e9; font-weight: bold;">while</span> ((longest[i] = line[i]) != <span style="color: #848ea9;">'\0'</span>)
        ++i;
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org16332b1" class="outline-2">
<h2 id="org16332b1">Chapter 2 - Types, Operators and Expressions</h2>
<div class="outline-text-2" id="text-org16332b1">
</div>
<div id="outline-container-org51e4964" class="outline-3">
<h3 id="org51e4964">function: strlen</h3>
<div class="outline-text-3" id="text-org51e4964">
<ul class="org-ul">
<li>change strlen to xstrlen. conflict</li>
<li>gcc strlen.c</li>
<li>custom main</li>
</ul>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;stdio.h&gt;</span>

<span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">strlen: return length of s </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #d55e00;">xstrlen</span>(<span style="color: #0072b2; font-weight: bold;">char</span> <span style="color: #e69f00; font-weight: bold;">s</span>[])
{
    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">i</span>;
    <span style="color: #56b4e9; font-weight: bold;">while</span> (s[i] != <span style="color: #848ea9;">'\0'</span>)
        ++i;
    <span style="color: #56b4e9; font-weight: bold;">return</span> i;
}

<span style="color: #d55e00;">main</span>()
{
    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">xx</span> = xstrlen(<span style="color: #848ea9;">"house"</span>);

    printf(<span style="color: #848ea9;">"%d\n"</span>, xx);

}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc3646c5" class="outline-3">
<h3 id="orgc3646c5">function: atoi</h3>
<div class="outline-text-3" id="text-orgc3646c5">
<ul class="org-ul">
<li>ascii to integer</li>
<li>not sure what is happening</li>
</ul>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;stdio.h&gt;</span>

<span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">atoi: convert s to integer </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #d55e00;">atoi</span>(<span style="color: #0072b2; font-weight: bold;">char</span> <span style="color: #e69f00; font-weight: bold;">s</span>[])
{
    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">i</span>, <span style="color: #e69f00; font-weight: bold;">n</span>;

    n = 0;
    <span style="color: #56b4e9; font-weight: bold;">for</span> (i = 0; s[i] &gt;= <span style="color: #848ea9;">'0'</span> &amp;&amp; s[i] &lt;= <span style="color: #848ea9;">'9'</span>; ++i)
        n = 10 * n + (s[i] - <span style="color: #848ea9;">'0'</span>);
    <span style="color: #56b4e9; font-weight: bold;">return</span> n;
}

<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #d55e00;">main</span>()
{
    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">xx</span>;

    xx = atoi(<span style="color: #848ea9;">"88"</span>);
    printf(<span style="color: #848ea9;">"%d\n"</span>, xx);

}
</pre>
</div>
</div>
</div>

<div id="outline-container-org9da433e" class="outline-3">
<h3 id="org9da433e">function: lower</h3>
<div class="outline-text-3" id="text-org9da433e">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;stdio.h&gt;</span>

<span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">lower: convert c to lower case; ASCII only </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #d55e00;">lower</span>(<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">c</span>)
{
    <span style="color: #56b4e9; font-weight: bold;">if</span> (c &gt;= <span style="color: #848ea9;">'A'</span> &amp;&amp; c &lt;= <span style="color: #848ea9;">'Z'</span>)
        <span style="color: #56b4e9; font-weight: bold;">return</span> c + <span style="color: #848ea9;">'a'</span> - <span style="color: #848ea9;">'A'</span>;
    <span style="color: #56b4e9; font-weight: bold;">else</span>
        <span style="color: #56b4e9; font-weight: bold;">return</span> c;
}

<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #d55e00;">main</span>()
{
    <span style="color: #0072b2; font-weight: bold;">char</span> <span style="color: #e69f00; font-weight: bold;">yy</span> = <span style="color: #848ea9;">'Z'</span>;
    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">xx</span>;

    xx = lower(yy);
    printf(<span style="color: #848ea9;">"%d"</span>, xx);
}
</pre>
</div>
</div>
</div>
