programming/c/code/c-lang.org
** function: rand

#+BEGIN_SRC c :tangle rand.c
  #include <stdio.h>

  unsigned long int next = 1;
  /* rand: return pseudo-random integer on 0..32767 */
  int rand(void)
  {
      next = next * 1103515245 + 12345;
      return (unsigned int) (next / 65536) % 32768;
  }

  /* srand: set seed for rand() */
  void srand(unsigned int seed)
  {
      next = seed;
  }

  int main()
  {
      int xx, i;

      for (i = 0; i < 10; i++) {
          srand(i);

          xx = rand();
          printf("%d\n", xx);
      }

  }
#+END_SRC

** function: squeeze

- ascii automatically converted to integers?
- this works but i don't understand how

#+BEGIN_SRC c :tangle squeeze.c

  /* squeeze: delete all c from s */
  void squeeze(char s[], int c)
  {
      int i, j;

      for (i = j = 0; s[i] != '\0'; i++)
          if (s[i] != c)
              s[j++] = s[i];
      s[j] = '\0';
  }

  int main()
  {
      char s[] = "house";
      int c = 'o';                // o is 111
      squeeze(s, c);
  }
#+END_SRC

** function: strcat

- this only copies the first character of c
- had to rename strcat to xstrcat

#+BEGIN_SRC c :tangle strcat.c
  /* strcat: concatenate t to end of s; s must be big enough */
  void xstrcat(char s[], char t[])
  {
      int i, j;

      i = j = 0;
      while (s[i] != '\0')        /* find end of s */
          i++;
      while ((s[i++] = t[j++]) != '\0')   /* copy t */
          ;
  }

  int main()
  {
      char n[] = "new";
      char c[] = "car";
      xstrcat(n, c);
  }
#+END_SRC

** function: getbits

- doesn't work like it should

#+BEGIN_SRC c :tangle getbits.c
  #include <stdio.h>

  /* getbits: get n bits from position p */
  unsigned getbits(unsigned x, int p, int n)
  {
      return (x >> (p + 1 - n)) & ~(~0 << n);
  }

  int main()
  {
      unsigned ff;
      unsigned x = 4;

      ff = getbits(x, 8, 4);
      printf("%d", ff);
  }
#+END_SRC

** function: bitcount

- haven't looked at this

#+BEGIN_SRC c :tangle bitcount.c
  /* bitcount: count 1 bits in x */
  int bitcount(unsigned x)
  {
      int b;

      for (b = 0; x != 0; x >>= 1)
          if (x & 01)
              b++;
      return b;
  }
#+END_SRC

* Chapter 3 - Control Flow

** function: binsearch

#+BEGIN_SRC c :tangle binsearch.c
  /* binsearch: find x in v[0] <= v[1] <= ... <= v[n-1] */
  int binsearch(int x, int v[], int n)
  {
      int low, high, mid;

      low = 0;
      high = n - 1;
      while (low <= high) {
          mid = (low + high) / 2;
          if (x < v[mid])
              high = mid + 1;
          else if (x > v[mid])
              low = mid + 1;
          else                    /* found match */
              return mid;
      }
      return -1;                  /* no match */
  }
#+END_SRC

