programming/c/code/c-lang.html

<div id="outline-container-org6efbe47" class="outline-3">
<h3 id="org6efbe47">function: rand</h3>
<div class="outline-text-3" id="text-org6efbe47">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;stdio.h&gt;</span>

<span style="color: #0072b2; font-weight: bold;">unsigned</span> <span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">next</span> = 1;
<span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">rand: return pseudo-random integer on 0..32767 </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #d55e00;">rand</span>(<span style="color: #0072b2; font-weight: bold;">void</span>)
{
    next = next * 1103515245 + 12345;
    <span style="color: #56b4e9; font-weight: bold;">return</span> (<span style="color: #0072b2; font-weight: bold;">unsigned</span> <span style="color: #0072b2; font-weight: bold;">int</span>) (next / 65536) % 32768;
}

<span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">srand: set seed for rand() </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">srand</span>(<span style="color: #0072b2; font-weight: bold;">unsigned</span> <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">seed</span>)
{
    next = seed;
}

<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #d55e00;">main</span>()
{
    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">xx</span>, <span style="color: #e69f00; font-weight: bold;">i</span>;

    <span style="color: #56b4e9; font-weight: bold;">for</span> (i = 0; i &lt; 10; i++) {
        srand(i);

        xx = rand();
        printf(<span style="color: #848ea9;">"%d\n"</span>, xx);
    }

}
</pre>
</div>
</div>
</div>

<div id="outline-container-org0bf3c74" class="outline-3">
<h3 id="org0bf3c74">function: squeeze</h3>
<div class="outline-text-3" id="text-org0bf3c74">
<ul class="org-ul">
<li>ascii automatically converted to integers?</li>
<li>this works but i don't understand how</li>
</ul>

<div class="org-src-container">
<pre class="src src-c">
<span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">squeeze: delete all c from s </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">squeeze</span>(<span style="color: #0072b2; font-weight: bold;">char</span> <span style="color: #e69f00; font-weight: bold;">s</span>[], <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">c</span>)
{
    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">i</span>, <span style="color: #e69f00; font-weight: bold;">j</span>;

    <span style="color: #56b4e9; font-weight: bold;">for</span> (i = j = 0; s[i] != <span style="color: #848ea9;">'\0'</span>; i++)
        <span style="color: #56b4e9; font-weight: bold;">if</span> (s[i] != c)
            s[j++] = s[i];
    s[j] = <span style="color: #848ea9;">'\0'</span>;
}

<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #d55e00;">main</span>()
{
    <span style="color: #0072b2; font-weight: bold;">char</span> <span style="color: #e69f00; font-weight: bold;">s</span>[] = <span style="color: #848ea9;">"house"</span>;
    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">c</span> = <span style="color: #848ea9;">'o'</span>;                <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">o is 111</span>
    squeeze(s, c);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org621dfd5" class="outline-3">
<h3 id="org621dfd5">function: strcat</h3>
<div class="outline-text-3" id="text-org621dfd5">
<ul class="org-ul">
<li>this only copies the first character of c</li>
<li>had to rename strcat to xstrcat</li>
</ul>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">strcat: concatenate t to end of s; s must be big enough </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">xstrcat</span>(<span style="color: #0072b2; font-weight: bold;">char</span> <span style="color: #e69f00; font-weight: bold;">s</span>[], <span style="color: #0072b2; font-weight: bold;">char</span> <span style="color: #e69f00; font-weight: bold;">t</span>[])
{
    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">i</span>, <span style="color: #e69f00; font-weight: bold;">j</span>;

    i = j = 0;
    <span style="color: #56b4e9; font-weight: bold;">while</span> (s[i] != <span style="color: #848ea9;">'\0'</span>)        <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">find end of s </span><span style="color: #009e73; font-style: italic;">*/</span>
        i++;
    <span style="color: #56b4e9; font-weight: bold;">while</span> ((s[i++] = t[j++]) != <span style="color: #848ea9;">'\0'</span>)   <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">copy t </span><span style="color: #009e73; font-style: italic;">*/</span>
        ;
}

<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #d55e00;">main</span>()
{
    <span style="color: #0072b2; font-weight: bold;">char</span> <span style="color: #e69f00; font-weight: bold;">n</span>[] = <span style="color: #848ea9;">"new"</span>;
    <span style="color: #0072b2; font-weight: bold;">char</span> <span style="color: #e69f00; font-weight: bold;">c</span>[] = <span style="color: #848ea9;">"car"</span>;
    xstrcat(n, c);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org6c0a960" class="outline-3">
<h3 id="org6c0a960">function: getbits</h3>
<div class="outline-text-3" id="text-org6c0a960">
<ul class="org-ul">
<li>doesn't work like it should</li>
</ul>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;stdio.h&gt;</span>

<span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">getbits: get n bits from position p </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #0072b2; font-weight: bold;">unsigned</span> <span style="color: #d55e00;">getbits</span>(<span style="color: #0072b2; font-weight: bold;">unsigned</span> <span style="color: #e69f00; font-weight: bold;">x</span>, <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">p</span>, <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">n</span>)
{
    <span style="color: #56b4e9; font-weight: bold;">return</span> (x &gt;&gt; (p + 1 - n)) &amp; ~(~0 &lt;&lt; n);
}

<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #d55e00;">main</span>()
{
    <span style="color: #0072b2; font-weight: bold;">unsigned</span> <span style="color: #e69f00; font-weight: bold;">ff</span>;
    <span style="color: #0072b2; font-weight: bold;">unsigned</span> <span style="color: #e69f00; font-weight: bold;">x</span> = 4;

    ff = getbits(x, 8, 4);
    printf(<span style="color: #848ea9;">"%d"</span>, ff);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org86ce606" class="outline-3">
<h3 id="org86ce606">function: bitcount</h3>
<div class="outline-text-3" id="text-org86ce606">
<ul class="org-ul">
<li>haven't looked at this</li>
</ul>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">bitcount: count 1 bits in x </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #d55e00;">bitcount</span>(<span style="color: #0072b2; font-weight: bold;">unsigned</span> <span style="color: #e69f00; font-weight: bold;">x</span>)
{
    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">b</span>;

    <span style="color: #56b4e9; font-weight: bold;">for</span> (b = 0; x != 0; x &gt;&gt;= 1)
        <span style="color: #56b4e9; font-weight: bold;">if</span> (x &amp; 01)
            b++;
    <span style="color: #56b4e9; font-weight: bold;">return</span> b;
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org08c225a" class="outline-2">
<h2 id="org08c225a">Chapter 3 - Control Flow</h2>
<div class="outline-text-2" id="text-org08c225a">
</div>
<div id="outline-container-orgc4de3bd" class="outline-3">
<h3 id="orgc4de3bd">function: binsearch</h3>
<div class="outline-text-3" id="text-orgc4de3bd">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">binsearch: find x in v[0] &lt;= v[1] &lt;= ... &lt;= v[n-1] </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #d55e00;">binsearch</span>(<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">x</span>, <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">v</span>[], <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">n</span>)
{
    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">low</span>, <span style="color: #e69f00; font-weight: bold;">high</span>, <span style="color: #e69f00; font-weight: bold;">mid</span>;

    low = 0;
    high = n - 1;
    <span style="color: #56b4e9; font-weight: bold;">while</span> (low &lt;= high) {
        mid = (low + high) / 2;
        <span style="color: #56b4e9; font-weight: bold;">if</span> (x &lt; v[mid])
            high = mid + 1;
        <span style="color: #56b4e9; font-weight: bold;">else</span> <span style="color: #56b4e9; font-weight: bold;">if</span> (x &gt; v[mid])
            low = mid + 1;
        <span style="color: #56b4e9; font-weight: bold;">else</span>                    <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">found match </span><span style="color: #009e73; font-style: italic;">*/</span>
            <span style="color: #56b4e9; font-weight: bold;">return</span> mid;
    }
    <span style="color: #56b4e9; font-weight: bold;">return</span> -1;                  <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">no match </span><span style="color: #009e73; font-style: italic;">*/</span>
}
</pre>
</div>
</div>
</div>
