programming/c/code/c-lang.html

<div id="outline-container-org088a1fa" class="outline-3">
<h3 id="org088a1fa">program: count digits, white space, others (switch)</h3>
<div class="outline-text-3" id="text-org088a1fa">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;stdio.h&gt;</span>

<span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">count digits, white space, others </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #d55e00;">main</span>()
{
    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">c</span>, <span style="color: #e69f00; font-weight: bold;">i</span>, <span style="color: #e69f00; font-weight: bold;">nwhite</span>, <span style="color: #e69f00; font-weight: bold;">nother</span>, <span style="color: #e69f00; font-weight: bold;">ndigit</span>[10];

    nwhite = nother = 0;
    <span style="color: #56b4e9; font-weight: bold;">for</span> (i = 0; i &lt; 10; i++)
        ndigit[i] = 0;
    <span style="color: #56b4e9; font-weight: bold;">while</span> ((c = getchar()) != EOF) {
        <span style="color: #56b4e9; font-weight: bold;">switch</span> (c) {
        <span style="color: #56b4e9; font-weight: bold;">case</span> <span style="color: #848ea9;">'0'</span>:
        <span style="color: #56b4e9; font-weight: bold;">case</span> <span style="color: #848ea9;">'1'</span>:
        <span style="color: #56b4e9; font-weight: bold;">case</span> <span style="color: #848ea9;">'2'</span>:
        <span style="color: #56b4e9; font-weight: bold;">case</span> <span style="color: #848ea9;">'3'</span>:
        <span style="color: #56b4e9; font-weight: bold;">case</span> <span style="color: #848ea9;">'4'</span>:
        <span style="color: #56b4e9; font-weight: bold;">case</span> <span style="color: #848ea9;">'5'</span>:
        <span style="color: #56b4e9; font-weight: bold;">case</span> <span style="color: #848ea9;">'6'</span>:
        <span style="color: #56b4e9; font-weight: bold;">case</span> <span style="color: #848ea9;">'7'</span>:
        <span style="color: #56b4e9; font-weight: bold;">case</span> <span style="color: #848ea9;">'8'</span>:
        <span style="color: #56b4e9; font-weight: bold;">case</span> <span style="color: #848ea9;">'9'</span>:
            ndigit[c - <span style="color: #848ea9;">'0'</span>]++;
            <span style="color: #56b4e9; font-weight: bold;">break</span>;
        <span style="color: #56b4e9; font-weight: bold;">case</span> <span style="color: #848ea9;">' '</span>:
        <span style="color: #56b4e9; font-weight: bold;">case</span> <span style="color: #848ea9;">'\n'</span>:
        <span style="color: #56b4e9; font-weight: bold;">case</span> <span style="color: #848ea9;">'\t'</span>:
            nwhite++;
            <span style="color: #56b4e9; font-weight: bold;">break</span>;
        <span style="color: #56b4e9; font-weight: bold;">default</span>:
            nother++;
            <span style="color: #56b4e9; font-weight: bold;">break</span>;
        }
    }
    printf(<span style="color: #848ea9;">"digits ="</span>);
    <span style="color: #56b4e9; font-weight: bold;">for</span> (i = 0; i &lt; 10; i++)
        printf(<span style="color: #848ea9;">" %d"</span>, ndigit[i]);
    printf(<span style="color: #848ea9;">", white space = %d, other = %d\n"</span>, nwhite, nother);
    <span style="color: #56b4e9; font-weight: bold;">return</span> 0;
}
</pre>
</div>

<pre class="example">
$ ./a.out
123 45
digits = 0 1 1 1 1 1 0 0 0 0, white space = 2, other = 0
</pre>
</div>
</div>

<div id="outline-container-org01ec0fa" class="outline-3">
<h3 id="org01ec0fa">function: atoi</h3>
<div class="outline-text-3" id="text-org01ec0fa">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;ctype.h&gt;</span>

<span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">atoi: convert s to integer; version 2 </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #d55e00;">atoi</span>(<span style="color: #0072b2; font-weight: bold;">char</span> <span style="color: #e69f00; font-weight: bold;">s</span>[])
{
    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">i</span>, <span style="color: #e69f00; font-weight: bold;">n</span>, <span style="color: #e69f00; font-weight: bold;">sign</span>;

    <span style="color: #56b4e9; font-weight: bold;">for</span> (i = 0; isspace(s[i]); i++);    <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">skip white space </span><span style="color: #009e73; font-style: italic;">*/</span>
    sign = (s[i] == <span style="color: #848ea9;">'-'</span>) ? -1 : 1;
    <span style="color: #56b4e9; font-weight: bold;">if</span> (s[i] == <span style="color: #848ea9;">'+'</span> || s[i] == <span style="color: #848ea9;">'-'</span>)     <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">skip sign </span><span style="color: #009e73; font-style: italic;">*/</span>
        i++;
    <span style="color: #56b4e9; font-weight: bold;">for</span> (n = 0; isdigit(s[i]); i++)
        n = 10 * n + (s[i] - <span style="color: #848ea9;">'0'</span>);
    <span style="color: #56b4e9; font-weight: bold;">return</span> sign * n;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org9b5d66c" class="outline-3">
<h3 id="org9b5d66c">function: shellsort</h3>
<div class="outline-text-3" id="text-org9b5d66c">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">shellsort: sort v[0]...v[n-1] into increasing order </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">shellsort</span>(<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">v</span>[], <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">n</span>)
{
    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">gap</span>, <span style="color: #e69f00; font-weight: bold;">i</span>, <span style="color: #e69f00; font-weight: bold;">j</span>, <span style="color: #e69f00; font-weight: bold;">temp</span>;
    <span style="color: #56b4e9; font-weight: bold;">for</span> (gap = n / 2; gap &gt; 0; gap /= 2)
        <span style="color: #56b4e9; font-weight: bold;">for</span> (i = gap; i &lt; n; i++)
            <span style="color: #56b4e9; font-weight: bold;">for</span> (j = i - gap; j &gt;= 0 &amp;&amp; v[j] &gt; v[j + gap]; j -= gap) {
                temp = v[j];
                v[j] = v[j + gap];
                v[j + gap] = temp;
            }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org1c6a491" class="outline-3">
<h3 id="org1c6a491">function: reverse</h3>
<div class="outline-text-3" id="text-org1c6a491">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;string.h&gt;</span>

<span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">reverse: reverse string s in place </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">reverse</span>(<span style="color: #0072b2; font-weight: bold;">char</span> <span style="color: #e69f00; font-weight: bold;">s</span>[])
{
    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">c</span>, <span style="color: #e69f00; font-weight: bold;">i</span>, <span style="color: #e69f00; font-weight: bold;">j</span>;

    <span style="color: #56b4e9; font-weight: bold;">for</span> (i = 0, j = strlen(s) - 1; i &lt; j; i++, j--) {
        c = s[i];
        s[i] = s[j];
        s[j] = c;
    }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgffef630" class="outline-3">
<h3 id="orgffef630">function: itoa</h3>
<div class="outline-text-3" id="text-orgffef630">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">itoa: convert n to characters in s </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">itoa</span>(<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">n</span>, <span style="color: #0072b2; font-weight: bold;">char</span> <span style="color: #e69f00; font-weight: bold;">s</span>[])
{
    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">i</span>, <span style="color: #e69f00; font-weight: bold;">sign</span>;

    <span style="color: #56b4e9; font-weight: bold;">if</span> ((sign = n) &lt; 0)         <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">record sign </span><span style="color: #009e73; font-style: italic;">*/</span>
        n = -n;                 <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">make n positive </span><span style="color: #009e73; font-style: italic;">*/</span>
    i = 0;
    <span style="color: #56b4e9; font-weight: bold;">do</span> {                        <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">generate digits in reverse order </span><span style="color: #009e73; font-style: italic;">*/</span>
        s[i++] = n % 10 + <span style="color: #848ea9;">'0'</span>;  <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">get next digit </span><span style="color: #009e73; font-style: italic;">*/</span>
    } <span style="color: #56b4e9; font-weight: bold;">while</span> ((n /= 10) &gt; 0);    <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">delete it </span><span style="color: #009e73; font-style: italic;">*/</span>
    <span style="color: #56b4e9; font-weight: bold;">if</span> (sign &lt; 0)
        s[i++] = <span style="color: #848ea9;">'-'</span>;
    s[i] = <span style="color: #848ea9;">'\0'</span>;
    reverse(s);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org2f59d66" class="outline-3">
<h3 id="org2f59d66">function: trim</h3>
<div class="outline-text-3" id="text-org2f59d66">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">trim: remove trailing blanks, tabs, newlines </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #d55e00;">trim</span>(<span style="color: #0072b2; font-weight: bold;">char</span> <span style="color: #e69f00; font-weight: bold;">s</span>[])
{
    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">n</span>;
    <span style="color: #56b4e9; font-weight: bold;">for</span> (n = strlen(s) - 1; n &gt;= 0; n--)
        <span style="color: #56b4e9; font-weight: bold;">if</span> (s[n] != <span style="color: #848ea9;">' '</span> &amp;&amp; s[n] != <span style="color: #848ea9;">'\t'</span> &amp;&amp; s[n] != <span style="color: #848ea9;">'\n'</span>)
            <span style="color: #56b4e9; font-weight: bold;">break</span>;
    s[n + 1] = <span style="color: #848ea9;">'\0'</span>;
    <span style="color: #56b4e9; font-weight: bold;">return</span> n;
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org736b273" class="outline-2">
<h2 id="org736b273">Chapter 4 - Functions and Program Structure</h2>
<div class="outline-text-2" id="text-org736b273">
</div>
