programming/c/code/c-lang.org
** program: find all lines matching pattern

#+BEGIN_EXAMPLE
  41 ; not sure what this does
#+END_EXAMPLE

#+BEGIN_SRC c :tangle 41.c
  #include <stdio.h>

  #define MAXLINE 1000            /* maximum input line length */

  int xgetline(char line[], int max);
  int strindex(char source[], char searchfor[]);

  char pattern[] = "ould";        /* pattern to search for */

  /* find all lines matching pattern */
  main()
  {
      char line[MAXLINE];
      int found = 0;

      while (xgetline(line, MAXLINE) > 0)
          if (strindex(line, pattern) >= 0) {
              printf("%s", line);
              found++;
          }
      return found;
  }

  /* getline: get line into s, return length */
  int xgetline(char s[], int lim)
  {
      int c, i;

      i = 0;
      while (--lim > 0 && (c = getchar()) != EOF && c != '\n')
          s[i++] = c;
      if (c == '\n')
          s[i++] = c;
      s[i] = '\0';
      return i;
  }

  /* strindex: return index of t in s, -1 if none */
  int strindex(char s[], char t[])
  {
      int i, j, k;

      for (i = 0; s[i] != '\0'; i++) {
          for (j = i, k = 0; t[k] != '\0' && s[j] == t[k]; j++, k++);
          if (k > 0 && t[k] == '\0')
              return i;
      }
      return -1;
  }
#+END_SRC

** function: atof

#+BEGIN_EXAMPLE
  ascii to float
#+END_EXAMPLE

#+BEGIN_SRC c :tangle atof.c
  #include <ctype.h>

  /* atof: convert string s to double */
  double atof(char s[])
  {
      double val, power;
      int i, sign;

      for (i = 0; isspace(s[i]); i++);    /* skip white space */
      sign = (s[i] == '-') ? -1 : 1;
      if (s[i] == '+' || s[i] == '-')
          i++;
      for (val = 0.0; isdigit(s[i]); i++)
          val = 10.0 * val + (s[i] - '0');
      if (s[i] == '.')
          i++;
      for (power = 1.0; isdigit(s[i]); i++) {
          val = 10.0 * val + (s[i] - '0');
          power *= 10;
      }
      return sign * val / power;
  }
#+END_SRC

** program: calculator

need to include and change getline

#+BEGIN_SRC c :tangle calculator.c
  #include <stdio.h>

  #define MAXLINE 100

  /* rudimentary calculator */
  main()
  {
      double sum, atof(char[]);
      char line[MAXLINE];
      int getline(char line[], int max);

      sum = 0;
      while (getline(line, MAXLINE) > 0)
          printf("\t%g\n", sum += atof(line));
      return 0;
  }
#+END_SRC

** function: atoi (rewrite)

#+BEGIN_EXAMPLE
  ascii to integer
#+END_EXAMPLE

Given atof, properly declared, we could write atoi (convert a string
to int) in terms of it:

#+BEGIN_SRC c :tangle atoir.c
  /* atoi: convert string s to integer using atof */
  int atoi(char s[])
  {
    double atof(char s[]);
    return (int) atof(s);
  }
#+END_SRC

