programming/c/code/c-lang.html
<div id="outline-container-orgd0ae48a" class="outline-3">
<h3 id="orgd0ae48a">program: find all lines matching pattern</h3>
<div class="outline-text-3" id="text-orgd0ae48a">
<pre class="example">
41 ; not sure what this does
</pre>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;stdio.h&gt;</span>

<span style="color: #0072b2;">#define</span> <span style="color: #e69f00; font-weight: bold;">MAXLINE</span> 1000            <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">maximum input line length </span><span style="color: #009e73; font-style: italic;">*/</span>

<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #d55e00;">xgetline</span>(<span style="color: #0072b2; font-weight: bold;">char</span> <span style="color: #e69f00; font-weight: bold;">line</span>[], <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">max</span>);
<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #d55e00;">strindex</span>(<span style="color: #0072b2; font-weight: bold;">char</span> <span style="color: #e69f00; font-weight: bold;">source</span>[], <span style="color: #0072b2; font-weight: bold;">char</span> <span style="color: #e69f00; font-weight: bold;">searchfor</span>[]);

<span style="color: #0072b2; font-weight: bold;">char</span> <span style="color: #e69f00; font-weight: bold;">pattern</span>[] = <span style="color: #848ea9;">"ould"</span>;        <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">pattern to search for </span><span style="color: #009e73; font-style: italic;">*/</span>

<span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">find all lines matching pattern </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #d55e00;">main</span>()
{
    <span style="color: #0072b2; font-weight: bold;">char</span> <span style="color: #e69f00; font-weight: bold;">line</span>[MAXLINE];
    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">found</span> = 0;

    <span style="color: #56b4e9; font-weight: bold;">while</span> (xgetline(line, MAXLINE) &gt; 0)
        <span style="color: #56b4e9; font-weight: bold;">if</span> (strindex(line, pattern) &gt;= 0) {
            printf(<span style="color: #848ea9;">"%s"</span>, line);
            found++;
        }
    <span style="color: #56b4e9; font-weight: bold;">return</span> found;
}

<span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">getline: get line into s, return length </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #d55e00;">xgetline</span>(<span style="color: #0072b2; font-weight: bold;">char</span> <span style="color: #e69f00; font-weight: bold;">s</span>[], <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">lim</span>)
{
    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">c</span>, <span style="color: #e69f00; font-weight: bold;">i</span>;

    i = 0;
    <span style="color: #56b4e9; font-weight: bold;">while</span> (--lim &gt; 0 &amp;&amp; (c = getchar()) != EOF &amp;&amp; c != <span style="color: #848ea9;">'\n'</span>)
        s[i++] = c;
    <span style="color: #56b4e9; font-weight: bold;">if</span> (c == <span style="color: #848ea9;">'\n'</span>)
        s[i++] = c;
    s[i] = <span style="color: #848ea9;">'\0'</span>;
    <span style="color: #56b4e9; font-weight: bold;">return</span> i;
}

<span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">strindex: return index of t in s, -1 if none </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #d55e00;">strindex</span>(<span style="color: #0072b2; font-weight: bold;">char</span> <span style="color: #e69f00; font-weight: bold;">s</span>[], <span style="color: #0072b2; font-weight: bold;">char</span> <span style="color: #e69f00; font-weight: bold;">t</span>[])
{
    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">i</span>, <span style="color: #e69f00; font-weight: bold;">j</span>, <span style="color: #e69f00; font-weight: bold;">k</span>;

    <span style="color: #56b4e9; font-weight: bold;">for</span> (i = 0; s[i] != <span style="color: #848ea9;">'\0'</span>; i++) {
        <span style="color: #56b4e9; font-weight: bold;">for</span> (j = i, k = 0; t[k] != <span style="color: #848ea9;">'\0'</span> &amp;&amp; s[j] == t[k]; j++, k++);
        <span style="color: #56b4e9; font-weight: bold;">if</span> (k &gt; 0 &amp;&amp; t[k] == <span style="color: #848ea9;">'\0'</span>)
            <span style="color: #56b4e9; font-weight: bold;">return</span> i;
    }
    <span style="color: #56b4e9; font-weight: bold;">return</span> -1;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgfb929ad" class="outline-3">
<h3 id="orgfb929ad">function: atof</h3>
<div class="outline-text-3" id="text-orgfb929ad">
<pre class="example">
ascii to float
</pre>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;ctype.h&gt;</span>

<span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">atof: convert string s to double </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #0072b2; font-weight: bold;">double</span> <span style="color: #d55e00;">atof</span>(<span style="color: #0072b2; font-weight: bold;">char</span> <span style="color: #e69f00; font-weight: bold;">s</span>[])
{
    <span style="color: #0072b2; font-weight: bold;">double</span> <span style="color: #e69f00; font-weight: bold;">val</span>, <span style="color: #e69f00; font-weight: bold;">power</span>;
    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">i</span>, <span style="color: #e69f00; font-weight: bold;">sign</span>;

    <span style="color: #56b4e9; font-weight: bold;">for</span> (i = 0; isspace(s[i]); i++);    <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">skip white space </span><span style="color: #009e73; font-style: italic;">*/</span>
    sign = (s[i] == <span style="color: #848ea9;">'-'</span>) ? -1 : 1;
    <span style="color: #56b4e9; font-weight: bold;">if</span> (s[i] == <span style="color: #848ea9;">'+'</span> || s[i] == <span style="color: #848ea9;">'-'</span>)
        i++;
    <span style="color: #56b4e9; font-weight: bold;">for</span> (val = 0.0; isdigit(s[i]); i++)
        val = 10.0 * val + (s[i] - <span style="color: #848ea9;">'0'</span>);
    <span style="color: #56b4e9; font-weight: bold;">if</span> (s[i] == <span style="color: #848ea9;">'.'</span>)
        i++;
    <span style="color: #56b4e9; font-weight: bold;">for</span> (power = 1.0; isdigit(s[i]); i++) {
        val = 10.0 * val + (s[i] - <span style="color: #848ea9;">'0'</span>);
        power *= 10;
    }
    <span style="color: #56b4e9; font-weight: bold;">return</span> sign * val / power;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org22d09f9" class="outline-3">
<h3 id="org22d09f9">program: calculator</h3>
<div class="outline-text-3" id="text-org22d09f9">
<p>
need to include and change getline
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;stdio.h&gt;</span>

<span style="color: #0072b2;">#define</span> <span style="color: #e69f00; font-weight: bold;">MAXLINE</span> 100

<span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">rudimentary calculator </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #d55e00;">main</span>()
{
    <span style="color: #0072b2; font-weight: bold;">double</span> <span style="color: #e69f00; font-weight: bold;">sum</span>, <span style="color: #d55e00;">atof</span>(<span style="color: #0072b2; font-weight: bold;">char</span>[]);
    <span style="color: #0072b2; font-weight: bold;">char</span> <span style="color: #e69f00; font-weight: bold;">line</span>[MAXLINE];
    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #d55e00;">getline</span>(<span style="color: #0072b2; font-weight: bold;">char</span> <span style="color: #e69f00; font-weight: bold;">line</span>[], <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">max</span>);

    sum = 0;
    <span style="color: #56b4e9; font-weight: bold;">while</span> (getline(line, MAXLINE) &gt; 0)
        printf(<span style="color: #848ea9;">"\t%g\n"</span>, sum += atof(line));
    <span style="color: #56b4e9; font-weight: bold;">return</span> 0;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org4910d5a" class="outline-3">
<h3 id="org4910d5a">function: atoi (rewrite)</h3>
<div class="outline-text-3" id="text-org4910d5a">
<pre class="example">
ascii to integer
</pre>

<p>
Given atof, properly declared, we could write atoi (convert a string
to int) in terms of it:
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">atoi: convert string s to integer using atof </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #d55e00;">atoi</span>(<span style="color: #0072b2; font-weight: bold;">char</span> <span style="color: #e69f00; font-weight: bold;">s</span>[])
{
  <span style="color: #0072b2; font-weight: bold;">double</span> <span style="color: #d55e00;">atof</span>(<span style="color: #0072b2; font-weight: bold;">char</span> <span style="color: #e69f00; font-weight: bold;">s</span>[]);
  <span style="color: #56b4e9; font-weight: bold;">return</span> (<span style="color: #0072b2; font-weight: bold;">int</span>) atof(s);
}
</pre>
</div>
</div>
</div>
