programming/c/code/c-lang.html

<div id="outline-container-org31931f8" class="outline-3">
<h3 id="org31931f8">program: reverse polish calculator</h3>
<div class="outline-text-3" id="text-org31931f8">
<p>
push and pop?
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;stdio.h&gt;</span>
<span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;stdlib.h&gt;</span>     <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">for atof() </span><span style="color: #009e73; font-style: italic;">*/</span>

<span style="color: #0072b2;">#define</span> <span style="color: #e69f00; font-weight: bold;">MAXOP</span> 100       <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">max size of operand or operator </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #0072b2;">#define</span> <span style="color: #e69f00; font-weight: bold;">NUMBER</span> <span style="color: #848ea9;">'0'</span>      <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">signal that a number was found </span><span style="color: #009e73; font-style: italic;">*/</span>

<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #d55e00;">getop</span>(<span style="color: #0072b2; font-weight: bold;">char</span> []);
<span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">push</span>(<span style="color: #0072b2; font-weight: bold;">double</span>);
<span style="color: #0072b2; font-weight: bold;">double</span> <span style="color: #d55e00;">pop</span>(<span style="color: #0072b2; font-weight: bold;">void</span>);

<span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">reverse Polish calculator </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #d55e00;">main</span>()
{
  <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">type</span>;
  <span style="color: #0072b2; font-weight: bold;">double</span> <span style="color: #e69f00; font-weight: bold;">op2</span>;
  <span style="color: #0072b2; font-weight: bold;">char</span> <span style="color: #e69f00; font-weight: bold;">s</span>[MAXOP];

  <span style="color: #56b4e9; font-weight: bold;">while</span> ((type = getop(s)) != EOF) {
    <span style="color: #56b4e9; font-weight: bold;">switch</span> (type) {
    <span style="color: #56b4e9; font-weight: bold;">case</span> NUMBER:
      push(atof(s));
      <span style="color: #56b4e9; font-weight: bold;">break</span>;
    <span style="color: #56b4e9; font-weight: bold;">case</span> <span style="color: #848ea9;">'+'</span>:
      push(pop() + pop());
      <span style="color: #56b4e9; font-weight: bold;">break</span>;
    <span style="color: #56b4e9; font-weight: bold;">case</span> <span style="color: #848ea9;">'*'</span>:
      push(pop() * pop());
      <span style="color: #56b4e9; font-weight: bold;">break</span>;
    <span style="color: #56b4e9; font-weight: bold;">case</span> <span style="color: #848ea9;">'-'</span>:
      op2 = pop();
      push(pop() - op2);
      <span style="color: #56b4e9; font-weight: bold;">break</span>;
    <span style="color: #56b4e9; font-weight: bold;">case</span> <span style="color: #848ea9;">'/'</span>:
      op2 = pop();
      <span style="color: #56b4e9; font-weight: bold;">if</span> (op2 != 0.0)
        push(pop() / op2);
      <span style="color: #56b4e9; font-weight: bold;">else</span>
        printf(<span style="color: #848ea9;">"error: zero divisor\n"</span>);
      <span style="color: #56b4e9; font-weight: bold;">break</span>;
    <span style="color: #56b4e9; font-weight: bold;">case</span> <span style="color: #848ea9;">'\n'</span>:
      printf(<span style="color: #848ea9;">"\t%.8g\n"</span>, pop());
      <span style="color: #56b4e9; font-weight: bold;">break</span>;
    <span style="color: #56b4e9; font-weight: bold;">default</span>:
      printf(<span style="color: #848ea9;">"error: unknown command %s\n"</span>, s);
      <span style="color: #56b4e9; font-weight: bold;">break</span>;
    }
  }
  <span style="color: #56b4e9; font-weight: bold;">return</span> 0;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org6308984" class="outline-3">
<h3 id="org6308984">functions: push &amp; pop</h3>
<div class="outline-text-3" id="text-org6308984">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #0072b2;">#define</span> <span style="color: #e69f00; font-weight: bold;">MAXVAL</span> 100 <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">maximum depth of val stack </span><span style="color: #009e73; font-style: italic;">*/</span>

<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">sp</span> = 0; <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">next free stack position </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #0072b2; font-weight: bold;">double</span> <span style="color: #e69f00; font-weight: bold;">val</span>[MAXVAL]; <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">value stack </span><span style="color: #009e73; font-style: italic;">*/</span>

<span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">push: push f onto value stack </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">push</span>(<span style="color: #0072b2; font-weight: bold;">double</span> <span style="color: #e69f00; font-weight: bold;">f</span>)
{
  <span style="color: #56b4e9; font-weight: bold;">if</span> (sp &lt; MAXVAL)
    val[sp++] = f;
  <span style="color: #56b4e9; font-weight: bold;">else</span>
    printf(<span style="color: #848ea9;">"error: stack full, can't push %g\n"</span>, f);
}

<span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">pop: pop and return top value from stack </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #0072b2; font-weight: bold;">double</span> <span style="color: #d55e00;">pop</span>(<span style="color: #0072b2; font-weight: bold;">void</span>)
{
  <span style="color: #56b4e9; font-weight: bold;">if</span> (sp &gt; 0)
    <span style="color: #56b4e9; font-weight: bold;">return</span> val[--sp];
  <span style="color: #56b4e9; font-weight: bold;">else</span> {
    printf(<span style="color: #848ea9;">"error: stack empty\n"</span>);
    <span style="color: #56b4e9; font-weight: bold;">return</span> 0.0;
  }
}
</pre>
</div>
</div>
</div>
