programming/c/code/c-lang.html

<div id="outline-container-org6c3ef88" class="outline-3">
<h3 id="org6c3ef88">program: complete cal</h3>
<div class="outline-text-3" id="text-org6c3ef88">
<p>
missing getopt()
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;stdio.h&gt;</span>
<span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;stdlib.h&gt;</span>     <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">for atof() </span><span style="color: #009e73; font-style: italic;">*/</span>

<span style="color: #0072b2;">#define</span> <span style="color: #e69f00; font-weight: bold;">MAXOP</span> 100       <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">max size of operand or operator </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #0072b2;">#define</span> <span style="color: #e69f00; font-weight: bold;">NUMBER</span> <span style="color: #848ea9;">'0'</span>      <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">signal that a number was found </span><span style="color: #009e73; font-style: italic;">*/</span>

<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #d55e00;">getop</span>(<span style="color: #0072b2; font-weight: bold;">char</span> []);
<span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">push</span>(<span style="color: #0072b2; font-weight: bold;">double</span>);
<span style="color: #0072b2; font-weight: bold;">double</span> <span style="color: #d55e00;">pop</span>(<span style="color: #0072b2; font-weight: bold;">void</span>);

<span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">reverse Polish calculator </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #d55e00;">main</span>()
{
  <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">type</span>;
  <span style="color: #0072b2; font-weight: bold;">double</span> <span style="color: #e69f00; font-weight: bold;">op2</span>;
  <span style="color: #0072b2; font-weight: bold;">char</span> <span style="color: #e69f00; font-weight: bold;">s</span>[MAXOP];

  <span style="color: #56b4e9; font-weight: bold;">while</span> ((type = getop(s)) != EOF) {
    <span style="color: #56b4e9; font-weight: bold;">switch</span> (type) {
    <span style="color: #56b4e9; font-weight: bold;">case</span> NUMBER:
      push(atof(s));
      <span style="color: #56b4e9; font-weight: bold;">break</span>;
    <span style="color: #56b4e9; font-weight: bold;">case</span> <span style="color: #848ea9;">'+'</span>:
      push(pop() + pop());
      <span style="color: #56b4e9; font-weight: bold;">break</span>;
    <span style="color: #56b4e9; font-weight: bold;">case</span> <span style="color: #848ea9;">'*'</span>:
      push(pop() * pop());
      <span style="color: #56b4e9; font-weight: bold;">break</span>;
    <span style="color: #56b4e9; font-weight: bold;">case</span> <span style="color: #848ea9;">'-'</span>:
      op2 = pop();
      push(pop() - op2);
      <span style="color: #56b4e9; font-weight: bold;">break</span>;
    <span style="color: #56b4e9; font-weight: bold;">case</span> <span style="color: #848ea9;">'/'</span>:
      op2 = pop();
      <span style="color: #56b4e9; font-weight: bold;">if</span> (op2 != 0.0)
        push(pop() / op2);
      <span style="color: #56b4e9; font-weight: bold;">else</span>
        printf(<span style="color: #848ea9;">"error: zero divisor\n"</span>);
      <span style="color: #56b4e9; font-weight: bold;">break</span>;
    <span style="color: #56b4e9; font-weight: bold;">case</span> <span style="color: #848ea9;">'\n'</span>:
      printf(<span style="color: #848ea9;">"\t%.8g\n"</span>, pop());
      <span style="color: #56b4e9; font-weight: bold;">break</span>;
    <span style="color: #56b4e9; font-weight: bold;">default</span>:
      printf(<span style="color: #848ea9;">"error: unknown command %s\n"</span>, s);
      <span style="color: #56b4e9; font-weight: bold;">break</span>;
    }
  }
  <span style="color: #56b4e9; font-weight: bold;">return</span> 0;
}

<span style="color: #0072b2;">#define</span> <span style="color: #e69f00; font-weight: bold;">MAXVAL</span> 100 <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">maximum depth of val stack </span><span style="color: #009e73; font-style: italic;">*/</span>

<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">sp</span> = 0; <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">next free stack position </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #0072b2; font-weight: bold;">double</span> <span style="color: #e69f00; font-weight: bold;">val</span>[MAXVAL]; <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">value stack </span><span style="color: #009e73; font-style: italic;">*/</span>

<span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">push: push f onto value stack </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">push</span>(<span style="color: #0072b2; font-weight: bold;">double</span> <span style="color: #e69f00; font-weight: bold;">f</span>)
{
  <span style="color: #56b4e9; font-weight: bold;">if</span> (sp &lt; MAXVAL)
    val[sp++] = f;
  <span style="color: #56b4e9; font-weight: bold;">else</span>
    printf(<span style="color: #848ea9;">"error: stack full, can't push %g\n"</span>, f);
}

<span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">pop: pop and return top value from stack </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #0072b2; font-weight: bold;">double</span> <span style="color: #d55e00;">pop</span>(<span style="color: #0072b2; font-weight: bold;">void</span>)
{
  <span style="color: #56b4e9; font-weight: bold;">if</span> (sp &gt; 0)
    <span style="color: #56b4e9; font-weight: bold;">return</span> val[--sp];
  <span style="color: #56b4e9; font-weight: bold;">else</span> {
    printf(<span style="color: #848ea9;">"error: stack empty\n"</span>);
    <span style="color: #56b4e9; font-weight: bold;">return</span> 0.0;
  }
}

<span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;ctype.h&gt;</span>

<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #d55e00;">getch</span>(<span style="color: #0072b2; font-weight: bold;">void</span>);
<span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">ungetch</span>(<span style="color: #0072b2; font-weight: bold;">int</span>);

<span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">getop: get next character or numeric operand </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #d55e00;">getop</span>(<span style="color: #0072b2; font-weight: bold;">char</span> <span style="color: #e69f00; font-weight: bold;">s</span>[])
{
  <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">i</span>, <span style="color: #e69f00; font-weight: bold;">c</span>;
  <span style="color: #56b4e9; font-weight: bold;">while</span> ((s[0] = c = getch()) == <span style="color: #848ea9;">' '</span> || c == <span style="color: #848ea9;">'\t'</span>)
    ;
  s[1] = <span style="color: #848ea9;">'\0'</span>;
  <span style="color: #56b4e9; font-weight: bold;">if</span> (!isdigit(c) &amp;&amp; c != <span style="color: #848ea9;">'.'</span>)
    <span style="color: #56b4e9; font-weight: bold;">return</span> c; <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">not a number </span><span style="color: #009e73; font-style: italic;">*/</span>
  i = 0;
  <span style="color: #56b4e9; font-weight: bold;">if</span> (isdigit(c)) <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">collect integer part </span><span style="color: #009e73; font-style: italic;">*/</span>
    <span style="color: #56b4e9; font-weight: bold;">while</span> (isdigit(s[++i] = c = getch()))
      ;
  <span style="color: #56b4e9; font-weight: bold;">if</span> (c == <span style="color: #848ea9;">'.'</span>) <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">collect fraction part </span><span style="color: #009e73; font-style: italic;">*/</span>
    <span style="color: #56b4e9; font-weight: bold;">while</span> (isdigit(s[++i] = c = getch()))
      ;
  s[i] = <span style="color: #848ea9;">'\0'</span>;
  <span style="color: #56b4e9; font-weight: bold;">if</span> (c != EOF)
    ungetch(c);
  <span style="color: #56b4e9; font-weight: bold;">return</span> NUMBER;
}

<span style="color: #0072b2;">#define</span> <span style="color: #e69f00; font-weight: bold;">BUFSIZE</span> 100

<span style="color: #0072b2; font-weight: bold;">char</span> <span style="color: #e69f00; font-weight: bold;">buf</span>[BUFSIZE];      <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">buffer for ungetch </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">bufp</span> = 0;           <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">next free position in buf </span><span style="color: #009e73; font-style: italic;">*/</span>

<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #d55e00;">getch</span>(<span style="color: #0072b2; font-weight: bold;">void</span>) <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">get a (possibly pushed-back) character </span><span style="color: #009e73; font-style: italic;">*/</span>
{
  <span style="color: #56b4e9; font-weight: bold;">return</span> (bufp &gt; 0) ? buf[--bufp] : getchar();
}

<span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">ungetch</span>(<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">c</span>) <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">push character back on input </span><span style="color: #009e73; font-style: italic;">*/</span>
{
  <span style="color: #56b4e9; font-weight: bold;">if</span> (bufp &gt;= BUFSIZE)
    printf(<span style="color: #848ea9;">"ungetch: too many characters\n"</span>);
  <span style="color: #56b4e9; font-weight: bold;">else</span>
    buf[bufp++] = c;
}
</pre>
</div>
</div>
</div>
