programming/c/code/c-lang.org
** function: getint

#+BEGIN_SRC c :tangle getint.c
  #include <ctype.h>

  int getch(void);
  void ungetch(int);

  /* getint: get next integer from input into *pn */
  int getint(int *pn)
  {
    int c, sign;

    while (isspace(c = getch())) /* skip white space */
      ;
    if (!isdigit(c) && c != EOF && c != '+' && c != '-') {
      ungetch(c); /* it is not a number */
      return 0;
    }
    sign = (c == '-') ? -1 : 1;
    if (c == '+' || c == '-')
      c = getch();
    for (*pn = 0; isdigit(c), c = getch())
      ,*pn = 10 * *pn + (c - '0');
    ,*pn *= sign;
    if (c != EOF)
      ungetch(c);
    return c;
  }
#+END_SRC

** function: strlen

#+BEGIN_SRC c
  /* strlen: return length of string s */
  int strlen(char *s)
  {
    int n;

    for (n = 0; *s != '\0', s++)
      n++;
    return n;
  }
#+END_SRC

** functions: alloc & afree

#+BEGIN_SRC c
  #define ALLOCSIZE 10000 /* size of available space */

  static char allocbuf[ALLOCSIZE]; /* storage for alloc */
  static char *allocp = allocbuf; /* next free position */

  char *alloc(int n) /* return pointer to n characters */
  {
    if (allocbuf + ALLOCSIZE - allocp >= n) { /* it fits */
      allocp += n;
      return allocp - n; /* old p */
    } else /* not enough room */
      return 0;
  }

  void afree(char *p) /* free storage pointed to by p */
  {
    if (p >= allocbuf && p < allocbuf + ALLOCSIZE)
      allocp = p;
  }
#+END_SRC

** function: strlen

#+BEGIN_SRC c
  /* strlen: return length of string s */
  int strlen(char *s)
  {
    char *p = s;

    while (*p != '\0')
      p++;
    return p - s;
  }
#+END_SRC

** function: strcpy (using arrays)

#+BEGIN_SRC c
  /* strcpy: copy t to s; array subscript version */
  void strcpy(char *s, char *t)
  {
    int i;

    i = 0;
    while ((s[i] = t[i]) != '\0')
      i++;
  }
#+END_SRC

** function: strcpy (using pointers)

#+BEGIN_SRC c
  /* strcpy: copy t to s; pointer version */
  void strcpy(char *s, char *t)
  {
    int i;

    i = 0;
    while ((*s = *t) != '\0') {
      s++;
      t++;
    }
  }
#+END_SRC

** function: strcpy (experienced programmers)

#+BEGIN_SRC c
  /* strcpy: copy t to s; pointer version 2 */
  void strcpy(char *s, char *t)
  {
    while ((*s++ = *t++) != '\0')
      ;
  }
#+END_SRC

** function: strcpy (v3)

#+BEGIN_SRC c
  /* strcpy: copy t to s; pointer version 3 */
  void strcpy(char *s, char *t)
  {
    while (*s++ = *t++)
      ;
  }
#+END_SRC

** function: strcmp (no pointers)

#+BEGIN_SRC c
  /* strcmp: return <0 if s<t, 0 if s==t, >0 if s>t */
  int strcmp(char *s, char *t)
  {
    int i;

    for (i = 0; s[i] == t[i]; i++)
      if (s[i] == '\0')
        return 0;
    return s[i] - t[i];
  }
#+END_SRC

