programming/c/code/c-lang.html

<div id="outline-container-org02c93cb" class="outline-3">
<h3 id="org02c93cb">function: getint</h3>
<div class="outline-text-3" id="text-org02c93cb">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;ctype.h&gt;</span>

<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #d55e00;">getch</span>(<span style="color: #0072b2; font-weight: bold;">void</span>);
<span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">ungetch</span>(<span style="color: #0072b2; font-weight: bold;">int</span>);

<span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">getint: get next integer from input into *pn </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #d55e00;">getint</span>(<span style="color: #0072b2; font-weight: bold;">int</span> *<span style="color: #e69f00; font-weight: bold;">pn</span>)
{
  <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">c</span>, <span style="color: #e69f00; font-weight: bold;">sign</span>;

  <span style="color: #56b4e9; font-weight: bold;">while</span> (isspace(c = getch())) <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">skip white space </span><span style="color: #009e73; font-style: italic;">*/</span>
    ;
  <span style="color: #56b4e9; font-weight: bold;">if</span> (!isdigit(c) &amp;&amp; c != EOF &amp;&amp; c != <span style="color: #848ea9;">'+'</span> &amp;&amp; c != <span style="color: #848ea9;">'-'</span>) {
    ungetch(c); <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">it is not a number </span><span style="color: #009e73; font-style: italic;">*/</span>
    <span style="color: #56b4e9; font-weight: bold;">return</span> 0;
  }
  sign = (c == <span style="color: #848ea9;">'-'</span>) ? -1 : 1;
  <span style="color: #56b4e9; font-weight: bold;">if</span> (c == <span style="color: #848ea9;">'+'</span> || c == <span style="color: #848ea9;">'-'</span>)
    c = getch();
  <span style="color: #56b4e9; font-weight: bold;">for</span> (*pn = 0; isdigit(c), c = getch())
    *pn = 10 * *pn + (c - <span style="color: #848ea9;">'0'</span>);
  *pn *= sign;
  <span style="color: #56b4e9; font-weight: bold;">if</span> (c != EOF)
    ungetch(c);
  <span style="color: #56b4e9; font-weight: bold;">return</span> c;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org258bf5c" class="outline-3">
<h3 id="org258bf5c">function: strlen</h3>
<div class="outline-text-3" id="text-org258bf5c">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">strlen: return length of string s </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #d55e00;">strlen</span>(<span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #e69f00; font-weight: bold;">s</span>)
{
  <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">n</span>;

  <span style="color: #56b4e9; font-weight: bold;">for</span> (n = 0; *s != <span style="color: #848ea9;">'\0'</span>, s++)
    n++;
  <span style="color: #56b4e9; font-weight: bold;">return</span> n;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgce0a000" class="outline-3">
<h3 id="orgce0a000">functions: alloc &amp; afree</h3>
<div class="outline-text-3" id="text-orgce0a000">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #0072b2;">#define</span> <span style="color: #e69f00; font-weight: bold;">ALLOCSIZE</span> 10000 <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">size of available space </span><span style="color: #009e73; font-style: italic;">*/</span>

<span style="color: #56b4e9; font-weight: bold;">static</span> <span style="color: #0072b2; font-weight: bold;">char</span> <span style="color: #e69f00; font-weight: bold;">allocbuf</span>[ALLOCSIZE]; <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">storage for alloc </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #56b4e9; font-weight: bold;">static</span> <span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #e69f00; font-weight: bold;">allocp</span> = allocbuf; <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">next free position </span><span style="color: #009e73; font-style: italic;">*/</span>

<span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #d55e00;">alloc</span>(<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">n</span>) <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">return pointer to n characters </span><span style="color: #009e73; font-style: italic;">*/</span>
{
  <span style="color: #56b4e9; font-weight: bold;">if</span> (allocbuf + ALLOCSIZE - allocp &gt;= n) { <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">it fits </span><span style="color: #009e73; font-style: italic;">*/</span>
    allocp += n;
    <span style="color: #56b4e9; font-weight: bold;">return</span> allocp - n; <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">old p </span><span style="color: #009e73; font-style: italic;">*/</span>
  } <span style="color: #56b4e9; font-weight: bold;">else</span> <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">not enough room </span><span style="color: #009e73; font-style: italic;">*/</span>
    <span style="color: #56b4e9; font-weight: bold;">return</span> 0;
}

<span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">afree</span>(<span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #e69f00; font-weight: bold;">p</span>) <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">free storage pointed to by p </span><span style="color: #009e73; font-style: italic;">*/</span>
{
  <span style="color: #56b4e9; font-weight: bold;">if</span> (p &gt;= allocbuf &amp;&amp; p &lt; allocbuf + ALLOCSIZE)
    allocp = p;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org9791fbb" class="outline-3">
<h3 id="org9791fbb">function: strlen</h3>
<div class="outline-text-3" id="text-org9791fbb">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">strlen: return length of string s </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #d55e00;">strlen</span>(<span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #e69f00; font-weight: bold;">s</span>)
{
  <span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #e69f00; font-weight: bold;">p</span> = s;

  <span style="color: #56b4e9; font-weight: bold;">while</span> (*p != <span style="color: #848ea9;">'\0'</span>)
    p++;
  <span style="color: #56b4e9; font-weight: bold;">return</span> p - s;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf42f5eb" class="outline-3">
<h3 id="orgf42f5eb">function: strcpy (using arrays)</h3>
<div class="outline-text-3" id="text-orgf42f5eb">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">strcpy: copy t to s; array subscript version </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">strcpy</span>(<span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #e69f00; font-weight: bold;">s</span>, <span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #e69f00; font-weight: bold;">t</span>)
{
  <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">i</span>;

  i = 0;
  <span style="color: #56b4e9; font-weight: bold;">while</span> ((s[i] = t[i]) != <span style="color: #848ea9;">'\0'</span>)
    i++;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org940831a" class="outline-3">
<h3 id="org940831a">function: strcpy (using pointers)</h3>
<div class="outline-text-3" id="text-org940831a">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">strcpy: copy t to s; pointer version </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">strcpy</span>(<span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #e69f00; font-weight: bold;">s</span>, <span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #e69f00; font-weight: bold;">t</span>)
{
  <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">i</span>;

  i = 0;
  <span style="color: #56b4e9; font-weight: bold;">while</span> ((*s = *t) != <span style="color: #848ea9;">'\0'</span>) {
    s++;
    t++;
  }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgeb4ebdc" class="outline-3">
<h3 id="orgeb4ebdc">function: strcpy (experienced programmers)</h3>
<div class="outline-text-3" id="text-orgeb4ebdc">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">strcpy: copy t to s; pointer version 2 </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">strcpy</span>(<span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #e69f00; font-weight: bold;">s</span>, <span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #e69f00; font-weight: bold;">t</span>)
{
  <span style="color: #56b4e9; font-weight: bold;">while</span> ((*s++ = *t++) != <span style="color: #848ea9;">'\0'</span>)
    ;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org6607a52" class="outline-3">
<h3 id="org6607a52">function: strcpy (v3)</h3>
<div class="outline-text-3" id="text-org6607a52">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">strcpy: copy t to s; pointer version 3 </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">strcpy</span>(<span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #e69f00; font-weight: bold;">s</span>, <span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #e69f00; font-weight: bold;">t</span>)
{
  <span style="color: #56b4e9; font-weight: bold;">while</span> (*s++ = *t++)
    ;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org317c680" class="outline-3">
<h3 id="org317c680">function: strcmp (no pointers)</h3>
<div class="outline-text-3" id="text-org317c680">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">strcmp: return &lt;0 if s&lt;t, 0 if s==t, &gt;0 if s&gt;t </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #d55e00;">strcmp</span>(<span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #e69f00; font-weight: bold;">s</span>, <span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #e69f00; font-weight: bold;">t</span>)
{
  <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">i</span>;

  <span style="color: #56b4e9; font-weight: bold;">for</span> (i = 0; s[i] == t[i]; i++)
    <span style="color: #56b4e9; font-weight: bold;">if</span> (s[i] == <span style="color: #848ea9;">'\0'</span>)
      <span style="color: #56b4e9; font-weight: bold;">return</span> 0;
  <span style="color: #56b4e9; font-weight: bold;">return</span> s[i] - t[i];
}
</pre>
</div>
</div>
</div>
