programming/c/code/c-lang.org
** function: strcmp (with pointers)

#+BEGIN_SRC c
  /* strcmp: return <0 if s<t, 0 if s==t, >0 if s>t */
  int strcmp(char *s, char *t)
  {
    for ( ; *s == *t; s++, t++)
      if (*s == '\0')
        return 0;
    return *s - *t;
  }
#+END_SRC

** program: sort input lines

#+BEGIN_EXAMPLE
  + readlines and writelines

  The function getline is from Section 1.9.

  55.c:39:33: error: lvalue required as left operand of assignment
      if (nlines >= maxlines || p = alloc(len) == NULL)
#+END_EXAMPLE

#+BEGIN_SRC c :tangle 55.c
  #include <stdio.h>
  #include <string.h>

  #define MAXLINES 5000 /* max #lines to be sorted */
  char *lineptr[MAXLINES]; /* pointers to text lines */

  int readlines(char *lineptr[], int nlines);
  void writelines(char *lineptr[], int nlines);
  void qsort(char *lineptr[], int left, int right);

  /* sort input lines */
  main()
  {
    int nlines; /* number of input lines read */

    if ((nlines = readlines(lineptr, MAXLINES)) >= 0) {
      qsort(lineptr, 0, nlines-1);
      writelines(lineptr, nlines);
      return 0;
    } else {
      printf("error: input too big to sort\n");
      return 1;
    }
  }

  #define MAXLEN 1000 /* max length of any input line */
  int getline(char *, int);
  char *alloc(int);

  /* readlines: read input lines */
  int readlines(char *lineptr[], int maxlines)
  {
    int len, nlines;
    char *p, line[MAXLEN];

    nlines = 0;
    while ((len = getline(line, MAXLEN)) > 0)
      if (nlines >= maxlines || p == alloc(len) == NULL)
        return -1;
      else {
        line[len-1] = '\0'; /* delete newline */
        strcpy(p, line);
        lineptr[nlines++] = p;
      }
    return nlines;
  }

  /* writelines: write output lines */
  void writelines(char *lineptr[], int nlines)
  {
    int i;

    for (i = 0; i < nlines; i++)
      printf("%s\n", lineptr[i]);
  }
#+END_SRC

** function: writelines

#+BEGIN_SRC c
  /* writelines: write output lines */
  void writelines(char *lineptr[], int nlines)
  {
    while (nlines-- > 0)
      printf("%s\n", *lineptr++);
  }
#+END_SRC

** function: qsort

#+BEGIN_SRC c
  /* qsort: sort v[left]...v[right] into increasing order */
  void qsort(char *v[], int left, int right)
  {
    int i, last;
    void swap(char *v[], int i, int j);

    if (left >= right) /* do nothing if array contains */
      return;          /* fewer than two elements */
    swap(v, left, (left + right)/2);
    last = left;
    for (i = left+1; i <= right; i++)
      if (strcmp(v[i], v[left]) < 0)
        swap(v, ++last, i);
    swap(v, left, last);
    qsort(v, left, last-1);
    qsort(v, last+1, right);
  }
#+END_SRC

** function: swap (using char*)

#+BEGIN_SRC c
  /* swap: interchange v[i] and v[j] */
  void swap(char *v[], int i, int j)
  {
    char *temp;

    temp = v[i];
    v[i] = v[j];
    v[j] = temp;
  }
#+END_SRC

