programming/c/code/c-lang.html

<div id="outline-container-org310aaa1" class="outline-3">
<h3 id="org310aaa1">function: strcmp (with pointers)</h3>
<div class="outline-text-3" id="text-org310aaa1">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">strcmp: return &lt;0 if s&lt;t, 0 if s==t, &gt;0 if s&gt;t </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #d55e00;">strcmp</span>(<span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #e69f00; font-weight: bold;">s</span>, <span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #e69f00; font-weight: bold;">t</span>)
{
  <span style="color: #56b4e9; font-weight: bold;">for</span> ( ; *s == *t; s++, t++)
    <span style="color: #56b4e9; font-weight: bold;">if</span> (*s == <span style="color: #848ea9;">'\0'</span>)
      <span style="color: #56b4e9; font-weight: bold;">return</span> 0;
  <span style="color: #56b4e9; font-weight: bold;">return</span> *s - *t;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org2be6ee4" class="outline-3">
<h3 id="org2be6ee4">program: sort input lines</h3>
<div class="outline-text-3" id="text-org2be6ee4">
<pre class="example">
+ readlines and writelines

The function getline is from Section 1.9.

55.c:39:33: error: lvalue required as left operand of assignment
    if (nlines &gt;= maxlines || p = alloc(len) == NULL)
</pre>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;stdio.h&gt;</span>
<span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;string.h&gt;</span>

<span style="color: #0072b2;">#define</span> <span style="color: #e69f00; font-weight: bold;">MAXLINES</span> 5000 <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">max #lines to be sorted </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #e69f00; font-weight: bold;">lineptr</span>[MAXLINES]; <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">pointers to text lines </span><span style="color: #009e73; font-style: italic;">*/</span>

<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #d55e00;">readlines</span>(<span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #e69f00; font-weight: bold;">lineptr</span>[], <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">nlines</span>);
<span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">writelines</span>(<span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #e69f00; font-weight: bold;">lineptr</span>[], <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">nlines</span>);
<span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">qsort</span>(<span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #e69f00; font-weight: bold;">lineptr</span>[], <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">left</span>, <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">right</span>);

<span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">sort input lines </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #d55e00;">main</span>()
{
  <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">nlines</span>; <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">number of input lines read </span><span style="color: #009e73; font-style: italic;">*/</span>

  <span style="color: #56b4e9; font-weight: bold;">if</span> ((nlines = readlines(lineptr, MAXLINES)) &gt;= 0) {
    qsort(lineptr, 0, nlines-1);
    writelines(lineptr, nlines);
    <span style="color: #56b4e9; font-weight: bold;">return</span> 0;
  } <span style="color: #56b4e9; font-weight: bold;">else</span> {
    printf(<span style="color: #848ea9;">"error: input too big to sort\n"</span>);
    <span style="color: #56b4e9; font-weight: bold;">return</span> 1;
  }
}

<span style="color: #0072b2;">#define</span> <span style="color: #e69f00; font-weight: bold;">MAXLEN</span> 1000 <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">max length of any input line </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #d55e00;">getline</span>(<span style="color: #0072b2; font-weight: bold;">char</span> *, <span style="color: #0072b2; font-weight: bold;">int</span>);
<span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #d55e00;">alloc</span>(<span style="color: #0072b2; font-weight: bold;">int</span>);

<span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">readlines: read input lines </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #d55e00;">readlines</span>(<span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #e69f00; font-weight: bold;">lineptr</span>[], <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">maxlines</span>)
{
  <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">len</span>, <span style="color: #e69f00; font-weight: bold;">nlines</span>;
  <span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #e69f00; font-weight: bold;">p</span>, <span style="color: #e69f00; font-weight: bold;">line</span>[MAXLEN];

  nlines = 0;
  <span style="color: #56b4e9; font-weight: bold;">while</span> ((len = getline(line, MAXLEN)) &gt; 0)
    <span style="color: #56b4e9; font-weight: bold;">if</span> (nlines &gt;= maxlines || p == alloc(len) == <span style="color: #d55e00; font-weight: bold;">NULL</span>)
      <span style="color: #56b4e9; font-weight: bold;">return</span> -1;
    <span style="color: #56b4e9; font-weight: bold;">else</span> {
      line[len-1] = <span style="color: #848ea9;">'\0'</span>; <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">delete newline </span><span style="color: #009e73; font-style: italic;">*/</span>
      strcpy(p, line);
      lineptr[nlines++] = p;
    }
  <span style="color: #56b4e9; font-weight: bold;">return</span> nlines;
}

<span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">writelines: write output lines </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">writelines</span>(<span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #e69f00; font-weight: bold;">lineptr</span>[], <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">nlines</span>)
{
  <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">i</span>;

  <span style="color: #56b4e9; font-weight: bold;">for</span> (i = 0; i &lt; nlines; i++)
    printf(<span style="color: #848ea9;">"%s\n"</span>, lineptr[i]);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgfebfd5c" class="outline-3">
<h3 id="orgfebfd5c">function: writelines</h3>
<div class="outline-text-3" id="text-orgfebfd5c">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">writelines: write output lines </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">writelines</span>(<span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #e69f00; font-weight: bold;">lineptr</span>[], <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">nlines</span>)
{
  <span style="color: #56b4e9; font-weight: bold;">while</span> (nlines-- &gt; 0)
    printf(<span style="color: #848ea9;">"%s\n"</span>, *lineptr++);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org1252086" class="outline-3">
<h3 id="org1252086">function: qsort</h3>
<div class="outline-text-3" id="text-org1252086">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">qsort: sort v[left]...v[right] into increasing order </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">qsort</span>(<span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #e69f00; font-weight: bold;">v</span>[], <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">left</span>, <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">right</span>)
{
  <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">i</span>, <span style="color: #e69f00; font-weight: bold;">last</span>;
  <span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">swap</span>(<span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #e69f00; font-weight: bold;">v</span>[], <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">i</span>, <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">j</span>);

  <span style="color: #56b4e9; font-weight: bold;">if</span> (left &gt;= right) <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">do nothing if array contains </span><span style="color: #009e73; font-style: italic;">*/</span>
    <span style="color: #56b4e9; font-weight: bold;">return</span>;          <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">fewer than two elements </span><span style="color: #009e73; font-style: italic;">*/</span>
  swap(v, left, (left + right)/2);
  last = left;
  <span style="color: #56b4e9; font-weight: bold;">for</span> (i = left+1; i &lt;= right; i++)
    <span style="color: #56b4e9; font-weight: bold;">if</span> (strcmp(v[i], v[left]) &lt; 0)
      swap(v, ++last, i);
  swap(v, left, last);
  qsort(v, left, last-1);
  qsort(v, last+1, right);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgdf38a0e" class="outline-3">
<h3 id="orgdf38a0e">function: swap (using char*)</h3>
<div class="outline-text-3" id="text-orgdf38a0e">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">swap: interchange v[i] and v[j] </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">swap</span>(<span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #e69f00; font-weight: bold;">v</span>[], <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">i</span>, <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">j</span>)
{
  <span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #e69f00; font-weight: bold;">temp</span>;

  temp = v[i];
  v[i] = v[j];
  v[j] = temp;
}
</pre>
</div>
</div>
</div>
