programming/c/code/c-lang.org
** multi-dimensional array: daytab, functions: day_of_year & month_day

#+BEGIN_SRC c
  static char daytab[2][13] = {
    {0, 31, 28, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31},
    {0, 31, 29, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31}
  };

  /* day_of_year: set day of year from month & day */
  int day_of_year(int year, int month, int day)
  {
    int i, leap;
    leap = year%4 == 0 && year%100 != 0 || year%400 == 0;
    for (i = 1; i < month; i++)
      day += daytab[leap][i];
    return day;
  }

  /* month_day: set month, day from day of year */
  void month_day(int year, int yearday, int *pmonth, int *pday)
  {
    int i, leap;

    leap = year%4 == 0 && year%100 != 0 || year%400 == 0;
    for (i = 1; yearday > daytab[leap][i]; i++)
      yearday -= daytab[leap][i];
    ,*pmonth = i;
    ,*pday = yearday;
  }
#+END_SRC

** function: month_name

#+BEGIN_SRC c
  /* month_name: return name of n-th month */
  char *month_name(int n)
  {
    static char *name[] = {
      "Illegal month",
      "January", "February", "March",
      "April", "May", "June",
      "July", "August", "September",
      "October", "November", "December"
    };

    return (n < 1 || n > 12) ? name[0] : name[n];
  }
#+END_SRC

** program: krecho v1

#+BEGIN_EXAMPLE
  kr echo
#+END_EXAMPLE

#+BEGIN_SRC c :tangle krecho.c
  #include <stdio.h>

  /* echo command-line arguments; 1st version */
  main(int argc, char *argv[])
  {
    int i;

    for (i = 1; i < argc; i++)
      printf("%s%s", argv[i], (i < argc-1) ? " " : "");
    printf("\n");
    return 0;
  }
#+END_SRC

** program: krecho v2

#+BEGIN_EXAMPLE
  kr echo
#+END_EXAMPLE

#+BEGIN_SRC c :tangle krechov2.c
  #include <stdio.h>

  /* echo command-line arguments; 2nd version */
  main(int argc, char *argv[])
  {
    while (--argc > 0)
      printf("%s%s", *++argv, (argc > 1) ? " " : "");
    printf("\n");
    return 0;
  }
#+END_SRC

=printf((argc > 1) ? "%s " : "%s", *++argv);=

Alternatively, we could write the printf statement as

This shows that the format argument of printf can be an expression too.

** program: main

uses getline

#+BEGIN_SRC c :tangle
  #include <stdio.h>
  #include <string.h>
  #define MAXLINE 1000

  int getline(char *line, int max);

  /* find: print lines that match pattern from 1st arg */
  main(int argc, char *argv[])
  {
    char line[MAXLINE];
    int found = 0;

    if (argc != 2)
      printf("Usage: find pattern\n");
    else
      while (getline(line, MAXLINE) > 0)
        if (strstr(line, argv[1]) != NULL) {
          printf("%s", line);
          found++;
        }
    return found;
  }
#+END_SRC

