programming/c/code/c-lang.html

<div id="outline-container-orgcc1f4e9" class="outline-3">
<h3 id="orgcc1f4e9">multi-dimensional array: daytab, functions: day_of_year &amp; month_day</h3>
<div class="outline-text-3" id="text-orgcc1f4e9">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #56b4e9; font-weight: bold;">static</span> <span style="color: #0072b2; font-weight: bold;">char</span> <span style="color: #e69f00; font-weight: bold;">daytab</span>[2][13] = {
  {0, 31, 28, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31},
  {0, 31, 29, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31}
};

<span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">day_of_year: set day of year from month &amp; day </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #d55e00;">day_of_year</span>(<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">year</span>, <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">month</span>, <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">day</span>)
{
  <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">i</span>, <span style="color: #e69f00; font-weight: bold;">leap</span>;
  leap = year%4 == 0 &amp;&amp; year%100 != 0 || year%400 == 0;
  <span style="color: #56b4e9; font-weight: bold;">for</span> (i = 1; i &lt; month; i++)
    day += daytab[leap][i];
  <span style="color: #56b4e9; font-weight: bold;">return</span> day;
}

<span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">month_day: set month, day from day of year </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">month_day</span>(<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">year</span>, <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">yearday</span>, <span style="color: #0072b2; font-weight: bold;">int</span> *<span style="color: #e69f00; font-weight: bold;">pmonth</span>, <span style="color: #0072b2; font-weight: bold;">int</span> *<span style="color: #e69f00; font-weight: bold;">pday</span>)
{
  <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">i</span>, <span style="color: #e69f00; font-weight: bold;">leap</span>;

  leap = year%4 == 0 &amp;&amp; year%100 != 0 || year%400 == 0;
  <span style="color: #56b4e9; font-weight: bold;">for</span> (i = 1; yearday &gt; daytab[leap][i]; i++)
    yearday -= daytab[leap][i];
  *pmonth = i;
  *pday = yearday;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org7c7521e" class="outline-3">
<h3 id="org7c7521e">function: month_name</h3>
<div class="outline-text-3" id="text-org7c7521e">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">month_name: return name of n-th month </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #d55e00;">month_name</span>(<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">n</span>)
{
  <span style="color: #56b4e9; font-weight: bold;">static</span> <span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #e69f00; font-weight: bold;">name</span>[] = {
    <span style="color: #848ea9;">"Illegal month"</span>,
    <span style="color: #848ea9;">"January"</span>, <span style="color: #848ea9;">"February"</span>, <span style="color: #848ea9;">"March"</span>,
    <span style="color: #848ea9;">"April"</span>, <span style="color: #848ea9;">"May"</span>, <span style="color: #848ea9;">"June"</span>,
    <span style="color: #848ea9;">"July"</span>, <span style="color: #848ea9;">"August"</span>, <span style="color: #848ea9;">"September"</span>,
    <span style="color: #848ea9;">"October"</span>, <span style="color: #848ea9;">"November"</span>, <span style="color: #848ea9;">"December"</span>
  };

  <span style="color: #56b4e9; font-weight: bold;">return</span> (n &lt; 1 || n &gt; 12) ? name[0] : name[n];
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orge6bc22c" class="outline-3">
<h3 id="orge6bc22c">program: krecho v1</h3>
<div class="outline-text-3" id="text-orge6bc22c">
<pre class="example">
kr echo
</pre>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;stdio.h&gt;</span>

<span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">echo command-line arguments; 1st version </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #d55e00;">main</span>(<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">argc</span>, <span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #e69f00; font-weight: bold;">argv</span>[])
{
  <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">i</span>;

  <span style="color: #56b4e9; font-weight: bold;">for</span> (i = 1; i &lt; argc; i++)
    printf(<span style="color: #848ea9;">"%s%s"</span>, argv[i], (i &lt; argc-1) ? <span style="color: #848ea9;">" "</span> : <span style="color: #848ea9;">""</span>);
  printf(<span style="color: #848ea9;">"\n"</span>);
  <span style="color: #56b4e9; font-weight: bold;">return</span> 0;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgba43fa0" class="outline-3">
<h3 id="orgba43fa0">program: krecho v2</h3>
<div class="outline-text-3" id="text-orgba43fa0">
<pre class="example">
kr echo
</pre>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;stdio.h&gt;</span>

<span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">echo command-line arguments; 2nd version </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #d55e00;">main</span>(<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">argc</span>, <span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #e69f00; font-weight: bold;">argv</span>[])
{
  <span style="color: #56b4e9; font-weight: bold;">while</span> (--argc &gt; 0)
    printf(<span style="color: #848ea9;">"%s%s"</span>, *++argv, (argc &gt; 1) ? <span style="color: #848ea9;">" "</span> : <span style="color: #848ea9;">""</span>);
  printf(<span style="color: #848ea9;">"\n"</span>);
  <span style="color: #56b4e9; font-weight: bold;">return</span> 0;
}
</pre>
</div>

<p>
<code>printf((argc &gt; 1) ? "%s " : "%s", *++argv);</code>
</p>

<p>
Alternatively, we could write the printf statement as
</p>

<p>
This shows that the format argument of printf can be an expression too.
</p>
</div>
</div>

<div id="outline-container-orgd1d2724" class="outline-3">
<h3 id="orgd1d2724">program: main</h3>
<div class="outline-text-3" id="text-orgd1d2724">
<p>
uses getline
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;stdio.h&gt;</span>
<span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;string.h&gt;</span>
<span style="color: #0072b2;">#define</span> <span style="color: #e69f00; font-weight: bold;">MAXLINE</span> 1000

<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #d55e00;">getline</span>(<span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #e69f00; font-weight: bold;">line</span>, <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">max</span>);

<span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">find: print lines that match pattern from 1st arg </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #d55e00;">main</span>(<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">argc</span>, <span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #e69f00; font-weight: bold;">argv</span>[])
{
  <span style="color: #0072b2; font-weight: bold;">char</span> <span style="color: #e69f00; font-weight: bold;">line</span>[MAXLINE];
  <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">found</span> = 0;

  <span style="color: #56b4e9; font-weight: bold;">if</span> (argc != 2)
    printf(<span style="color: #848ea9;">"Usage: find pattern\n"</span>);
  <span style="color: #56b4e9; font-weight: bold;">else</span>
    <span style="color: #56b4e9; font-weight: bold;">while</span> (getline(line, MAXLINE) &gt; 0)
      <span style="color: #56b4e9; font-weight: bold;">if</span> (strstr(line, argv[1]) != <span style="color: #d55e00; font-weight: bold;">NULL</span>) {
        printf(<span style="color: #848ea9;">"%s"</span>, line);
        found++;
      }
  <span style="color: #56b4e9; font-weight: bold;">return</span> found;
}
</pre>
</div>
</div>
</div>
