programming/c/code/c-lang.org
** program: find: print lines that match pattern from 1st arg

#+BEGIN_SRC c
  #include <stdio.h>
  #include <string.h>
  #define MAXLINE 1000

  int getline(char *line, int max);

  /* find: print lines that match pattern from 1st arg */
  main(int argc, char *argv[])
  {
    char line[MAXLINE];
    long lineno = 0;
    int c, except = 0, number = 0, found = 0;

    while (--argc > 0 && (*++argv)[0] == '-')
      while (c = *++argv[0])
        switch (c) {
        case 'x':
          except = 1;
          break;
        case 'n':
          number = 1;
          break;
        default:
          printf("find: illegal option %c\n", c);
          argc = 0;
          found = -1;
          break;
        }
    if (argc != 1)
      printf("Usage: find -x -n pattern\n");
    else
      while (getline(line, MAXLINE) > 0) {
        lineno++;
        if ((strstr(line, *argv) != NULL) != except) {
          if (number)
            printf("%ld:", lineno);
          printf("%s", line);
          found++;
        }
      }
    return found;
  }
#+END_SRC

** program: sort input lines

#+BEGIN_SRC c
  #include <stdio.h>
  #include <string.h>

  #define MAXLINES 5000 /* max #lines to be sorted */
  char *lineptr[MAXLINES]; /* pointers to text lines */


  int readlines(char *lineptr[], int nlines);
  void writelines(char *lineptr[], int nlines);

  void qsort(void *lineptr[], int left, int right,
             int (*comp)(void *, void *));
  int numcmp(char *, char *);

  /* sort input lines */
  main(int argc, char *argv[])
  {
    int nlines; /* number of input lines read */
    int numeric = 0; /* 1 if numeric sort */

    if (argc > 1 && strcmp(argv[1], "-n") == 0)
      numeric = 1;
    if ((nlines = readlines(lineptr, MAXLINES)) >= 0) {
      qsort((void**) lineptr, 0, nlines-1,
            (int (*)(void*,void*))(numeric ? numcmp : strcmp));
      writelines(lineptr, nlines);
      return 0;
    } else {
      printf("input too big to sort\n");
      return 1;
    }
  }
#+END_SRC

** function: qsort

#+BEGIN_SRC c
  /* qsort: sort v[left]...v[right] into increasing order */
  void qsort(void *v[], int left, int right,
             int (*comp)(void *, void *))
  {
    int i, last;
    void swap(void *v[], int, int);

    if (left >= right) /* do nothing if array contains */
      return;          /* fewer than two elements */
    swap(v, left, (left + right)/2);
    last = left;
    for (i = left+1; i <= right; i++)
      if ((*comp)(v[i], v[left]) < 0)
        swap(v, ++last, i);
    swap(v, left, last);
    qsort(v, left, last-1, comp);
    qsort(v, last+1, right, comp);
  }
#+END_SRC

** function: numcmp

#+BEGIN_SRC c
  #include <stdlib.h>

  /* numcmp: compare s1 and s2 numerically */
  int numcmp(char *s1, char *s2)
  {
    double v1, v2;

    v1 = atof(s1);
    v2 = atof(s2);
    if (v1 < v2)
      return -1;
    else if (v1 > v2)
      return 1;
    else
      return 0;
  }
#+END_SRC

