programming/c/code/c-lang.html

<div id="outline-container-org9642ada" class="outline-3">
<h3 id="org9642ada">program: find: print lines that match pattern from 1st arg</h3>
<div class="outline-text-3" id="text-org9642ada">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;stdio.h&gt;</span>
<span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;string.h&gt;</span>
<span style="color: #0072b2;">#define</span> <span style="color: #e69f00; font-weight: bold;">MAXLINE</span> 1000

<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #d55e00;">getline</span>(<span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #e69f00; font-weight: bold;">line</span>, <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">max</span>);

<span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">find: print lines that match pattern from 1st arg </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #d55e00;">main</span>(<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">argc</span>, <span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #e69f00; font-weight: bold;">argv</span>[])
{
  <span style="color: #0072b2; font-weight: bold;">char</span> <span style="color: #e69f00; font-weight: bold;">line</span>[MAXLINE];
  <span style="color: #0072b2; font-weight: bold;">long</span> <span style="color: #e69f00; font-weight: bold;">lineno</span> = 0;
  <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">c</span>, <span style="color: #e69f00; font-weight: bold;">except</span> = 0, <span style="color: #e69f00; font-weight: bold;">number</span> = 0, <span style="color: #e69f00; font-weight: bold;">found</span> = 0;

  <span style="color: #56b4e9; font-weight: bold;">while</span> (--argc &gt; 0 &amp;&amp; (*++argv)[0] == <span style="color: #848ea9;">'-'</span>)
    <span style="color: #56b4e9; font-weight: bold;">while</span> (c = *++argv[0])
      <span style="color: #56b4e9; font-weight: bold;">switch</span> (c) {
      <span style="color: #56b4e9; font-weight: bold;">case</span> <span style="color: #848ea9;">'x'</span>:
        except = 1;
        <span style="color: #56b4e9; font-weight: bold;">break</span>;
      <span style="color: #56b4e9; font-weight: bold;">case</span> <span style="color: #848ea9;">'n'</span>:
        number = 1;
        <span style="color: #56b4e9; font-weight: bold;">break</span>;
      <span style="color: #56b4e9; font-weight: bold;">default</span>:
        printf(<span style="color: #848ea9;">"find: illegal option %c\n"</span>, c);
        argc = 0;
        found = -1;
        <span style="color: #56b4e9; font-weight: bold;">break</span>;
      }
  <span style="color: #56b4e9; font-weight: bold;">if</span> (argc != 1)
    printf(<span style="color: #848ea9;">"Usage: find -x -n pattern\n"</span>);
  <span style="color: #56b4e9; font-weight: bold;">else</span>
    <span style="color: #56b4e9; font-weight: bold;">while</span> (getline(line, MAXLINE) &gt; 0) {
      lineno++;
      <span style="color: #56b4e9; font-weight: bold;">if</span> ((strstr(line, *argv) != <span style="color: #d55e00; font-weight: bold;">NULL</span>) != except) {
        <span style="color: #56b4e9; font-weight: bold;">if</span> (number)
          printf(<span style="color: #848ea9;">"%ld:"</span>, lineno);
        printf(<span style="color: #848ea9;">"%s"</span>, line);
        found++;
      }
    }
  <span style="color: #56b4e9; font-weight: bold;">return</span> found;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbc53534" class="outline-3">
<h3 id="orgbc53534">program: sort input lines</h3>
<div class="outline-text-3" id="text-orgbc53534">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;stdio.h&gt;</span>
<span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;string.h&gt;</span>

<span style="color: #0072b2;">#define</span> <span style="color: #e69f00; font-weight: bold;">MAXLINES</span> 5000 <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">max #lines to be sorted </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #e69f00; font-weight: bold;">lineptr</span>[MAXLINES]; <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">pointers to text lines </span><span style="color: #009e73; font-style: italic;">*/</span>


<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #d55e00;">readlines</span>(<span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #e69f00; font-weight: bold;">lineptr</span>[], <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">nlines</span>);
<span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">writelines</span>(<span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #e69f00; font-weight: bold;">lineptr</span>[], <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">nlines</span>);

<span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">qsort</span>(<span style="color: #0072b2; font-weight: bold;">void</span> *<span style="color: #e69f00; font-weight: bold;">lineptr</span>[], <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">left</span>, <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">right</span>,
           <span style="color: #0072b2; font-weight: bold;">int</span> (*<span style="color: #d55e00;">comp</span>)(<span style="color: #0072b2; font-weight: bold;">void</span> *, <span style="color: #0072b2; font-weight: bold;">void</span> *));
<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #d55e00;">numcmp</span>(<span style="color: #0072b2; font-weight: bold;">char</span> *, <span style="color: #0072b2; font-weight: bold;">char</span> *);

<span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">sort input lines </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #d55e00;">main</span>(<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">argc</span>, <span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #e69f00; font-weight: bold;">argv</span>[])
{
  <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">nlines</span>; <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">number of input lines read </span><span style="color: #009e73; font-style: italic;">*/</span>
  <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">numeric</span> = 0; <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">1 if numeric sort </span><span style="color: #009e73; font-style: italic;">*/</span>

  <span style="color: #56b4e9; font-weight: bold;">if</span> (argc &gt; 1 &amp;&amp; strcmp(argv[1], <span style="color: #848ea9;">"-n"</span>) == 0)
    numeric = 1;
  <span style="color: #56b4e9; font-weight: bold;">if</span> ((nlines = readlines(lineptr, MAXLINES)) &gt;= 0) {
    qsort((<span style="color: #0072b2; font-weight: bold;">void</span>**) lineptr, 0, nlines-1,
          (<span style="color: #0072b2; font-weight: bold;">int</span> (*)(<span style="color: #0072b2; font-weight: bold;">void</span>*,<span style="color: #0072b2; font-weight: bold;">void</span>*))(numeric ? numcmp : strcmp));
    writelines(lineptr, nlines);
    <span style="color: #56b4e9; font-weight: bold;">return</span> 0;
  } <span style="color: #56b4e9; font-weight: bold;">else</span> {
    printf(<span style="color: #848ea9;">"input too big to sort\n"</span>);
    <span style="color: #56b4e9; font-weight: bold;">return</span> 1;
  }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org5154945" class="outline-3">
<h3 id="org5154945">function: qsort</h3>
<div class="outline-text-3" id="text-org5154945">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">qsort: sort v[left]...v[right] into increasing order </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">qsort</span>(<span style="color: #0072b2; font-weight: bold;">void</span> *<span style="color: #e69f00; font-weight: bold;">v</span>[], <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">left</span>, <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">right</span>,
           <span style="color: #0072b2; font-weight: bold;">int</span> (*<span style="color: #d55e00;">comp</span>)(<span style="color: #0072b2; font-weight: bold;">void</span> *, <span style="color: #0072b2; font-weight: bold;">void</span> *))
{
  <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">i</span>, <span style="color: #e69f00; font-weight: bold;">last</span>;
  <span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">swap</span>(<span style="color: #0072b2; font-weight: bold;">void</span> *<span style="color: #e69f00; font-weight: bold;">v</span>[], <span style="color: #0072b2; font-weight: bold;">int</span>, <span style="color: #0072b2; font-weight: bold;">int</span>);

  <span style="color: #56b4e9; font-weight: bold;">if</span> (left &gt;= right) <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">do nothing if array contains </span><span style="color: #009e73; font-style: italic;">*/</span>
    <span style="color: #56b4e9; font-weight: bold;">return</span>;          <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">fewer than two elements </span><span style="color: #009e73; font-style: italic;">*/</span>
  swap(v, left, (left + right)/2);
  last = left;
  <span style="color: #56b4e9; font-weight: bold;">for</span> (i = left+1; i &lt;= right; i++)
    <span style="color: #56b4e9; font-weight: bold;">if</span> ((*comp)(v[i], v[left]) &lt; 0)
      swap(v, ++last, i);
  swap(v, left, last);
  qsort(v, left, last-1, comp);
  qsort(v, last+1, right, comp);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org7eed212" class="outline-3">
<h3 id="org7eed212">function: numcmp</h3>
<div class="outline-text-3" id="text-org7eed212">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;stdlib.h&gt;</span>

<span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">numcmp: compare s1 and s2 numerically </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #d55e00;">numcmp</span>(<span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #e69f00; font-weight: bold;">s1</span>, <span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #e69f00; font-weight: bold;">s2</span>)
{
  <span style="color: #0072b2; font-weight: bold;">double</span> <span style="color: #e69f00; font-weight: bold;">v1</span>, <span style="color: #e69f00; font-weight: bold;">v2</span>;

  v1 = atof(s1);
  v2 = atof(s2);
  <span style="color: #56b4e9; font-weight: bold;">if</span> (v1 &lt; v2)
    <span style="color: #56b4e9; font-weight: bold;">return</span> -1;
  <span style="color: #56b4e9; font-weight: bold;">else</span> <span style="color: #56b4e9; font-weight: bold;">if</span> (v1 &gt; v2)
    <span style="color: #56b4e9; font-weight: bold;">return</span> 1;
  <span style="color: #56b4e9; font-weight: bold;">else</span>
    <span style="color: #56b4e9; font-weight: bold;">return</span> 0;
}
</pre>
</div>
</div>
</div>
