programming/c/code/c-lang.html

<div id="outline-container-org48b5a4b" class="outline-3">
<h3 id="org48b5a4b">function: swap (using void*)</h3>
<div class="outline-text-3" id="text-org48b5a4b">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">swap</span>(<span style="color: #0072b2; font-weight: bold;">void</span> *<span style="color: #e69f00; font-weight: bold;">v</span>[], <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">i</span>, <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">j</span>;)
{
  <span style="color: #0072b2; font-weight: bold;">void</span> *<span style="color: #e69f00; font-weight: bold;">temp</span>;

  temp = v[i];
  v[i] = v[j];
  v[j] = temp;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org2bc463a" class="outline-3">
<h3 id="org2bc463a">functions: dcl &amp; dirdcl</h3>
<div class="outline-text-3" id="text-org2bc463a">
<pre class="example">
recursive decent parser
</pre>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">dcl: parse a declarator </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">dcl</span>(<span style="color: #0072b2; font-weight: bold;">void</span>)
{
  <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">ns</span>;

  <span style="color: #56b4e9; font-weight: bold;">for</span> (ns = 0; gettoken() == <span style="color: #848ea9;">'*'</span>; ) <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">count *'s </span><span style="color: #009e73; font-style: italic;">*/</span>
    ns++;
  dirdcl();
  <span style="color: #56b4e9; font-weight: bold;">while</span> (ns-- &gt; 0)
    strcat(out, <span style="color: #848ea9;">" pointer to"</span>);
}

<span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">dirdcl: parse a direct declarator </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">dirdcl</span>(<span style="color: #0072b2; font-weight: bold;">void</span>)
{
  <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">type</span>;

  <span style="color: #56b4e9; font-weight: bold;">if</span> (tokentype == <span style="color: #848ea9;">'('</span>) { <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">( dcl ) </span><span style="color: #009e73; font-style: italic;">*/</span>
    dcl();
    <span style="color: #56b4e9; font-weight: bold;">if</span> (tokentype != <span style="color: #848ea9;">')'</span>)
      printf(<span style="color: #848ea9;">"error: missing )\n"</span>);
  } <span style="color: #56b4e9; font-weight: bold;">else</span> <span style="color: #56b4e9; font-weight: bold;">if</span> (tokentype == NAME) <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">variable name </span><span style="color: #009e73; font-style: italic;">*/</span>
    strcpy(name, token);
  <span style="color: #56b4e9; font-weight: bold;">else</span>
    printf(<span style="color: #848ea9;">"error: expected name or (dcl)\n"</span>);
  <span style="color: #56b4e9; font-weight: bold;">while</span> ((type=gettoken()) == PARENS || type == BRACKETS)
    <span style="color: #56b4e9; font-weight: bold;">if</span> (type == PARENS)
      strcat(out, <span style="color: #848ea9;">" function returning"</span>);
    <span style="color: #56b4e9; font-weight: bold;">else</span> {
      strcat(out, <span style="color: #848ea9;">" array"</span>);
      strcat(out, token);
      strcat(out, <span style="color: #848ea9;">" of"</span>);
    }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org175d0d8" class="outline-3">
<h3 id="org175d0d8">program: convert declaration to words</h3>
<div class="outline-text-3" id="text-org175d0d8">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;stdio.h&gt;</span>
<span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;string.h&gt;</span>
<span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;ctype.h&gt;</span>
<span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">"krbook.h"</span>

<span style="color: #0072b2;">#define</span> <span style="color: #e69f00; font-weight: bold;">MAXTOKEN</span> 100

<span style="color: #56b4e9; font-weight: bold;">enum</span> { <span style="color: #e69f00; font-weight: bold;">NAME</span>, <span style="color: #e69f00; font-weight: bold;">PARENS</span>, <span style="color: #e69f00; font-weight: bold;">BRACKETS</span> };

<span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">dcl</span>(<span style="color: #0072b2; font-weight: bold;">void</span>);
<span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">dirdcl</span>(<span style="color: #0072b2; font-weight: bold;">void</span>);

<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #d55e00;">gettoken</span>(<span style="color: #0072b2; font-weight: bold;">void</span>);
<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">tokentype</span>;             <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">type of last token </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #0072b2; font-weight: bold;">char</span> <span style="color: #e69f00; font-weight: bold;">token</span>[MAXTOKEN];      <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">last token string </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #0072b2; font-weight: bold;">char</span> <span style="color: #e69f00; font-weight: bold;">name</span>[MAXTOKEN];       <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">identifier name </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #0072b2; font-weight: bold;">char</span> <span style="color: #e69f00; font-weight: bold;">datatype</span>[MAXTOKEN];   <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">data type = char, int, etc. </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #0072b2; font-weight: bold;">char</span> <span style="color: #e69f00; font-weight: bold;">out</span>[1000];

<span style="color: #d55e00;">main</span>() <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">convert declaration to words </span><span style="color: #009e73; font-style: italic;">*/</span>
{
  <span style="color: #56b4e9; font-weight: bold;">while</span> (gettoken() != EOF) { <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">1st token on line </span><span style="color: #009e73; font-style: italic;">*/</span>
    strcpy(datatype, token); <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">is the datatype </span><span style="color: #009e73; font-style: italic;">*/</span>
    out[0] = <span style="color: #848ea9;">'\0'</span>;
    dcl(); <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">parse rest of line </span><span style="color: #009e73; font-style: italic;">*/</span>
    <span style="color: #56b4e9; font-weight: bold;">if</span> (tokentype != <span style="color: #848ea9;">'\n'</span>)
      printf(<span style="color: #848ea9;">"syntax error\n"</span>);
    printf(<span style="color: #848ea9;">"%s: %s %s\n"</span>, name, out, datatype);
  }
  <span style="color: #56b4e9; font-weight: bold;">return</span> 0;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org28cc1cc" class="outline-3">
<h3 id="org28cc1cc">function: gettoken</h3>
<div class="outline-text-3" id="text-org28cc1cc">
<p>
think that i'm missing some global variables
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #d55e00;">gettoken</span>(<span style="color: #0072b2; font-weight: bold;">void</span>) <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">return next token </span><span style="color: #009e73; font-style: italic;">*/</span>
{
  <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">c</span>, <span style="color: #d55e00;">getch</span>(<span style="color: #0072b2; font-weight: bold;">void</span>);
  <span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">ungetch</span>(<span style="color: #0072b2; font-weight: bold;">int</span>);
  <span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #e69f00; font-weight: bold;">p</span> = token;

  <span style="color: #56b4e9; font-weight: bold;">while</span> ((c = getch()) == <span style="color: #848ea9;">' '</span> || c == <span style="color: #848ea9;">'\t'</span>)
    ;
  <span style="color: #56b4e9; font-weight: bold;">if</span> (c == <span style="color: #848ea9;">'('</span>) {
    <span style="color: #56b4e9; font-weight: bold;">if</span> ((c = getch()) == <span style="color: #848ea9;">')'</span>) {
      strcpy(token, <span style="color: #848ea9;">"()"</span>);
      <span style="color: #56b4e9; font-weight: bold;">return</span> tokentype = PARENS;
    } <span style="color: #56b4e9; font-weight: bold;">else</span> {
      ungetch(c);
      <span style="color: #56b4e9; font-weight: bold;">return</span> tokentype = <span style="color: #848ea9;">'('</span>;
    }
  } <span style="color: #56b4e9; font-weight: bold;">else</span> <span style="color: #56b4e9; font-weight: bold;">if</span> (c == <span style="color: #848ea9;">'['</span>) {
    <span style="color: #56b4e9; font-weight: bold;">for</span> (*p++ = c; (*p++ = getch()) != <span style="color: #848ea9;">']'</span>; )
      ;
    *p = <span style="color: #848ea9;">'\0'</span>;
    <span style="color: #56b4e9; font-weight: bold;">return</span> tokentype = BRACKETS;
  } <span style="color: #56b4e9; font-weight: bold;">else</span> <span style="color: #56b4e9; font-weight: bold;">if</span> (isalpha(c)) {
    <span style="color: #56b4e9; font-weight: bold;">for</span> (*p++ = c; isalnum(c = getch()); )
      *p++ = c;
    *p = <span style="color: #848ea9;">'\0'</span>;
    ungetch(c);
    <span style="color: #56b4e9; font-weight: bold;">return</span> tokentype = NAME;
  } <span style="color: #56b4e9; font-weight: bold;">else</span>
    <span style="color: #56b4e9; font-weight: bold;">return</span> tokentype = c;
}
</pre>
</div>
</div>
</div>
