programming/c/code/c-lang.org
** program: undcl

#+BEGIN_SRC c
  /* undcl: convert word descriptions to declarations */
  main()
  {
    int type;
    char temp[MAXTOKEN];

    while (gettoken() != EOF) {
      strcpy(out, token);
      while ((type = gettoken()) != '\n')
        if (type == PARENS || type == BRACKETS)
          strcat(out, token);
        else if (type == '*') {
          sprintf(temp, "(*%s)", out);
          strcpy(out, temp);
        } else if (type == NAME) {
          sprintf(temp, "%s %s", token, out);
          strcpy(out, temp);
        } else
          printf("invalid input at %s\n", token);
    }
    return 0;
  }
#+END_SRC

* Chapter 6 - Structures

** function: makepoint

#+BEGIN_SRC c
  /* makepoint: make a point from x and y components */
  struct point makepoint(int x, int y)
  {
    struct point temp;

    temp.x = x;
    temp.y = y;
    return temp;
  }
#+END_SRC

** program: using makepoint

#+BEGIN_SRC c
  #include <stdio.h>

  #define XMAX 80
  #define YMAX 24

  struct point {
    int x;
    int y;
  };

  struct rect {
    struct point pt1;
    struct point pt2;
  };

  int main(void) {
    struct rect screen;
    struct point middle;
    struct point makepoint(int, int);

    screen.pt1 = makepoint(0,0);
    screen.pt2 = makepoint(XMAX, YMAX);
    middle = makepoint((screen.pt1.x + screen.pt2.x)/2,
                       (screen.pt1.y + screen.pt2.y)/2);

    printf("x:%d y:%d\n",middle.x, middle.y);

    return 0;
  }
#+END_SRC

** function: addpoint

#+BEGIN_SRC c
  /* addpoints: add two points */
  struct point addpoint(struct point p1, struct point p2)
  {
    p1.x += p2.x;
    p1.y += p2.y;
    return p1;
  }
#+END_SRC

** function: ptinrect

#+BEGIN_SRC c
  /* ptinrect: return 1 if p in r, 0 if not */
  int ptinrect(struct point p, struct rect r)
  {
    return p.x >= r.pt1.x && p.x < r.pt2.x
      && p.y >= r.pt1.y && p.y < r.pt2.y;
  }
#+END_SRC

** function: canonrect

#+BEGIN_SRC c
  #define min(a, b) ((a) < (b) ? (a) : (b))
  #define max(a, b) ((a) > (b) ? (a) : (b))

  /* canonrect: canonicalize coordinates of rectangle */
  struct rect canonrect(struct rect r)
  {
    struct rect temp;

    temp.pt1.x = min(r.pt1.x,r.pt2.x);
    temp.pt1.y = min(r.pt1.y,r.pt2.y);
    temp.pt2.x = max(r.pt1.x,r.pt2.x);
    temp.pt2.y = max(r.pt1.y,r.pt2.y);
    return temp;
  }
#+END_SRC

