programming/c/code/c-lang.html

<div id="outline-container-org6e78a7d" class="outline-3">
<h3 id="org6e78a7d">program: undcl</h3>
<div class="outline-text-3" id="text-org6e78a7d">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">undcl: convert word descriptions to declarations </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #d55e00;">main</span>()
{
  <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">type</span>;
  <span style="color: #0072b2; font-weight: bold;">char</span> <span style="color: #e69f00; font-weight: bold;">temp</span>[MAXTOKEN];

  <span style="color: #56b4e9; font-weight: bold;">while</span> (gettoken() != EOF) {
    strcpy(out, token);
    <span style="color: #56b4e9; font-weight: bold;">while</span> ((type = gettoken()) != <span style="color: #848ea9;">'\n'</span>)
      <span style="color: #56b4e9; font-weight: bold;">if</span> (type == PARENS || type == BRACKETS)
        strcat(out, token);
      <span style="color: #56b4e9; font-weight: bold;">else</span> <span style="color: #56b4e9; font-weight: bold;">if</span> (type == <span style="color: #848ea9;">'*'</span>) {
        sprintf(temp, <span style="color: #848ea9;">"(*%s)"</span>, out);
        strcpy(out, temp);
      } <span style="color: #56b4e9; font-weight: bold;">else</span> <span style="color: #56b4e9; font-weight: bold;">if</span> (type == NAME) {
        sprintf(temp, <span style="color: #848ea9;">"%s %s"</span>, token, out);
        strcpy(out, temp);
      } <span style="color: #56b4e9; font-weight: bold;">else</span>
        printf(<span style="color: #848ea9;">"invalid input at %s\n"</span>, token);
  }
  <span style="color: #56b4e9; font-weight: bold;">return</span> 0;
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org05fa51f" class="outline-2">
<h2 id="org05fa51f">Chapter 6 - Structures</h2>
<div class="outline-text-2" id="text-org05fa51f">
</div>
<div id="outline-container-org1141698" class="outline-3">
<h3 id="org1141698">function: makepoint</h3>
<div class="outline-text-3" id="text-org1141698">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">makepoint: make a point from x and y components </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #56b4e9; font-weight: bold;">struct</span> <span style="color: #0072b2; font-weight: bold;">point</span> <span style="color: #d55e00;">makepoint</span>(<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">x</span>, <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">y</span>)
{
  <span style="color: #56b4e9; font-weight: bold;">struct</span> <span style="color: #0072b2; font-weight: bold;">point</span> <span style="color: #e69f00; font-weight: bold;">temp</span>;

  temp.x = x;
  temp.y = y;
  <span style="color: #56b4e9; font-weight: bold;">return</span> temp;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb53e277" class="outline-3">
<h3 id="orgb53e277">program: using makepoint</h3>
<div class="outline-text-3" id="text-orgb53e277">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;stdio.h&gt;</span>

<span style="color: #0072b2;">#define</span> <span style="color: #e69f00; font-weight: bold;">XMAX</span> 80
<span style="color: #0072b2;">#define</span> <span style="color: #e69f00; font-weight: bold;">YMAX</span> 24

<span style="color: #56b4e9; font-weight: bold;">struct</span> <span style="color: #0072b2; font-weight: bold;">point</span> {
  <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">x</span>;
  <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">y</span>;
};

<span style="color: #56b4e9; font-weight: bold;">struct</span> <span style="color: #0072b2; font-weight: bold;">rect</span> {
  <span style="color: #56b4e9; font-weight: bold;">struct</span> <span style="color: #0072b2; font-weight: bold;">point</span> <span style="color: #e69f00; font-weight: bold;">pt1</span>;
  <span style="color: #56b4e9; font-weight: bold;">struct</span> <span style="color: #0072b2; font-weight: bold;">point</span> <span style="color: #e69f00; font-weight: bold;">pt2</span>;
};

<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #d55e00;">main</span>(<span style="color: #0072b2; font-weight: bold;">void</span>) {
  <span style="color: #56b4e9; font-weight: bold;">struct</span> <span style="color: #0072b2; font-weight: bold;">rect</span> <span style="color: #e69f00; font-weight: bold;">screen</span>;
  <span style="color: #56b4e9; font-weight: bold;">struct</span> <span style="color: #0072b2; font-weight: bold;">point</span> <span style="color: #e69f00; font-weight: bold;">middle</span>;
  <span style="color: #56b4e9; font-weight: bold;">struct</span> <span style="color: #0072b2; font-weight: bold;">point</span> <span style="color: #d55e00;">makepoint</span>(<span style="color: #0072b2; font-weight: bold;">int</span>, <span style="color: #0072b2; font-weight: bold;">int</span>);

  screen.pt1 = makepoint(0,0);
  screen.pt2 = makepoint(XMAX, YMAX);
  middle = makepoint((screen.pt1.x + screen.pt2.x)/2,
                     (screen.pt1.y + screen.pt2.y)/2);

  printf(<span style="color: #848ea9;">"x:%d y:%d\n"</span>,middle.x, middle.y);

  <span style="color: #56b4e9; font-weight: bold;">return</span> 0;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org18e31c3" class="outline-3">
<h3 id="org18e31c3">function: addpoint</h3>
<div class="outline-text-3" id="text-org18e31c3">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">addpoints: add two points </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #56b4e9; font-weight: bold;">struct</span> <span style="color: #0072b2; font-weight: bold;">point</span> <span style="color: #d55e00;">addpoint</span>(<span style="color: #56b4e9; font-weight: bold;">struct</span> <span style="color: #0072b2; font-weight: bold;">point</span> <span style="color: #e69f00; font-weight: bold;">p1</span>, <span style="color: #56b4e9; font-weight: bold;">struct</span> <span style="color: #0072b2; font-weight: bold;">point</span> <span style="color: #e69f00; font-weight: bold;">p2</span>)
{
  p1.x += p2.x;
  p1.y += p2.y;
  <span style="color: #56b4e9; font-weight: bold;">return</span> p1;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgcda6dcb" class="outline-3">
<h3 id="orgcda6dcb">function: ptinrect</h3>
<div class="outline-text-3" id="text-orgcda6dcb">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">ptinrect: return 1 if p in r, 0 if not </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #d55e00;">ptinrect</span>(<span style="color: #56b4e9; font-weight: bold;">struct</span> <span style="color: #0072b2; font-weight: bold;">point</span> <span style="color: #e69f00; font-weight: bold;">p</span>, <span style="color: #56b4e9; font-weight: bold;">struct</span> <span style="color: #0072b2; font-weight: bold;">rect</span> <span style="color: #e69f00; font-weight: bold;">r</span>)
{
  <span style="color: #56b4e9; font-weight: bold;">return</span> p.x &gt;= r.pt1.x &amp;&amp; p.x &lt; r.pt2.x
    &amp;&amp; p.y &gt;= r.pt1.y &amp;&amp; p.y &lt; r.pt2.y;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb638b9d" class="outline-3">
<h3 id="orgb638b9d">function: canonrect</h3>
<div class="outline-text-3" id="text-orgb638b9d">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #0072b2;">#define</span> <span style="color: #d55e00;">min</span>(<span style="color: #e69f00; font-weight: bold;">a</span>, <span style="color: #e69f00; font-weight: bold;">b</span>) ((a) &lt; (b) ? (a) : (b))
<span style="color: #0072b2;">#define</span> <span style="color: #d55e00;">max</span>(<span style="color: #e69f00; font-weight: bold;">a</span>, <span style="color: #e69f00; font-weight: bold;">b</span>) ((a) &gt; (b) ? (a) : (b))

<span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">canonrect: canonicalize coordinates of rectangle </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #56b4e9; font-weight: bold;">struct</span> <span style="color: #0072b2; font-weight: bold;">rect</span> <span style="color: #d55e00;">canonrect</span>(<span style="color: #56b4e9; font-weight: bold;">struct</span> <span style="color: #0072b2; font-weight: bold;">rect</span> <span style="color: #e69f00; font-weight: bold;">r</span>)
{
  <span style="color: #56b4e9; font-weight: bold;">struct</span> <span style="color: #0072b2; font-weight: bold;">rect</span> <span style="color: #e69f00; font-weight: bold;">temp</span>;

  temp.pt1.x = min(r.pt1.x,r.pt2.x);
  temp.pt1.y = min(r.pt1.y,r.pt2.y);
  temp.pt2.x = max(r.pt1.x,r.pt2.x);
  temp.pt2.y = max(r.pt1.y,r.pt2.y);
  <span style="color: #56b4e9; font-weight: bold;">return</span> temp;
}
</pre>
</div>
</div>
</div>
