programming/c/code/c-lang.html

<div id="outline-container-org73b1198" class="outline-3">
<h3 id="org73b1198">program: keyword-counting (using array indices)</h3>
<div class="outline-text-3" id="text-org73b1198">
<pre class="example">
won't compile
keytab?
</pre>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;stdio.h&gt;</span>
<span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;ctype.h&gt;</span>
<span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;string.h&gt;</span>

<span style="color: #0072b2;">#define</span> <span style="color: #e69f00; font-weight: bold;">MAXWORD</span> 100
<span style="color: #0072b2;">#define</span> <span style="color: #e69f00; font-weight: bold;">NKEYS</span> (<span style="color: #56b4e9; font-weight: bold;">sizeof</span> keytab / <span style="color: #56b4e9; font-weight: bold;">sizeof</span>(<span style="color: #56b4e9; font-weight: bold;">struct</span> <span style="color: #0072b2; font-weight: bold;">key</span>))

<span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">int getword(char *, int); </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">int binsearch(char *, struct key *, int); </span><span style="color: #009e73; font-style: italic;">*/</span>

<span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">declare and initialize structure </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #56b4e9; font-weight: bold;">struct</span> <span style="color: #0072b2; font-weight: bold;">key</span> {
  <span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #e69f00; font-weight: bold;">word</span>;
  <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">count</span>;
} <span style="color: #e69f00; font-weight: bold;">keytab</span>[] = {
              <span style="color: #848ea9;">"auto"</span>, 0,
              <span style="color: #848ea9;">"break"</span>, 0,
              <span style="color: #848ea9;">"case"</span>, 0,
              <span style="color: #848ea9;">"char"</span>, 0,
              <span style="color: #848ea9;">"const"</span>, 0,
              <span style="color: #848ea9;">"continue"</span>, 0,
              <span style="color: #848ea9;">"default"</span>, 0,
              <span style="color: #848ea9;">"unsigned"</span>, 0,
              <span style="color: #848ea9;">"void"</span>, 0,
              <span style="color: #848ea9;">"volatile"</span>, 0,
              <span style="color: #848ea9;">"while"</span>, 0
};

<span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">count C keywords </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #d55e00;">main</span>()
{
  <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">n</span>;
  <span style="color: #0072b2; font-weight: bold;">char</span> <span style="color: #e69f00; font-weight: bold;">word</span>[MAXWORD];

  <span style="color: #56b4e9; font-weight: bold;">while</span> (getword(word, MAXWORD) != EOF)
    <span style="color: #56b4e9; font-weight: bold;">if</span> (isalpha(word[0]))
      <span style="color: #56b4e9; font-weight: bold;">if</span> ((n = binsearch(word, keytab, NKEYS)) &gt;= 0)
        keytab[n].count++;
  <span style="color: #56b4e9; font-weight: bold;">for</span> (n = 0; n &lt; NKEYS; n++)
    <span style="color: #56b4e9; font-weight: bold;">if</span> (keytab[n].count &gt; 0)
      printf(<span style="color: #848ea9;">"%4d %s\n"</span>,
             keytab[n].count, keytab[n].word);
  <span style="color: #56b4e9; font-weight: bold;">return</span> 0;
}

<span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">binsearch: find word in tab[0]...tab[n-1] </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #d55e00;">binsearch</span>(<span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #e69f00; font-weight: bold;">word</span>, <span style="color: #56b4e9; font-weight: bold;">struct</span> <span style="color: #0072b2; font-weight: bold;">key</span> <span style="color: #e69f00; font-weight: bold;">tab</span>[], <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">n</span>)
{
  <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">cond</span>;
  <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">low</span>, <span style="color: #e69f00; font-weight: bold;">high</span>, <span style="color: #e69f00; font-weight: bold;">mid</span>;

  low = 0;
  high = n - 1;
  <span style="color: #56b4e9; font-weight: bold;">while</span> (low &lt;= high) {
    mid = (low+high) / 2;
    <span style="color: #56b4e9; font-weight: bold;">if</span> ((cond = strcmp(word, tab[mid].word)) &lt; 0)
      high = mid - 1;
    <span style="color: #56b4e9; font-weight: bold;">else</span> <span style="color: #56b4e9; font-weight: bold;">if</span> (cond &gt; 0)
      low = mid + 1;
    <span style="color: #56b4e9; font-weight: bold;">else</span>
      <span style="color: #56b4e9; font-weight: bold;">return</span> mid;
  }
  <span style="color: #56b4e9; font-weight: bold;">return</span> -1;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org195366d" class="outline-3">
<h3 id="org195366d">function: getword</h3>
<div class="outline-text-3" id="text-org195366d">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">getword: get next word or character from input </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #d55e00;">getword</span>(<span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #e69f00; font-weight: bold;">word</span>, <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">lim</span>)
{
  <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">c</span>, <span style="color: #d55e00;">getch</span>(<span style="color: #0072b2; font-weight: bold;">void</span>);
  <span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">ungetch</span>(<span style="color: #0072b2; font-weight: bold;">int</span>);
  <span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #e69f00; font-weight: bold;">w</span> = word;

  <span style="color: #56b4e9; font-weight: bold;">while</span> (isspace(c = getch()))
    ;
  <span style="color: #56b4e9; font-weight: bold;">if</span> (c != EOF)
    *w++ = c;
  <span style="color: #56b4e9; font-weight: bold;">if</span> (!isalpha(c)) {
    *w = <span style="color: #848ea9;">'\0'</span>;
    <span style="color: #56b4e9; font-weight: bold;">return</span> c;
  }
  <span style="color: #56b4e9; font-weight: bold;">for</span> ( ; --lim &gt; 0; w++)
    <span style="color: #56b4e9; font-weight: bold;">if</span> (!isalnum(*w = getch())) {
      ungetch(*w);
      <span style="color: #56b4e9; font-weight: bold;">break</span>;
    }
  *w = <span style="color: #848ea9;">'\0'</span>;
  <span style="color: #56b4e9; font-weight: bold;">return</span> word[0];
}
</pre>
</div>
</div>
</div>
