programming/c/code/c-lang.org
** program: keyword-counting (using pointers)

#+BEGIN_SRC c :tangle krpoint.c
  #include <stdio.h>
  #include <ctype.h>
  #include <string.h>
  #include "ch06.h"

  #define MAXWORD 100
  #define NKEYS (sizeof keytab / sizeof(struct key))

  int getword(char *, int);
  struct key *binsearch(char *, struct key *, int);

  struct key {
    char *word;
    int count;
  } keytab[] = {
                "auto", 0,
                "break", 0,
                "case", 0,
                "char", 0,
                "const", 0,
                "continue", 0,
                "default", 0,
                "unsigned", 0,
                "void", 0,
                "volatile", 0,
                "while", 0
  };

  /* count C keywords; pointer version */
  main()
  {
    char word[MAXWORD];
    struct key *p;

    while (getword(word, MAXWORD) != EOF)
      if (isalpha(word[0]))
        if ((p=binsearch(word, keytab, NKEYS)) != NULL)
          p->count++;
    for (p = keytab; p < keytab + NKEYS; p++)
      if (p->count > 0)
        printf("%4d %s\n", p->count, p->word);
    return 0;
  }

  /* binsearch: find word in tab[0]...tab[n-1] */
  struct key *binsearch(char *word, struct key *tab, int n)
  {
    int cond;
    struct key *low = &tab[0];
    struct key *high = &tab[n];
    struct key *mid;

    while (low < high) {
      mid = low + (high-low) / 2;
      if ((cond = strcmp(word, mid->word)) < 0)
        high = mid;
      else if (cond > 0)
        low = mid + 1;
      else
        return mid;
    }
    return NULL;
  }
#+END_SRC

** struct: tnode

#+BEGIN_SRC c :tangle ch06.h
  struct tnode {		/* the tree node: */
    char *word;		/* points to the text */
    int count;		/* number of occurrences */
    struct tnode *left;	/* left child */
    struct tnode *right;	/* right child */
  };
#+END_SRC

** program: word frequency count

#+BEGIN_SRC c :tangle kr nodes.c
  #include <stdio.h>
  #include <ctype.h>
  #include <string.h>
  #include "ch06.h"

  #define MAXWORD 100

  struct tnode *addtree(struct tnode *, char *);
  void treeprint(struct tnode *);
  int getword(char *, int);

  /* word frequency count */
  main()
  {
    struct tnode *root;
    char word[MAXWORD];

    root = NULL;
    while (getword(word, MAXWORD) != EOF)
      if (isalpha(word[0]))
        root = addtree(root, word);
    treeprint(root);
    return 0;
  }
#+END_SRC

