programming/c/code/c-lang.html

<div id="outline-container-org7b65d7d" class="outline-3">
<h3 id="org7b65d7d">program: keyword-counting (using pointers)</h3>
<div class="outline-text-3" id="text-org7b65d7d">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;stdio.h&gt;</span>
<span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;ctype.h&gt;</span>
<span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;string.h&gt;</span>
<span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">"ch06.h"</span>

<span style="color: #0072b2;">#define</span> <span style="color: #e69f00; font-weight: bold;">MAXWORD</span> 100
<span style="color: #0072b2;">#define</span> <span style="color: #e69f00; font-weight: bold;">NKEYS</span> (<span style="color: #56b4e9; font-weight: bold;">sizeof</span> keytab / <span style="color: #56b4e9; font-weight: bold;">sizeof</span>(<span style="color: #56b4e9; font-weight: bold;">struct</span> <span style="color: #0072b2; font-weight: bold;">key</span>))

<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #d55e00;">getword</span>(<span style="color: #0072b2; font-weight: bold;">char</span> *, <span style="color: #0072b2; font-weight: bold;">int</span>);
<span style="color: #56b4e9; font-weight: bold;">struct</span> <span style="color: #0072b2; font-weight: bold;">key</span> *<span style="color: #d55e00;">binsearch</span>(<span style="color: #0072b2; font-weight: bold;">char</span> *, <span style="color: #56b4e9; font-weight: bold;">struct</span> <span style="color: #0072b2; font-weight: bold;">key</span> *, <span style="color: #0072b2; font-weight: bold;">int</span>);

<span style="color: #56b4e9; font-weight: bold;">struct</span> <span style="color: #0072b2; font-weight: bold;">key</span> {
  <span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #e69f00; font-weight: bold;">word</span>;
  <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">count</span>;
} <span style="color: #e69f00; font-weight: bold;">keytab</span>[] = {
              <span style="color: #848ea9;">"auto"</span>, 0,
              <span style="color: #848ea9;">"break"</span>, 0,
              <span style="color: #848ea9;">"case"</span>, 0,
              <span style="color: #848ea9;">"char"</span>, 0,
              <span style="color: #848ea9;">"const"</span>, 0,
              <span style="color: #848ea9;">"continue"</span>, 0,
              <span style="color: #848ea9;">"default"</span>, 0,
              <span style="color: #848ea9;">"unsigned"</span>, 0,
              <span style="color: #848ea9;">"void"</span>, 0,
              <span style="color: #848ea9;">"volatile"</span>, 0,
              <span style="color: #848ea9;">"while"</span>, 0
};

<span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">count C keywords; pointer version </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #d55e00;">main</span>()
{
  <span style="color: #0072b2; font-weight: bold;">char</span> <span style="color: #e69f00; font-weight: bold;">word</span>[MAXWORD];
  <span style="color: #56b4e9; font-weight: bold;">struct</span> <span style="color: #0072b2; font-weight: bold;">key</span> *<span style="color: #e69f00; font-weight: bold;">p</span>;

  <span style="color: #56b4e9; font-weight: bold;">while</span> (getword(word, MAXWORD) != EOF)
    <span style="color: #56b4e9; font-weight: bold;">if</span> (isalpha(word[0]))
      <span style="color: #56b4e9; font-weight: bold;">if</span> ((p=binsearch(word, keytab, NKEYS)) != <span style="color: #d55e00; font-weight: bold;">NULL</span>)
        p-&gt;count++;
  <span style="color: #56b4e9; font-weight: bold;">for</span> (p = keytab; p &lt; keytab + NKEYS; p++)
    <span style="color: #56b4e9; font-weight: bold;">if</span> (p-&gt;count &gt; 0)
      printf(<span style="color: #848ea9;">"%4d %s\n"</span>, p-&gt;count, p-&gt;word);
  <span style="color: #56b4e9; font-weight: bold;">return</span> 0;
}

<span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">binsearch: find word in tab[0]...tab[n-1] </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #56b4e9; font-weight: bold;">struct</span> <span style="color: #0072b2; font-weight: bold;">key</span> *<span style="color: #d55e00;">binsearch</span>(<span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #e69f00; font-weight: bold;">word</span>, <span style="color: #56b4e9; font-weight: bold;">struct</span> <span style="color: #0072b2; font-weight: bold;">key</span> *<span style="color: #e69f00; font-weight: bold;">tab</span>, <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">n</span>)
{
  <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">cond</span>;
  <span style="color: #56b4e9; font-weight: bold;">struct</span> <span style="color: #0072b2; font-weight: bold;">key</span> *<span style="color: #e69f00; font-weight: bold;">low</span> = &amp;tab[0];
  <span style="color: #56b4e9; font-weight: bold;">struct</span> <span style="color: #0072b2; font-weight: bold;">key</span> *<span style="color: #e69f00; font-weight: bold;">high</span> = &amp;tab[n];
  <span style="color: #56b4e9; font-weight: bold;">struct</span> <span style="color: #0072b2; font-weight: bold;">key</span> *<span style="color: #e69f00; font-weight: bold;">mid</span>;

  <span style="color: #56b4e9; font-weight: bold;">while</span> (low &lt; high) {
    mid = low + (high-low) / 2;
    <span style="color: #56b4e9; font-weight: bold;">if</span> ((cond = strcmp(word, mid-&gt;word)) &lt; 0)
      high = mid;
    <span style="color: #56b4e9; font-weight: bold;">else</span> <span style="color: #56b4e9; font-weight: bold;">if</span> (cond &gt; 0)
      low = mid + 1;
    <span style="color: #56b4e9; font-weight: bold;">else</span>
      <span style="color: #56b4e9; font-weight: bold;">return</span> mid;
  }
  <span style="color: #56b4e9; font-weight: bold;">return</span> <span style="color: #d55e00; font-weight: bold;">NULL</span>;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org93c3d14" class="outline-3">
<h3 id="org93c3d14">struct: tnode</h3>
<div class="outline-text-3" id="text-org93c3d14">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #56b4e9; font-weight: bold;">struct</span> <span style="color: #0072b2; font-weight: bold;">tnode</span> {          <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">the tree node: </span><span style="color: #009e73; font-style: italic;">*/</span>
  <span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #e69f00; font-weight: bold;">word</span>;           <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">points to the text </span><span style="color: #009e73; font-style: italic;">*/</span>
  <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">count</span>;            <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">number of occurrences </span><span style="color: #009e73; font-style: italic;">*/</span>
  <span style="color: #56b4e9; font-weight: bold;">struct</span> <span style="color: #0072b2; font-weight: bold;">tnode</span> *<span style="color: #e69f00; font-weight: bold;">left</span>;   <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">left child </span><span style="color: #009e73; font-style: italic;">*/</span>
  <span style="color: #56b4e9; font-weight: bold;">struct</span> <span style="color: #0072b2; font-weight: bold;">tnode</span> *<span style="color: #e69f00; font-weight: bold;">right</span>;  <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">right child </span><span style="color: #009e73; font-style: italic;">*/</span>
};
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf4a9332" class="outline-3">
<h3 id="orgf4a9332">program: word frequency count</h3>
<div class="outline-text-3" id="text-orgf4a9332">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;stdio.h&gt;</span>
<span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;ctype.h&gt;</span>
<span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;string.h&gt;</span>
<span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">"ch06.h"</span>

<span style="color: #0072b2;">#define</span> <span style="color: #e69f00; font-weight: bold;">MAXWORD</span> 100

<span style="color: #56b4e9; font-weight: bold;">struct</span> <span style="color: #0072b2; font-weight: bold;">tnode</span> *<span style="color: #d55e00;">addtree</span>(<span style="color: #56b4e9; font-weight: bold;">struct</span> <span style="color: #0072b2; font-weight: bold;">tnode</span> *, <span style="color: #0072b2; font-weight: bold;">char</span> *);
<span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">treeprint</span>(<span style="color: #56b4e9; font-weight: bold;">struct</span> <span style="color: #0072b2; font-weight: bold;">tnode</span> *);
<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #d55e00;">getword</span>(<span style="color: #0072b2; font-weight: bold;">char</span> *, <span style="color: #0072b2; font-weight: bold;">int</span>);

<span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">word frequency count </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #d55e00;">main</span>()
{
  <span style="color: #56b4e9; font-weight: bold;">struct</span> <span style="color: #0072b2; font-weight: bold;">tnode</span> *<span style="color: #e69f00; font-weight: bold;">root</span>;
  <span style="color: #0072b2; font-weight: bold;">char</span> <span style="color: #e69f00; font-weight: bold;">word</span>[MAXWORD];

  root = <span style="color: #d55e00; font-weight: bold;">NULL</span>;
  <span style="color: #56b4e9; font-weight: bold;">while</span> (getword(word, MAXWORD) != EOF)
    <span style="color: #56b4e9; font-weight: bold;">if</span> (isalpha(word[0]))
      root = addtree(root, word);
  treeprint(root);
  <span style="color: #56b4e9; font-weight: bold;">return</span> 0;
}
</pre>
</div>
</div>
</div>
