programming/c/code/c-lang.org
** function: addtree

#+BEGIN_SRC c
  struct tnode *talloc(void);
  char *strdup(char *);

  /* addtree: add a node with w, at or below p */
  struct treenode *addtree(struct tnode *p, char *w)
  {
    int cond;
    if (p == NULL) { /* a new word has arrived */
      p = talloc();  /* make a new node */
      p->word = strdup(w);
      p->count = 1;
      p->left = p->right = NULL;
    } else if ((cond = strcmp(w, p->word)) == 0)
      p->count++; /* repeated word */
    else if (cond < 0) /* less than into left subtree */
      p->left = addtree(p->left, w);
    else /* greater than into right subtree */
      p->right = addtree(p->right, w);
    return p;
  }
#+END_SRC

** function: treeprint

#+BEGIN_SRC c :tangle ch06.h
  /* treeprint: in-order print of tree p */
  void treeprint(struct tnode *p)
  {
    if (p != NULL) {
      treeprint(p->left);
      printf("%4d %s\n", p->count, p->word);
      treeprint(p->right);
    }
  }
#+END_SRC

** functions: talloc & strdup

#+BEGIN_SRC c
  #include <stdlib.h>

  /* talloc: make a tnode */
  struct tnode *talloc(void)
  {
    return (struct tnode *) malloc(sizeof(struct tnode));
  }

  char *strdup(char *s) /* make a duplicate of s */
  {
    char *p;

    p = (char *) malloc(strlen(s)+1); /* +1 for '\0' */
    if (p != NULL)
      strcpy(p, s);
    return p;
  }
#+END_SRC

** struct: nlist

#+BEGIN_SRC c
  struct nlist {		/* table entry: */
    struct nlist *next;	/* next entry in chain */
    char *name;		/* defined name */
    char *defn;		/* replacement text */
  };
#+END_SRC

** function: hash

#+BEGIN_SRC c
  /* hash: form hash value for string s */
  unsigned hash(char *s)
  {
    unsigned hashval;
    for (hashval = 0; *s != '\0'; s++)
      hashval = *s + 31 * hashval;
    return hashval % HASHSIZE;
  }
#+END_SRC

** function: lookup

#+BEGIN_SRC c
  /* lookup: look for s in hashtab */
  struct nlist *lookup(char *s)
  {
    struct nlist *np;
    for (np = hashtab[hash(s)]; np != NULL; np = np->next)
      if (strcmp(s, np->name) == 0)
        return np; /* found */
    return NULL; /* not found */
  }
#+END_SRC

