programming/c/code/c-lang.html

<div id="outline-container-org210f182" class="outline-3">
<h3 id="org210f182">function: addtree</h3>
<div class="outline-text-3" id="text-org210f182">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #56b4e9; font-weight: bold;">struct</span> <span style="color: #0072b2; font-weight: bold;">tnode</span> *<span style="color: #d55e00;">talloc</span>(<span style="color: #0072b2; font-weight: bold;">void</span>);
<span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #d55e00;">strdup</span>(<span style="color: #0072b2; font-weight: bold;">char</span> *);

<span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">addtree: add a node with w, at or below p </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #56b4e9; font-weight: bold;">struct</span> <span style="color: #0072b2; font-weight: bold;">treenode</span> *<span style="color: #d55e00;">addtree</span>(<span style="color: #56b4e9; font-weight: bold;">struct</span> <span style="color: #0072b2; font-weight: bold;">tnode</span> *<span style="color: #e69f00; font-weight: bold;">p</span>, <span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #e69f00; font-weight: bold;">w</span>)
{
  <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">cond</span>;
  <span style="color: #56b4e9; font-weight: bold;">if</span> (p == <span style="color: #d55e00; font-weight: bold;">NULL</span>) { <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">a new word has arrived </span><span style="color: #009e73; font-style: italic;">*/</span>
    p = talloc();  <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">make a new node </span><span style="color: #009e73; font-style: italic;">*/</span>
    p-&gt;word = strdup(w);
    p-&gt;count = 1;
    p-&gt;left = p-&gt;right = <span style="color: #d55e00; font-weight: bold;">NULL</span>;
  } <span style="color: #56b4e9; font-weight: bold;">else</span> <span style="color: #56b4e9; font-weight: bold;">if</span> ((cond = strcmp(w, p-&gt;word)) == 0)
    p-&gt;count++; <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">repeated word </span><span style="color: #009e73; font-style: italic;">*/</span>
  <span style="color: #56b4e9; font-weight: bold;">else</span> <span style="color: #56b4e9; font-weight: bold;">if</span> (cond &lt; 0) <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">less than into left subtree </span><span style="color: #009e73; font-style: italic;">*/</span>
    p-&gt;left = addtree(p-&gt;left, w);
  <span style="color: #56b4e9; font-weight: bold;">else</span> <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">greater than into right subtree </span><span style="color: #009e73; font-style: italic;">*/</span>
    p-&gt;right = addtree(p-&gt;right, w);
  <span style="color: #56b4e9; font-weight: bold;">return</span> p;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org36a351e" class="outline-3">
<h3 id="org36a351e">function: treeprint</h3>
<div class="outline-text-3" id="text-org36a351e">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">treeprint: in-order print of tree p </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">treeprint</span>(<span style="color: #56b4e9; font-weight: bold;">struct</span> <span style="color: #0072b2; font-weight: bold;">tnode</span> *<span style="color: #e69f00; font-weight: bold;">p</span>)
{
  <span style="color: #56b4e9; font-weight: bold;">if</span> (p != <span style="color: #d55e00; font-weight: bold;">NULL</span>) {
    treeprint(p-&gt;left);
    printf(<span style="color: #848ea9;">"%4d %s\n"</span>, p-&gt;count, p-&gt;word);
    treeprint(p-&gt;right);
  }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org4f80e42" class="outline-3">
<h3 id="org4f80e42">functions: talloc &amp; strdup</h3>
<div class="outline-text-3" id="text-org4f80e42">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;stdlib.h&gt;</span>

<span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">talloc: make a tnode </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #56b4e9; font-weight: bold;">struct</span> <span style="color: #0072b2; font-weight: bold;">tnode</span> *<span style="color: #d55e00;">talloc</span>(<span style="color: #0072b2; font-weight: bold;">void</span>)
{
  <span style="color: #56b4e9; font-weight: bold;">return</span> (<span style="color: #56b4e9; font-weight: bold;">struct</span> <span style="color: #0072b2; font-weight: bold;">tnode</span> *) malloc(<span style="color: #56b4e9; font-weight: bold;">sizeof</span>(<span style="color: #56b4e9; font-weight: bold;">struct</span> <span style="color: #0072b2; font-weight: bold;">tnode</span>));
}

<span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #d55e00;">strdup</span>(<span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #e69f00; font-weight: bold;">s</span>) <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">make a duplicate of s </span><span style="color: #009e73; font-style: italic;">*/</span>
{
  <span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #e69f00; font-weight: bold;">p</span>;

  p = (<span style="color: #0072b2; font-weight: bold;">char</span> *) malloc(strlen(s)+1); <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">+1 for '\0' </span><span style="color: #009e73; font-style: italic;">*/</span>
  <span style="color: #56b4e9; font-weight: bold;">if</span> (p != <span style="color: #d55e00; font-weight: bold;">NULL</span>)
    strcpy(p, s);
  <span style="color: #56b4e9; font-weight: bold;">return</span> p;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf10ab5f" class="outline-3">
<h3 id="orgf10ab5f">struct: nlist</h3>
<div class="outline-text-3" id="text-orgf10ab5f">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #56b4e9; font-weight: bold;">struct</span> <span style="color: #0072b2; font-weight: bold;">nlist</span> {          <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">table entry: </span><span style="color: #009e73; font-style: italic;">*/</span>
  <span style="color: #56b4e9; font-weight: bold;">struct</span> <span style="color: #0072b2; font-weight: bold;">nlist</span> *<span style="color: #e69f00; font-weight: bold;">next</span>;   <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">next entry in chain </span><span style="color: #009e73; font-style: italic;">*/</span>
  <span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #e69f00; font-weight: bold;">name</span>;           <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">defined name </span><span style="color: #009e73; font-style: italic;">*/</span>
  <span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #e69f00; font-weight: bold;">defn</span>;           <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">replacement text </span><span style="color: #009e73; font-style: italic;">*/</span>
};
</pre>
</div>
</div>
</div>

<div id="outline-container-org704d52c" class="outline-3">
<h3 id="org704d52c">function: hash</h3>
<div class="outline-text-3" id="text-org704d52c">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">hash: form hash value for string s </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #0072b2; font-weight: bold;">unsigned</span> <span style="color: #d55e00;">hash</span>(<span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #e69f00; font-weight: bold;">s</span>)
{
  <span style="color: #0072b2; font-weight: bold;">unsigned</span> <span style="color: #e69f00; font-weight: bold;">hashval</span>;
  <span style="color: #56b4e9; font-weight: bold;">for</span> (hashval = 0; *s != <span style="color: #848ea9;">'\0'</span>; s++)
    hashval = *s + 31 * hashval;
  <span style="color: #56b4e9; font-weight: bold;">return</span> hashval % HASHSIZE;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org4ec908e" class="outline-3">
<h3 id="org4ec908e">function: lookup</h3>
<div class="outline-text-3" id="text-org4ec908e">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">lookup: look for s in hashtab </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #56b4e9; font-weight: bold;">struct</span> <span style="color: #0072b2; font-weight: bold;">nlist</span> *<span style="color: #d55e00;">lookup</span>(<span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #e69f00; font-weight: bold;">s</span>)
{
  <span style="color: #56b4e9; font-weight: bold;">struct</span> <span style="color: #0072b2; font-weight: bold;">nlist</span> *<span style="color: #e69f00; font-weight: bold;">np</span>;
  <span style="color: #56b4e9; font-weight: bold;">for</span> (np = hashtab[hash(s)]; np != <span style="color: #d55e00; font-weight: bold;">NULL</span>; np = np-&gt;next)
    <span style="color: #56b4e9; font-weight: bold;">if</span> (strcmp(s, np-&gt;name) == 0)
      <span style="color: #56b4e9; font-weight: bold;">return</span> np; <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">found </span><span style="color: #009e73; font-style: italic;">*/</span>
  <span style="color: #56b4e9; font-weight: bold;">return</span> <span style="color: #d55e00; font-weight: bold;">NULL</span>; <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">not found </span><span style="color: #009e73; font-style: italic;">*/</span>
}
</pre>
</div>
</div>
</div>
