programming/c/code/c-lang.org
** function: install

#+BEGIN_SRC c
  struct nlist *lookup(char *);
  char *strdup(char *);

  /* install: put (name, defn) in hashtab */
  struct nlist *install(char *name, char *defn)
  {
    struct nlist *np;
    unsigned hashval;

    if ((np = lookup(name)) == NULL) { /* not found */
      np = (struct nlist *) malloc(sizeof(*np));
      if (np == NULL || (np->name = strdup(name)) == NULL)
        return NULL;
      hashval = hash(name);
      np->next = hashtab[hashval];
      hashtab[hashval] = np;
    } else /* already there */
      free((void *) np->defn); /*free previous defn */
    if ((np->defn = strdup(defn)) == NULL)
      return NULL;
    return np;
  }
#+END_SRC

** struct: tnode / Treenode

#+BEGIN_SRC c
  typedef struct tnode *Treeptr;

  typedef struct tnode {	/* the tree node: */
    char *word;		/* points to the text */
    int count;		/* number of occurrences */
    struct tnode *left;	/* left child */
    struct tnode *right;	/* right child */
  } Treenode;
#+END_SRC

** function: talloc

#+BEGIN_SRC c
  Treeptr talloc(void)
  {
    return (Treeptr) malloc(sizeof(Treenode));
  }
#+END_SRC

* Chapter 7 - Input and Output

** program: convert input to lower case

- =$ gcc lower.c=
- =./a.out=
- enter char(s) and RET

#+BEGIN_SRC c :tangle lower.c
  #include <stdio.h>
  #include <ctype.h>

  /* lower: convert input to lower case */
  main()
  {
      int c;

      while ((c = getchar()) != EOF)
          putchar(tolower(c));
      return 0;
  }
#+END_SRC

** program: ex printf myprint.c

printf("%.*s", max, s);

- how to assign a string of characters to a variable?
- define the max constant?
- note: * is followed by and =int=

#+BEGIN_SRC c :tangle myprint.c
  #include <stdio.h>

  #define max 12

  char s[max] = "hello, world";

  main()
  {
      printf("%.*s\n", max, s);
      printf("%s\n", s);          // %s
      printf("%10s\n", s);        // %10s
      printf("%.10s\n", s);       // %.10s
      printf("%-10s\n", s);       // %-10s
      printf("%.15s\n", s);       // %.15s
      printf("%-15s\n", s);       // %-15s
      printf("%15.10s\n", s);     // %15.10s
      printf("%-15.10s\n", s);    // %-15.10s
  }
#+END_SRC

output
#+BEGIN_EXAMPLE
  hello,.world
  hello,.world
  hello,.world
  hello,.wor
  hello,.world
  hello,.world
  hello,.world...
  .....hello,.wor
  hello,.wor
#+END_EXAMPLE

