programming/c/code/c-lang.html

<div id="outline-container-org89ad133" class="outline-3">
<h3 id="org89ad133">function: install</h3>
<div class="outline-text-3" id="text-org89ad133">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #56b4e9; font-weight: bold;">struct</span> <span style="color: #0072b2; font-weight: bold;">nlist</span> *<span style="color: #d55e00;">lookup</span>(<span style="color: #0072b2; font-weight: bold;">char</span> *);
<span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #d55e00;">strdup</span>(<span style="color: #0072b2; font-weight: bold;">char</span> *);

<span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">install: put (name, defn) in hashtab </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #56b4e9; font-weight: bold;">struct</span> <span style="color: #0072b2; font-weight: bold;">nlist</span> *<span style="color: #d55e00;">install</span>(<span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #e69f00; font-weight: bold;">name</span>, <span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #e69f00; font-weight: bold;">defn</span>)
{
  <span style="color: #56b4e9; font-weight: bold;">struct</span> <span style="color: #0072b2; font-weight: bold;">nlist</span> *<span style="color: #e69f00; font-weight: bold;">np</span>;
  <span style="color: #0072b2; font-weight: bold;">unsigned</span> <span style="color: #e69f00; font-weight: bold;">hashval</span>;

  <span style="color: #56b4e9; font-weight: bold;">if</span> ((np = lookup(name)) == <span style="color: #d55e00; font-weight: bold;">NULL</span>) { <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">not found </span><span style="color: #009e73; font-style: italic;">*/</span>
    np = (<span style="color: #56b4e9; font-weight: bold;">struct</span> <span style="color: #0072b2; font-weight: bold;">nlist</span> *) malloc(<span style="color: #56b4e9; font-weight: bold;">sizeof</span>(*np));
    <span style="color: #56b4e9; font-weight: bold;">if</span> (np == <span style="color: #d55e00; font-weight: bold;">NULL</span> || (np-&gt;name = strdup(name)) == <span style="color: #d55e00; font-weight: bold;">NULL</span>)
      <span style="color: #56b4e9; font-weight: bold;">return</span> <span style="color: #d55e00; font-weight: bold;">NULL</span>;
    hashval = hash(name);
    np-&gt;next = hashtab[hashval];
    hashtab[hashval] = np;
  } <span style="color: #56b4e9; font-weight: bold;">else</span> <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">already there </span><span style="color: #009e73; font-style: italic;">*/</span>
    free((<span style="color: #0072b2; font-weight: bold;">void</span> *) np-&gt;defn); <span style="color: #009e73; font-style: italic;">/*</span><span style="color: #009e73; font-style: italic;">free previous defn </span><span style="color: #009e73; font-style: italic;">*/</span>
  <span style="color: #56b4e9; font-weight: bold;">if</span> ((np-&gt;defn = strdup(defn)) == <span style="color: #d55e00; font-weight: bold;">NULL</span>)
    <span style="color: #56b4e9; font-weight: bold;">return</span> <span style="color: #d55e00; font-weight: bold;">NULL</span>;
  <span style="color: #56b4e9; font-weight: bold;">return</span> np;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org357605e" class="outline-3">
<h3 id="org357605e">struct: tnode / Treenode</h3>
<div class="outline-text-3" id="text-org357605e">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #56b4e9; font-weight: bold;">typedef</span> <span style="color: #56b4e9; font-weight: bold;">struct</span> <span style="color: #0072b2; font-weight: bold;">tnode</span> *<span style="color: #0072b2; font-weight: bold;">Treeptr</span>;

<span style="color: #56b4e9; font-weight: bold;">typedef</span> <span style="color: #56b4e9; font-weight: bold;">struct</span> <span style="color: #0072b2; font-weight: bold;">tnode</span> {  <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">the tree node: </span><span style="color: #009e73; font-style: italic;">*/</span>
  <span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #e69f00; font-weight: bold;">word</span>;           <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">points to the text </span><span style="color: #009e73; font-style: italic;">*/</span>
  <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">count</span>;            <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">number of occurrences </span><span style="color: #009e73; font-style: italic;">*/</span>
  <span style="color: #56b4e9; font-weight: bold;">struct</span> <span style="color: #0072b2; font-weight: bold;">tnode</span> *<span style="color: #e69f00; font-weight: bold;">left</span>;   <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">left child </span><span style="color: #009e73; font-style: italic;">*/</span>
  <span style="color: #56b4e9; font-weight: bold;">struct</span> <span style="color: #0072b2; font-weight: bold;">tnode</span> *<span style="color: #e69f00; font-weight: bold;">right</span>;  <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">right child </span><span style="color: #009e73; font-style: italic;">*/</span>
} <span style="color: #0072b2; font-weight: bold;">Treenode</span>;
</pre>
</div>
</div>
</div>

<div id="outline-container-orgca10ecb" class="outline-3">
<h3 id="orgca10ecb">function: talloc</h3>
<div class="outline-text-3" id="text-orgca10ecb">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #0072b2; font-weight: bold;">Treeptr</span> <span style="color: #d55e00;">talloc</span>(<span style="color: #0072b2; font-weight: bold;">void</span>)
{
  <span style="color: #56b4e9; font-weight: bold;">return</span> (<span style="color: #0072b2; font-weight: bold;">Treeptr</span>) malloc(<span style="color: #56b4e9; font-weight: bold;">sizeof</span>(Treenode));
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org124149e" class="outline-2">
<h2 id="org124149e">Chapter 7 - Input and Output</h2>
<div class="outline-text-2" id="text-org124149e">
</div>
<div id="outline-container-orgfe8042c" class="outline-3">
<h3 id="orgfe8042c">program: convert input to lower case</h3>
<div class="outline-text-3" id="text-orgfe8042c">
<ul class="org-ul">
<li><code>$ gcc lower.c</code></li>
<li><code>./a.out</code></li>
<li>enter char(s) and RET</li>
</ul>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;stdio.h&gt;</span>
<span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;ctype.h&gt;</span>

<span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">lower: convert input to lower case </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #d55e00;">main</span>()
{
    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">c</span>;

    <span style="color: #56b4e9; font-weight: bold;">while</span> ((c = getchar()) != EOF)
        putchar(tolower(c));
    <span style="color: #56b4e9; font-weight: bold;">return</span> 0;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org7962a6d" class="outline-3">
<h3 id="org7962a6d">program: ex printf myprint.c</h3>
<div class="outline-text-3" id="text-org7962a6d">
<p>
printf("%.*s", max, s);
</p>

<ul class="org-ul">
<li>how to assign a string of characters to a variable?</li>
<li>define the max constant?</li>
<li>note: * is followed by and <code>int</code></li>
</ul>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;stdio.h&gt;</span>

<span style="color: #0072b2;">#define</span> <span style="color: #e69f00; font-weight: bold;">max</span> 12

<span style="color: #0072b2; font-weight: bold;">char</span> <span style="color: #e69f00; font-weight: bold;">s</span>[max] = <span style="color: #848ea9;">"hello, world"</span>;

<span style="color: #d55e00;">main</span>()
{
    printf(<span style="color: #848ea9;">"%.*s\n"</span>, max, s);
    printf(<span style="color: #848ea9;">"%s\n"</span>, s);          <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">%s</span>
    printf(<span style="color: #848ea9;">"%10s\n"</span>, s);        <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">%10s</span>
    printf(<span style="color: #848ea9;">"%.10s\n"</span>, s);       <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">%.10s</span>
    printf(<span style="color: #848ea9;">"%-10s\n"</span>, s);       <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">%-10s</span>
    printf(<span style="color: #848ea9;">"%.15s\n"</span>, s);       <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">%.15s</span>
    printf(<span style="color: #848ea9;">"%-15s\n"</span>, s);       <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">%-15s</span>
    printf(<span style="color: #848ea9;">"%15.10s\n"</span>, s);     <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">%15.10s</span>
    printf(<span style="color: #848ea9;">"%-15.10s\n"</span>, s);    <span style="color: #009e73; font-style: italic;">// </span><span style="color: #009e73; font-style: italic;">%-15.10s</span>
}
</pre>
</div>

<p>
output
</p>
<pre class="example">
hello,.world
hello,.world
hello,.world
hello,.wor
hello,.world
hello,.world
hello,.world...
.....hello,.wor
hello,.wor
</pre>
</div>
</div>
