programming/c/code/c-lang.org
** program: minimal printf with variable argument list

#+BEGIN_SRC c :tangle minprintf.c
  #include <stdarg.h>
  #include <stdio.h>

  /* minprintf: minimal printf with variable argument list */
  void minprintf(char *fmt, ...)
  {
      va_list ap;                 /* points to each unnamed arg in turn */
      char *p, *sval;
      int ival;
      double dval;

      va_start(ap, fmt);          /* make ap point to 1st unnamed arg */
      for (p = fmt; *p; p++) {
          if (*p != '%') {
              putchar(*p);
              continue;
          }
          switch (*++p) {
          case 'd':
              ival = va_arg(ap, int);
              printf("%d", ival);
              break;
          case 'f':
              dval = va_arg(ap, double);
              printf("%f", dval);
              break;
          case 's':
              for (sval = va_arg(ap, char *); *sval; sval++)
                  putchar(*sval);
              break;
          default:
              putchar(*p);
              break;
          }
      }
      va_end(ap);                 /* clean up when done */
  }


  int main()
  {
       int xx = 7;
       char yy[] = "asdfasf";
       minprintf("%d\n",7);
       minprintf("%s\n",yy);
  }
#+END_SRC

** program: calculator

- calculates a running sum
- outputs numbers as float with percision 2.

#+BEGIN_SRC c :tangle krscan.c
  #include <stdio.h>

  main() /* rudimentary calculator */
  {
    double sum, v;

    sum = 0;
    while (scanf("%lf", &v) == 1)
      printf("\t%.2f\n", sum += v);
    return 0;
  }
#+END_SRC

** program: krcatv1

- works ok

#+BEGIN_SRC c :tangle krcat1.c
  #include <stdio.h>

  /* cat: concatenate files, version 1 */
  main(int argc, char *argv[])
  {
    FILE *fp;
    void filecopy(FILE *, FILE *);

      if (argc == 1) /* no args; copy standard input */
        filecopy(stdin, stdout);
      else
        while(--argc > 0)
          if ((fp = fopen(*++argv, "r")) == NULL) {
            printf("cat: can't open %s\n", *argv);
            return 1;
          } else {
            filecopy(fp, stdout);
            fclose(fp);
          }
    return 0;
  }

  /* filecopy: copy file ifp to file ofp */
  void filecopy(FILE *ifp, FILE *ofp)
  {
    int c;

    while ((c = getc(ifp)) != EOF)
      putc(c, ofp);
  }
#+END_SRC

** program: cat revised (error handling)

warnings about the exit

#+BEGIN_SRC c :tangle krcatv2.c
  #include <stdio.h>

  /* cat: concatenate files, version 2 */
  main(int argc, char *argv[])
  {
    FILE *fp;
    void filecopy(FILE *, FILE *);
    char *prog = argv[0]; /* program name for errors */

    if (argc == 1 ) /* no args; copy standard input */
      filecopy(stdin, stdout);
    else
      while (--argc > 0)
        if ((fp = fopen(*++argv, "r")) == NULL) {
          fprintf(stderr, "%s: can't open %s\n",
                  prog, *argv);
          exit(1);
        } else {
          filecopy(fp, stdout);
          fclose(fp);
        }
    if (ferror(stdout)) {
      fprintf(stderr, "%s: error writing stdout\n", prog);
      exit(2);
    }
    exit(0);
  }

  /* adding from previous program */

  /* filecopy: copy file ifp to file ofp */
  void filecopy(FILE *ifp, FILE *ofp)
  {
    int c;

    while ((c = getc(ifp)) != EOF)
      putc(c, ofp);
  }
#+END_SRC

