programming/c/code/c-lang.html

<div id="outline-container-org3f25718" class="outline-3">
<h3 id="org3f25718">program: minimal printf with variable argument list</h3>
<div class="outline-text-3" id="text-org3f25718">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;stdarg.h&gt;</span>
<span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;stdio.h&gt;</span>

<span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">minprintf: minimal printf with variable argument list </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">minprintf</span>(<span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #e69f00; font-weight: bold;">fmt</span>, ...)
{
    <span style="color: #0072b2; font-weight: bold;">va_list</span> <span style="color: #e69f00; font-weight: bold;">ap</span>;                 <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">points to each unnamed arg in turn </span><span style="color: #009e73; font-style: italic;">*/</span>
    <span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #e69f00; font-weight: bold;">p</span>, *<span style="color: #e69f00; font-weight: bold;">sval</span>;
    <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">ival</span>;
    <span style="color: #0072b2; font-weight: bold;">double</span> <span style="color: #e69f00; font-weight: bold;">dval</span>;

    va_start(ap, fmt);          <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">make ap point to 1st unnamed arg </span><span style="color: #009e73; font-style: italic;">*/</span>
    <span style="color: #56b4e9; font-weight: bold;">for</span> (p = fmt; *p; p++) {
        <span style="color: #56b4e9; font-weight: bold;">if</span> (*p != <span style="color: #848ea9;">'%'</span>) {
            putchar(*p);
            <span style="color: #56b4e9; font-weight: bold;">continue</span>;
        }
        <span style="color: #56b4e9; font-weight: bold;">switch</span> (*++p) {
        <span style="color: #56b4e9; font-weight: bold;">case</span> <span style="color: #848ea9;">'d'</span>:
            ival = va_arg(ap, <span style="color: #0072b2; font-weight: bold;">int</span>);
            printf(<span style="color: #848ea9;">"%d"</span>, ival);
            <span style="color: #56b4e9; font-weight: bold;">break</span>;
        <span style="color: #56b4e9; font-weight: bold;">case</span> <span style="color: #848ea9;">'f'</span>:
            dval = va_arg(ap, <span style="color: #0072b2; font-weight: bold;">double</span>);
            printf(<span style="color: #848ea9;">"%f"</span>, dval);
            <span style="color: #56b4e9; font-weight: bold;">break</span>;
        <span style="color: #56b4e9; font-weight: bold;">case</span> <span style="color: #848ea9;">'s'</span>:
            <span style="color: #56b4e9; font-weight: bold;">for</span> (sval = va_arg(ap, <span style="color: #0072b2; font-weight: bold;">char</span> *); *sval; sval++)
                putchar(*sval);
            <span style="color: #56b4e9; font-weight: bold;">break</span>;
        <span style="color: #56b4e9; font-weight: bold;">default</span>:
            putchar(*p);
            <span style="color: #56b4e9; font-weight: bold;">break</span>;
        }
    }
    va_end(ap);                 <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">clean up when done </span><span style="color: #009e73; font-style: italic;">*/</span>
}


<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #d55e00;">main</span>()
{
     <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">xx</span> = 7;
     <span style="color: #0072b2; font-weight: bold;">char</span> <span style="color: #e69f00; font-weight: bold;">yy</span>[] = <span style="color: #848ea9;">"asdfasf"</span>;
     minprintf(<span style="color: #848ea9;">"%d\n"</span>,7);
     minprintf(<span style="color: #848ea9;">"%s\n"</span>,yy);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf037b9b" class="outline-3">
<h3 id="orgf037b9b">program: calculator</h3>
<div class="outline-text-3" id="text-orgf037b9b">
<ul class="org-ul">
<li>calculates a running sum</li>
<li>outputs numbers as float with percision 2.</li>
</ul>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;stdio.h&gt;</span>

<span style="color: #d55e00;">main</span>() <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">rudimentary calculator </span><span style="color: #009e73; font-style: italic;">*/</span>
{
  <span style="color: #0072b2; font-weight: bold;">double</span> <span style="color: #e69f00; font-weight: bold;">sum</span>, <span style="color: #e69f00; font-weight: bold;">v</span>;

  sum = 0;
  <span style="color: #56b4e9; font-weight: bold;">while</span> (scanf(<span style="color: #848ea9;">"%lf"</span>, &amp;v) == 1)
    printf(<span style="color: #848ea9;">"\t%.2f\n"</span>, sum += v);
  <span style="color: #56b4e9; font-weight: bold;">return</span> 0;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orge1be2d5" class="outline-3">
<h3 id="orge1be2d5">program: krcatv1</h3>
<div class="outline-text-3" id="text-orge1be2d5">
<ul class="org-ul">
<li>works ok</li>
</ul>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;stdio.h&gt;</span>

<span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">cat: concatenate files, version 1 </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #d55e00;">main</span>(<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">argc</span>, <span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #e69f00; font-weight: bold;">argv</span>[])
{
  <span style="color: #0072b2; font-weight: bold;">FILE</span> *<span style="color: #e69f00; font-weight: bold;">fp</span>;
  <span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">filecopy</span>(<span style="color: #0072b2; font-weight: bold;">FILE</span> *, <span style="color: #0072b2; font-weight: bold;">FILE</span> *);

    <span style="color: #56b4e9; font-weight: bold;">if</span> (argc == 1) <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">no args; copy standard input </span><span style="color: #009e73; font-style: italic;">*/</span>
      filecopy(stdin, stdout);
    <span style="color: #56b4e9; font-weight: bold;">else</span>
      <span style="color: #56b4e9; font-weight: bold;">while</span>(--argc &gt; 0)
        <span style="color: #56b4e9; font-weight: bold;">if</span> ((fp = fopen(*++argv, <span style="color: #848ea9;">"r"</span>)) == <span style="color: #d55e00; font-weight: bold;">NULL</span>) {
          printf(<span style="color: #848ea9;">"cat: can't open %s\n"</span>, *argv);
          <span style="color: #56b4e9; font-weight: bold;">return</span> 1;
        } <span style="color: #56b4e9; font-weight: bold;">else</span> {
          filecopy(fp, stdout);
          fclose(fp);
        }
  <span style="color: #56b4e9; font-weight: bold;">return</span> 0;
}

<span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">filecopy: copy file ifp to file ofp </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">filecopy</span>(<span style="color: #0072b2; font-weight: bold;">FILE</span> *<span style="color: #e69f00; font-weight: bold;">ifp</span>, <span style="color: #0072b2; font-weight: bold;">FILE</span> *<span style="color: #e69f00; font-weight: bold;">ofp</span>)
{
  <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">c</span>;

  <span style="color: #56b4e9; font-weight: bold;">while</span> ((c = getc(ifp)) != EOF)
    putc(c, ofp);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org1dcbdca" class="outline-3">
<h3 id="org1dcbdca">program: cat revised (error handling)</h3>
<div class="outline-text-3" id="text-org1dcbdca">
<p>
warnings about the exit
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #0072b2;">#include</span> <span style="color: #848ea9;">&lt;stdio.h&gt;</span>

<span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">cat: concatenate files, version 2 </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #d55e00;">main</span>(<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">argc</span>, <span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #e69f00; font-weight: bold;">argv</span>[])
{
  <span style="color: #0072b2; font-weight: bold;">FILE</span> *<span style="color: #e69f00; font-weight: bold;">fp</span>;
  <span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">filecopy</span>(<span style="color: #0072b2; font-weight: bold;">FILE</span> *, <span style="color: #0072b2; font-weight: bold;">FILE</span> *);
  <span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #e69f00; font-weight: bold;">prog</span> = argv[0]; <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">program name for errors </span><span style="color: #009e73; font-style: italic;">*/</span>

  <span style="color: #56b4e9; font-weight: bold;">if</span> (argc == 1 ) <span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">no args; copy standard input </span><span style="color: #009e73; font-style: italic;">*/</span>
    filecopy(stdin, stdout);
  <span style="color: #56b4e9; font-weight: bold;">else</span>
    <span style="color: #56b4e9; font-weight: bold;">while</span> (--argc &gt; 0)
      <span style="color: #56b4e9; font-weight: bold;">if</span> ((fp = fopen(*++argv, <span style="color: #848ea9;">"r"</span>)) == <span style="color: #d55e00; font-weight: bold;">NULL</span>) {
        fprintf(stderr, <span style="color: #848ea9;">"%s: can't open %s\n"</span>,
                prog, *argv);
        exit(1);
      } <span style="color: #56b4e9; font-weight: bold;">else</span> {
        filecopy(fp, stdout);
        fclose(fp);
      }
  <span style="color: #56b4e9; font-weight: bold;">if</span> (ferror(stdout)) {
    fprintf(stderr, <span style="color: #848ea9;">"%s: error writing stdout\n"</span>, prog);
    exit(2);
  }
  exit(0);
}

<span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">adding from previous program </span><span style="color: #009e73; font-style: italic;">*/</span>

<span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">filecopy: copy file ifp to file ofp </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #0072b2; font-weight: bold;">void</span> <span style="color: #d55e00;">filecopy</span>(<span style="color: #0072b2; font-weight: bold;">FILE</span> *<span style="color: #e69f00; font-weight: bold;">ifp</span>, <span style="color: #0072b2; font-weight: bold;">FILE</span> *<span style="color: #e69f00; font-weight: bold;">ofp</span>)
{
  <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">c</span>;

  <span style="color: #56b4e9; font-weight: bold;">while</span> ((c = getc(ifp)) != EOF)
    putc(c, ofp);
}
</pre>
</div>
</div>
</div>
