programming/c/code/c-lang.org
** functions: fputs & fgets

#+BEGIN_SRC c :tangle fputsgets.c
  /* fgets: get at most n chars from iop */
  char *fgets(char *s, int n, FILE *iop)
  {
    register int c;
    register char *cs;

    cs = s;
    while (--n > 0 && (c = getc(iop)) != EOF)
      if ((*cs++ = c) == '\n')
        break;
    ,*cs = '\0';
    return (c == EOF && cs == s) ? NULL : s;
  }

  /* fputs: put string s on file iop */
  int fputs(char *s, FILE *iop)
  {
    int c;

    while (c = *s++)
      putc(c, iop);
    return ferror(iop) ? EOF : 0;
  }
#+END_SRC

** function: getline (using fgets)

#+BEGIN_SRC c :tangle fgets.c
  /* getline: read a line, return length */
  int getline(char *line, int max)
  {
    if (fgets(line, max, stdin) == NULL)
      return 0;
    else
      return strlen(line);
  }
#+END_SRC

* Chapter 8 - The UNIX System Interface
