programming/c/code/c-lang.html

<div id="outline-container-orgc185bc8" class="outline-3">
<h3 id="orgc185bc8">functions: fputs &amp; fgets</h3>
<div class="outline-text-3" id="text-orgc185bc8">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">fgets: get at most n chars from iop </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #d55e00;">fgets</span>(<span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #e69f00; font-weight: bold;">s</span>, <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">n</span>, <span style="color: #0072b2; font-weight: bold;">FILE</span> *<span style="color: #e69f00; font-weight: bold;">iop</span>)
{
  <span style="color: #56b4e9; font-weight: bold;">register</span> <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">c</span>;
  <span style="color: #56b4e9; font-weight: bold;">register</span> <span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #e69f00; font-weight: bold;">cs</span>;

  cs = s;
  <span style="color: #56b4e9; font-weight: bold;">while</span> (--n &gt; 0 &amp;&amp; (c = getc(iop)) != EOF)
    <span style="color: #56b4e9; font-weight: bold;">if</span> ((*cs++ = c) == <span style="color: #848ea9;">'\n'</span>)
      <span style="color: #56b4e9; font-weight: bold;">break</span>;
  *cs = <span style="color: #848ea9;">'\0'</span>;
  <span style="color: #56b4e9; font-weight: bold;">return</span> (c == EOF &amp;&amp; cs == s) ? <span style="color: #d55e00; font-weight: bold;">NULL</span> : s;
}

<span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">fputs: put string s on file iop </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #d55e00;">fputs</span>(<span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #e69f00; font-weight: bold;">s</span>, <span style="color: #0072b2; font-weight: bold;">FILE</span> *<span style="color: #e69f00; font-weight: bold;">iop</span>)
{
  <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">c</span>;

  <span style="color: #56b4e9; font-weight: bold;">while</span> (c = *s++)
    putc(c, iop);
  <span style="color: #56b4e9; font-weight: bold;">return</span> ferror(iop) ? EOF : 0;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org5efd2b1" class="outline-3">
<h3 id="org5efd2b1">function: getline (using fgets)</h3>
<div class="outline-text-3" id="text-org5efd2b1">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #009e73; font-style: italic;">/* </span><span style="color: #009e73; font-style: italic;">getline: read a line, return length </span><span style="color: #009e73; font-style: italic;">*/</span>
<span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #d55e00;">getline</span>(<span style="color: #0072b2; font-weight: bold;">char</span> *<span style="color: #e69f00; font-weight: bold;">line</span>, <span style="color: #0072b2; font-weight: bold;">int</span> <span style="color: #e69f00; font-weight: bold;">max</span>)
{
  <span style="color: #56b4e9; font-weight: bold;">if</span> (fgets(line, max, stdin) == <span style="color: #d55e00; font-weight: bold;">NULL</span>)
    <span style="color: #56b4e9; font-weight: bold;">return</span> 0;
  <span style="color: #56b4e9; font-weight: bold;">else</span>
    <span style="color: #56b4e9; font-weight: bold;">return</span> strlen(line);
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org22f30e2" class="outline-2">
<h2 id="org22f30e2">Chapter 8 - The UNIX System Interface</h2>
</div>
</div>
<div id="postamble" class="status">
<p class="validation"></p>
</div>
</body>
</html>
